[{"bookName":"Finlay Donovan Is Killing It: A Mystery","bookAuthor":"Elle Cosimano","bookPrice":"$26.99 $25.10","linkDetail":"https://bookshop.org/books/finlay-donovan-is-killing-it-a-mystery/9781250241702","bookDetail":{"bookDetail":{"price":"$25.10","sale":"$26.99","PublishDate":"February 02, 2021","Publisher":"Minotaur Books","Pages":"368","Dimensions":"5.7 X 8.6 X 1.2 inches | 0.9 pounds","Languages":"English","Type":"Hardcover","description":["One of New York Public Library's Best Books of 2021","Nominated for the Left Coast Crime 2022 Lefty Award for the Best Humorous Mystery","\"Funny and smart, twisty and surprising.\"--Megan Miranda"]},"Author":{"name":"Elle Cosimano","about":"Elle Cosimano is a USA Today bestselling author, an International Thriller Award winner, and an Edgar Award nominee. Elle's debut novel for adults, Finlay Donovan Is Killing It, kicked off a witty, fast-paced contemporary mystery series, which was a People magazine pick and was named one of New York Public Library's Best Books of 2021. In addition to writing novels for teens and adults, her essays have appeared in HuffPost and Time. Cosimano lives with her husband and two sons in Virginia."},"bookImage":"https://images-us.bookshop.org/ingram/9781250241702.jpg?height=500&v=v2"}},{"bookName":"In the Woods","bookAuthor":"Tana French","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/in-the-woods-9780143113492/9780143113492","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"June 01, 2008","Publisher":"Penguin Books","Pages":"448","Dimensions":"5.49 X 8.41 X 0.99 inches | 0.91 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Tana French","about":"\"It has become increasingly clear that American-born, Dublin-based Tana French is the most interesting, most important crime novelist to emerge in the past 10 years. (The Washington Post) Tana is the author of the bestselling In the Woods, The Likeness, Faithful Place, Broken Harbor, The Secret Place and The Trespasser. Her books have won awards including the Edgar, Anthony, Macavity, and Barry awards, the Los Angeles Times Award for Best Mystery/Thriller, and the Irish Book Award for Crime Fiction. She lives in Dublin with her family."},"bookImage":"https://images-us.bookshop.org/ingram/9780143113492.jpg?height=500&v=v2"}},{"bookName":"Shady Hollow","bookAuthor":"Juneau Black","bookPrice":"$16.00 $14.88","linkDetail":"https://bookshop.org/books/shady-hollow/9780593315712","bookDetail":{"bookDetail":{"price":"$14.88","sale":"$16.00","PublishDate":"January 25, 2022","Publisher":"Vintage Crime/Black Lizard","Pages":"240","Dimensions":"5.1 X 7.9 X 0.8 inches | 0.5 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Juneau Black","about":"Juneau Black is the pen name of authors Jocelyn Cole and Sharon Nagel. They share a love of excellent bookshops, fine cheeses, and good murders (in fictional form only). Though they are two separate people, if you ask either of them a question about their childhood, you are likely to get the same answer. This is a little unnerving for any number of reasons."},"bookImage":"https://images-us.bookshop.org/ingram/9780593315712.jpg?height=500&v=v2-4efeccf47f0293e181510cf595f5ef24"}},{"bookName":"Razorblade Tears","bookAuthor":"S. a. Cosby","bookPrice":"$26.99 $25.10","linkDetail":"https://bookshop.org/books/razorblade-tears-9781432892531/9781250252708","bookDetail":{"bookDetail":{"price":"$25.10","sale":"$26.99","PublishDate":"July 06, 2021","Publisher":"Flatiron Books","Pages":"336","Dimensions":"6.4 X 9.3 X 1.2 inches | 1.18 pounds","Languages":"English","Type":"Hardcover","description":{}},"Author":{"name":"S. a. Cosby","about":"S. A. Cosby is an Anthony Award-winning writer from Southeastern Virginia. He is the author of the New York Times bestseller Razorblade Tears and Blacktop Wasteland, which won the Los Angeles Times Book Prize and was a New York Times Notable Book, the Sun Sentinel's and BookPage's #1 Best Mystery of the year, a Goodreads Choice Awards Semifinalist, and was named a best of the year by NPR, The Guardian, and Library Journal, among others. When not writing, he is an avid hiker and chess player."},"bookImage":"https://images-us.bookshop.org/ingram/9781250252708.jpg?height=500&v=v2-f4ca074219955c7517fc09d8ba677867"}},{"bookName":"Trailed: One Woman's Quest to Solve the Shenandoah Murders","bookAuthor":"Kathryn Miles","bookPrice":"$28.95 $26.92","linkDetail":"https://bookshop.org/books/trailed-one-woman-s-quest-to-solve-the-shenandoah-murders-9798200880843/9781616209094","bookDetail":{"bookDetail":{"price":"$26.92","sale":"$28.95","PublishDate":"May 03, 2022","Publisher":"Algonquin Books","Pages":"320","Dimensions":"6.4 X 9.1 X 1.3 inches | 0.95 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Kathryn Miles","about":"Kathryn Miles is the author of five books. Her essays and articles have appeared in publications including Audubon, Best American Essays, Best American Sports Writing, the Boston Globe, the New York Times, Outside, Politico, and Time. A contributing editor at Down East magazine, Miles also serves as a scholar-in-residence for the Maine Humanities Council and as a faculty member in several MFA programs. Her website is https: //www.kathrynmiles.net."},"bookImage":"https://images-us.bookshop.org/ingram/9781616209094.jpg?height=500&v=v2-5c4d00f7e3818800c5e6707c8e7eec91"}},{"bookName":"All the Devils Are Here","bookAuthor":"Louise Penny","bookPrice":"$17.99 $16.73","linkDetail":"https://bookshop.org/books/all-the-devils-are-here-9781432888596/9781250145246","bookDetail":{"bookDetail":{"price":"$16.73","sale":"$17.99","PublishDate":"June 29, 2021","Publisher":"Minotaur Books","Pages":"464","Dimensions":"5.3 X 8.1 X 1.3 inches | 0.85 pounds","Languages":"English","Type":"Paperback","description":["PARADE MAGAZINE - ONE OF FALL'S MOST ANTICIPATED BOOKS","AARP'S MOST ANTICIPATED BOOKS OF FALL","CRIMEREADS - ONE OF THE BEST TRADITIONAL MYSTERIES OF THE YEAR ","GLOBE AND MAIL - TOP 100 BOOKS OF THE YEAR","CHRISTIAN SCIENCE MONITOR - ONE OF THE BEST NOVELS OF THE YEAR","KIRKUS REVIEWS - ONE OF THE BEST MYSTERIES/THRILLERS OF THE YEAR","LIBRARY JOURNAL - ONE OF THE BEST CRIME FICTION BOOKS OF THE YEAR"]},"Author":{"name":"Louise Penny","about":"LOUISE PENNY is the author of the #1 New York Times and Globe and Mail bestselling series of Chief Inspector Armand Gamache novels, which began with Still Life and include Glass Houses, Kingdom of the Blind, and A Better Man. She has won numerous awards, including a CWA Dagger and the Agatha Award (seven times), and was a finalist for the Edgar Award for Best Novel. In 2017, she received the Order of Canada for her contributions to Canadian culture. Louise lives in a small village south of Montréal."},"bookImage":"https://images-us.bookshop.org/ingram/9781250145246.jpg?height=500&v=v2"}},{"bookName":"We Own This City: A True Story of Crime, Cops, and Corruption","bookAuthor":"Justin Fenton","bookPrice":"$18.99 $17.66","linkDetail":"https://bookshop.org/books/we-own-this-city-a-true-story-of-crime-cops-and-corruption/9780593133682","bookDetail":{"bookDetail":{"price":"$17.66","sale":"$18.99","PublishDate":"March 15, 2022","Publisher":"Random House Trade","Pages":"352","Dimensions":"5.12 X 7.95 X 0.94 inches | 0.52 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Justin Fenton","about":"A longtime investigate reporter based in Baltimore, Justin Fenton was part of the Baltimore Sun's Pulitzer Prize finalist staff recognized for their coverage of the Baltimore riots that followed the death of Freddie Gray. He is now a reporter at the Baltimore Banner, and We Own This City is his first book."},"bookImage":"https://images-us.bookshop.org/ingram/9780593133682.jpg?height=500&v=v2-7b16de8f0c40f809778f32495cd8bcf2"}},{"bookName":"Cults: Inside the World's Most Notorious Groups and...","bookAuthor":"Max Cutler","bookPrice":"$29.99 $27.89","linkDetail":"https://bookshop.org/books/cults-inside-the-world-s-most-notorious-groups-and-understanding-the-people-who-joined-them/9781982133542","bookDetail":{"bookDetail":{"price":"$27.89","sale":"$29.99","PublishDate":"July 12, 2022","Publisher":"Gallery Books","Pages":"416","Dimensions":"","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Max Cutler Kevin Conley","about":"Max Cutler created and founded Parcast Studios in 2016. With Cutler at the helm, Parcast has launched some of the most popular and highly-ranked weekly podcasts, specializing in popular genres like mystery, true crime, pop culture, wellness, and history. After three years of exponential growth, Spotify acquired Parcast in 2019. Cutler maintains his role as head of the studio, revolutionizing the podcast space and creating hit after hit. Most recently featured on Fortune's 40 Under 40, Forbes 30 Under 30 and The Hollywood Reporter's 35 Rising Executives Under 35 lists, Cutler shows no sign of slowing down, as Parcast continues to lead the industry in global growth with over fifty adaptations to date and more to come.Kevin Conley is the author of the national bestseller Stud: Adventures in Breeding and The Full Burn: On the Set, at the Bar, Behind the Wheel, and Over the Edge with Hollywood Stuntmen. A former editor at The New Yorker, he has written for GQ, Sports Illustrated, and The New York Times Magazine, among others. He lives with his family in Connecticut."},"bookImage":"https://images-us.bookshop.org/ingram/9781982133542.jpg?height=500&v=v2-acddb81dfb9bb776ae41a78ab162370b"}},{"bookName":"London Rules","bookAuthor":"Mick Herron","bookPrice":"$16.95 $15.76","linkDetail":"https://bookshop.org/books/london-rules-9781616959616/9781641290241","bookDetail":{"bookDetail":{"price":"$15.76","sale":"$16.95","PublishDate":"May 28, 2019","Publisher":"Soho Crime","Pages":"368","Dimensions":"5.0 X 7.4 X 1.1 inches | 1.0 pounds","Languages":"English","Type":"Paperback","description":[" ","At MI5 headquarters Regent's Park, First Desk Claude Whelan is learning the ropes the hard way. Tasked with protecting a beleaguered prime minister, he's facing attack from all directions: from the showboating MP who orchestrated the Brexit vote, and now has his sights set on Number Ten; from the showboat's wife, a tabloid columnist, who's crucifying Whelan in print; from the PM's favorite Muslim, who's about to be elected mayor of the West Midlands, despite the dark secret he's hiding; and especially from his own deputy, Lady Di Taverner, who's alert for Claude's every stumble. Meanwhile, the country's being rocked by an apparently random string of terror attacks. "]},"Author":{"name":"Mick Herron","about":"Mick Herron is a British novelist and short-story writer who was born in Newcastle and studied English at Oxford. He is the author of six books in the Slough House series (Slow Horses, Dead Lions, Real Tigers, Spook Street, London Rules, and the novella The List) and four Oxford mysteries (Down Cemetery Road, The Last Voice You Hear, Why We Die, and Smoke and Whispers), as well as the standalone novels Reconstruction, Nobody Walks, and This Is What Happened. His work has won the CWA Gold Dagger for Best Crime Novel, the Steel Dagger for Best Thriller, and the Ellery Queen Readers Award, and been nominated for the Macavity, Barry, Shamus, and Theakstons Novel of the Year Awards. He currently lives in Oxford and writes full-time."},"bookImage":"https://images-us.bookshop.org/ingram/9781641290241.jpg?height=500&v=v2-d9df40e87eebc449b1b5f0cc38211ae2"}},{"bookName":"Joe Country","bookAuthor":"Mick Herron","bookPrice":"$16.95 $15.76","linkDetail":"https://bookshop.org/books/joe-country-9781641290555/9781641291330","bookDetail":{"bookDetail":{"price":"$15.76","sale":"$16.95","PublishDate":"March 17, 2020","Publisher":"Soho Crime","Pages":"368","Dimensions":"4.9 X 7.4 X 1.0 inches | 0.9 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Mick Herron","about":"Mick Herron is a British novelist and short story writer who was born in Newcastle and studied English at Oxford. He is the author of the Slough House espionage series, four Oxford mysteries, and several standalone novels. His work has won the CWA Gold Dagger for Best Crime Novel, the Steel Dagger for Best Thriller, and the Ellery Queen Readers Award, and been nominated for the Macavity, Barry, Shamus, and Theakstons Novel of the Year Awards. He currently lives in Oxford and writes full-time."},"bookImage":"https://images-us.bookshop.org/ingram/9781641291330.jpg?height=500&v=v2-5b50b7481fc620e2b8e957236639a434"}},{"bookName":"Pretty Girls","bookAuthor":"Karin Slaughter","bookPrice":"$9.99 $9.29","linkDetail":"https://bookshop.org/books/pretty-girls/9780062429070","bookDetail":{"bookDetail":{"price":"$9.29","sale":"$9.99","PublishDate":"April 26, 2016","Publisher":"William Morrow & Company","Pages":"592","Dimensions":"4.0 X 7.4 X 1.6 inches | 0.7 pounds","Languages":"English","Type":"Mass Market Paperbound","description":[" ","Kathy Reichs calls it \"extraordinary... a major achievement.\""," ","Gillian Flynn says of Karin Slaughter: \"I'd follow her anywhere.\""," ","See for yourself what these #1 "," "," ","More than twenty years ago, Claire and Lydia's teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss--a devastating wound that's cruelly ripped open when Claire's husband is killed."," ","The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: what could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago . . . and uncovering the possibility of redemption, and revenge, where they least expect it."," "]},"Author":{"name":"Karin Slaughter","about":"Karin Slaughter is the author of more than twenty instant New York Times bestselling novels, including the Edgar-nominated Cop Town and standalone novels Pretty Girls, The Good Daughter, and Pieces of Her. She is published in 120 countries with more than 40 million copies sold across the globe. Pieces of Her is a Netflix original series starring Toni Collette, and False Witness, the Grant County, and Will Trent series are in development for television. Slaughter is the founder of the Save the Libraries project--a nonprofit organization established to support libraries and library programming. A native of Georgia, she lives in Atlanta."},"bookImage":"https://images-us.bookshop.org/ingram/9780062429070.jpg?height=500&v=v2"}},{"bookName":"The Lioness","bookAuthor":"Chris Bohjalian","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/the-lioness-9780385544825/9780385544825","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"May 10, 2022","Publisher":"Doubleday Books","Pages":"336","Dimensions":"6.4 X 9.3 X 1.4 inches | 1.41 pounds","Languages":"English","Type":"Hardcover","description":["\n      "]},"Author":{"name":"Chris Bohjalian","about":"CHRIS BOHJALIAN is the #1 New York Times bestselling author of twenty-three books, including Hour of the Witch, The Red Lotus, Midwives, and The Flight Attendant, which has been made into an HBO Max limited series starring Kaley Cuoco. His other books include The Guest Room; Close Your Eyes, Hold Hands; The Sandcastle Girls; Skeletons at the Feast; and The Double Bind. His novels Secrets of Eden, Midwives, and Past the Bleachers were made into movies, and his work has been translated into more than thirty-five languages. He is also a playwright (Wingspan and Midwives). He lives in Vermont and can be found at chrisbohjalian.com or on Facebook, Instagram, Twitter, Litsy, and Goodreads, @chrisbohjalian"},"bookImage":"https://images-us.bookshop.org/ingram/9780385544825.jpg?height=500&v=v2-e4547e87f87eb843a70a7cc7243ff0e7"}},{"bookName":"The Madness of Crowds","bookAuthor":"Louise Penny","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/the-madness-of-crowds-9781432890889/9781250145260","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"August 24, 2021","Publisher":"Minotaur Books","Pages":"448","Dimensions":"6.54 X 9.13 X 1.57 inches | 1.41 pounds","Languages":"English","Type":"Hardcover","description":["CNN - A Most Anticipated Book of August","Bustle - A Most Anticipated Book of August","Chief Inspector Armand Gamache returns to Three Pines in #1 "]},"Author":{"name":"Louise Penny","about":"LOUISE PENNY is the author of the #1 New York Times, USA Today, and Globe and Mail bestselling series of Chief Inspector Armand Gamache novels. She has won numerous awards, including a CWA Dagger and the Agatha Award (seven times), and was a finalist for the Edgar Award for Best Novel. In 2017, she received the Order of Canada for her contributions to Canadian culture. Louise lives in a small village south of Montréal."},"bookImage":"https://images-us.bookshop.org/ingram/9781250145260.jpg?height=500&v=v2"}},{"bookName":"Tell Me Everything: The Story of a Private Investigation","bookAuthor":"Erika Krouse","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/tell-me-everything-the-story-of-a-private-investigation/9781250240309","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"March 15, 2022","Publisher":"Flatiron Books","Pages":"288","Dimensions":"6.5 X 9.9 X 1.1 inches | 1.0 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Erika Krouse","about":"Erika Krouse is the author of Come Up and See Me Sometime, a New York Times Notable Book, and Contenders, a finalist for the VCU Cabell First Novelist Award. Erika's fiction has been published in The New Yorker, The Atlantic, Ploughshares, One Story, and more. She teaches creative writing at the Lighthouse Writers Workshop and lives in Colorado. Her debut memoir, Tell Me Everything, has been optioned for TV adaptation by Playground Entertainment."},"bookImage":"https://images-us.bookshop.org/ingram/9781250240309.jpg?height=500&v=v2"}},{"bookName":"An Elderly Lady Is Up to No Good","bookAuthor":"Helene Tursten","bookPrice":"$12.99 $12.08","linkDetail":"https://bookshop.org/books/an-elderly-lady-is-up-to-no-good-9781987185935/9781641290111","bookDetail":{"bookDetail":{"price":"$12.08","sale":"$12.99","PublishDate":"November 06, 2018","Publisher":"Soho Crime","Pages":"184","Dimensions":"4.2 X 0.7 X 6.1 inches | 0.4 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Helene Tursten Marlaine Delargy","about":"Helene Tursten was a nurse and a dentist before she turned to writing. She is the author of the Irene Huss mysteries and the Embla Nyström mysteries, including Hunting Game and Winter Grave. Her books have been translated into 21 languages and made into a television series. She was born in Gothenburg, Sweden, where she now lives with her husband."},"bookImage":"https://images-us.bookshop.org/ingram/9781641290111.jpg?height=500&v=v2"}},{"bookName":"Four Aunties and a Wedding","bookAuthor":"Jesse Q. Sutanto","bookPrice":"$16.00 $14.88","linkDetail":"https://bookshop.org/books/four-aunties-and-a-wedding-9781432896263/9780593333051","bookDetail":{"bookDetail":{"price":"$14.88","sale":"$16.00","PublishDate":"March 29, 2022","Publisher":"Berkley Books","Pages":"304","Dimensions":"5.57 X 8.24 X 0.84 inches | 0.56 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Jesse Q. Sutanto","about":"Jesse Q. Sutanto grew up shuttling back and forth between Indonesia, Singapore, and Oxford, and considers all three places her home. She has a Masters from Oxford University, but she has yet to figure out how to say that without sounding obnoxious. Jesse has forty-two first cousins and thirty aunties and uncles, many of whom live just down the road. When she's not writing, she's gaming with her husband (mostly first-person shooters), or making a mess in the kitchen with her two daughters."},"bookImage":"https://images-us.bookshop.org/ingram/9780593333051.jpg?height=500&v=v2"}},{"bookName":"A Botanist's Guide to Parties and Poisons","bookAuthor":"Kate Khavari","bookPrice":"$26.99 $25.10","linkDetail":"https://bookshop.org/books/a-botanist-s-guide-to-parties-and-poisons-9781639100071/9781639100071","bookDetail":{"bookDetail":{"price":"$25.10","sale":"$26.99","PublishDate":"June 07, 2022","Publisher":"Crooked Lane Books","Pages":"304","Dimensions":"5.74 X 8.47 X 1.01 inches | 0.77 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Kate Khavari","about":"Kate Khavari is the author of fiction ranging from historical mysteries to high fantasy epics. She has her parents to thank for her fascination for historical mysteries, as she spent the majority of her childhood memorizing Sherlock Holmes's and Poirot's greatest quips. A former teacher, Kate has a deep appreciation for research and creativity, not to mention the multitasking ability she now relies on as an author and stay at home mother to her toddler son. She lives in the Dallas-Fort Worth area of Texas with her husband, son, and a lovely garden that contains absolutely no poisonous plants."},"bookImage":"https://images-us.bookshop.org/ingram/9781639100071.jpg?height=500&v=v2-9a0cd2b72d7b315b0de502d1965d4bd7"}},{"bookName":"Last Gangster in Austin: Frank Smith, Ronnie Earle, and the...","bookAuthor":"Jesse Sublett","bookPrice":"$21.95 $20.41","linkDetail":"https://bookshop.org/books/last-gangster-in-austin-frank-smith-ronnie-earle-and-the-end-of-a-junkyard-mafia-9781477325858/9781477323984","bookDetail":{"bookDetail":{"price":"$20.41","sale":"$21.95","PublishDate":"June 07, 2022","Publisher":"University of Texas Press","Pages":"224","Dimensions":"5.43 X 8.43 X 0.79 inches | 0.5 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Jesse Sublett","about":"Jesse Sublett is an author, musician, and painter in Austin. This is his fourteenth book. He last wrote about the Austin underworld in 1960s Austin Gangsters: Organized Crime That Rocked the Capital. Other notable books include Armadillo World Headquarters: A Memoir (with Eddie Wilson), and his memoir Never the Same Again: A Rock 'n' Roll Gothic."},"bookImage":"https://images-us.bookshop.org/ingram/9781477323984.jpg?height=500&v=v2-e7569d339b10acdf4566464a4b6341a7"}},{"bookName":"One-Shot Harry","bookAuthor":"Gary Phillips","bookPrice":"$24.95 $23.20","linkDetail":"https://bookshop.org/books/one-shot-harry-9798885780285/9781641292917","bookDetail":{"bookDetail":{"price":"$23.20","sale":"$24.95","PublishDate":"April 12, 2022","Publisher":"Soho Crime","Pages":"288","Dimensions":"5.6 X 8.3 X 1.1 inches | 1.0 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Gary Phillips","about":"Gary Phillips has published novels, comics, novellas, short stories and edited or co-edited several anthologies, including the Anthony-winning The Obama Inheritance: Fifteen Stories of Conspiracy Noir. Almost 30 years after its publication, his debut, Violent Spring, was named one of the essential crime novels of Los Angeles. He also was a story editor on Snowfall, an FX show about crack and the CIA in 1980s South Central, where he grew up."},"bookImage":"https://images-us.bookshop.org/ingram/9781641292917.jpg?height=500&v=v2-0db34f7139ee1a5dbec86419337c39e8"}},{"bookName":"Renovated to Death","bookAuthor":"Frank Anthony Polito","bookPrice":"$15.95 $14.83","linkDetail":"https://bookshop.org/books/renovated-to-death/9781496735584","bookDetail":{"bookDetail":{"price":"$14.83","sale":"$15.95","PublishDate":"May 31, 2022","Publisher":"Kensington Publishing Corporation","Pages":"288","Dimensions":"5.64 X 8.3 X 0.83 inches | 0.6 pounds","Languages":"English","Type":"Paperback","description":[" "," ","After a successful first season of "]},"Author":{"name":"Frank Anthony Polito","about":"Frank Anthony Polito is an award-winning author and playwright. His novels include the Lambda Award-winning Drama Queers!, Lost in the '90s, The Spirit of Detroit, and Band Fags!, among many others, and his plays have been produced around the country. He holds an MFA in Dramatic Writing from Carnegie Mellon and a BFA in Theatre from Wayne State. After growing up in the Detroit suburbs, Polito lived in New York City for 18 years before moving to Pleasant Ridge, Michigan with his partner Craig Bentley and their two dogs. They live in a 1924 Craftsman Colonial that they purchased on HGTV's House Hunters and have been renovating together since 2013. He can be found online at facebook.com/frankanthonypolito."},"bookImage":"https://images-us.bookshop.org/ingram/9781496735584.jpg?height=500&v=v2"}},{"bookName":"Vera Kelly: Lost and Found","bookAuthor":"Rosalie Knecht","bookPrice":"$15.95 $14.83","linkDetail":"https://bookshop.org/books/vera-kelly-lost-and-found/9781953534163","bookDetail":{"bookDetail":{"price":"$14.83","sale":"$15.95","PublishDate":"June 21, 2022","Publisher":"Tin House Books","Pages":"228","Dimensions":"5.5 X 8.4 X 0.7 inches | 0.55 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Rosalie Knecht","about":"Rosalie Knecht is the author of Who is Vera Kelly?, Vera Kelly is not a Mystery, winner of the Edgar Award, G.P. Putnam's Sons Sue Grafton Memorial Award and a finalist for the Lambda Literary Award, as well as a Relief Map, and a translation of Aira's The Seamstress and the Wind. She lives in Jersey City, NJ."},"bookImage":"https://images-us.bookshop.org/ingram/9781953534163.jpg?height=500&v=v2-7b31bc5f9a63075ed01c100a37efdcfb"}},{"bookName":"The Violence Project: How to Stop a Mass Shooting Epidemic","bookAuthor":"James Densley and Jillian Peterson","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/the-violence-project-how-to-stop-a-mass-shooting-epidemic-9781419752964/9781419752957","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"September 07, 2021","Publisher":"Harry N. Abrams","Pages":"240","Dimensions":"5.8 X 9.1 X 0.9 inches | 1.05 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Jillian Peterson James Densley","about":"Jillian Peterson, PhD, is a professor of criminology and criminal justice at Hamline University. She has led large-scale research studies on mental illness and crime, school shootings, and mass violence. James Densley, PhD, is a professor of criminal justice at Metropolitan State University, which is part of the Minnesota State system. He is known for his international work on gangs, criminal networks, violent extremism, and policing. Based in St. Paul, Minnesota, Jillian and James run The Violence Project, a nonpartisan, nonprofit research center known worldwide for its work on mass shooting prevention. The Violence Project has featured in CNN, Fox News, The New York Times, The Washington Post, The Wall Street Journal, and other leading media outlets."},"bookImage":"https://images-us.bookshop.org/ingram/9781419752957.jpg?height=500&v=v2"}},{"bookName":"The Science of Murder: The Forensics of Agatha Christie","bookAuthor":"Carla Valentine","bookPrice":"$16.99 $15.80","linkDetail":"https://bookshop.org/books/the-science-of-murder-the-forensics-of-agatha-christie/9781728251844","bookDetail":{"bookDetail":{"price":"$15.80","sale":"$16.99","PublishDate":"May 31, 2022","Publisher":"Sourcebooks","Pages":"432","Dimensions":"5.5 X 8.2 X 1.2 inches | 0.97 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Carla Valentine","about":"CARLA VALENTINE has a certificate and diploma in Anatomical Pathology Technology and, during her eight-year mortuary career, continued her professional development by studying forensic anthropology at military college and taking part in skeletal excavations in Belgium and Venice. She writes and researches themes around sex and death on her blog entitled The Chick and the Dead. She also runs a dating and networking site for death professionals called Dead Meet."},"bookImage":"https://images-us.bookshop.org/ingram/9781728251844.jpg?height=500&v=v2"}},{"bookName":"The Widows of Malabar Hill","bookAuthor":"Sujata Massey","bookPrice":"$15.95 $14.83","linkDetail":"https://bookshop.org/books/the-widows-of-malabar-hill/9781616959760","bookDetail":{"bookDetail":{"price":"$14.83","sale":"$15.95","PublishDate":"November 20, 2018","Publisher":"Soho Crime","Pages":"432","Dimensions":"5.5 X 1.0 X 8.25 inches | 0.85 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Sujata Massey","about":"Sujata Massey was born in England to parents from India and Germany, grew up in St. Paul, Minnesota, and lives in Baltimore, Maryland. She was a features reporter for the Baltimore Evening Sun before becoming a full-time novelist. The first Perveen Mistry novel, The Widows of Malabar Hill, was an international bestseller and won the Agatha, Macavity, and Mary Higgins Clark Awards. She is also the author of The Satapur Moonstone, the second Perveen Mistry novel. Visit her website at sujatamassey.com."},"bookImage":"https://images-us.bookshop.org/ingram/9781616959760.jpg?height=500&v=v2"}},{"bookName":"Fever Dream","bookAuthor":"Samanta Schweblin","bookPrice":"$17.00 $15.81","linkDetail":"https://bookshop.org/books/fever-dream-9781683244042/9780399184604","bookDetail":{"bookDetail":{"price":"$15.81","sale":"$17.00","PublishDate":"March 06, 2018","Publisher":"Riverhead Books","Pages":"192","Dimensions":"4.9 X 0.5 X 6.9 inches | 0.3 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Samanta Schweblin Megan McDowell","about":"Samanta Schweblin was chosen as one of the 22 best writers in Spanish under the age of 35 by Granta. She is the author of three story collections that have won numerous awards, including the prestigious Juan Rulfo Story Prize, and been translated into 20 languages. Fever Dream is her first novel and is longlisted for the Man Booker International Prize. Originally from Buenos Aires, she lives in Berlin. Megan McDowell has translated books by many contemporary South American and Spanish authors, and her translations have been published in The New Yorker, Harper's, The Paris Review, McSweeney's, Words Without Borders, and Vice, among other publications. She lives in Chile."},"bookImage":"https://images-us.bookshop.org/ingram/9780399184604.jpg?height=500&v=v2"}}]