[
  {
    "bookName": "I Hope This Finds You Well: Poems",
    "bookAuthor": "Kate Baer",
    "bookPrice": "$12.00 $11.16",
    "linkDetail": "https://bookshop.org/books/i-hope-this-finds-you-well-poems-9798200746033/9780063137998",
    "bookDetail": {
      "bookDetail": {
        "price": "$11.16",
        "sale": "$12.00",
        "PublishDate": "November 09, 2021",
        "Publisher": "Harper Perennial",
        "Pages": "96",
        "Dimensions": "4.96 X 7.32 X 0.39 inches | 0.2 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Kate Baer",
        "about": "Kate Baer is the 2x New York Times bestselling author of What Kind Of Woman and I Hope This Finds You Well. Her work has also been published in The New Yorker, Literary Hub, Huffington Post and The New York Times."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780063137998.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Path to Kindness: Poems of Connection and Joy",
    "bookAuthor": "",
    "bookPrice": "$14.95 $13.90",
    "linkDetail": "https://bookshop.org/books/the-path-to-kindness-poems-of-connection-and-joy/9781635865332",
    "bookDetail": {
      "bookDetail": {
        "price": "$13.90",
        "sale": "$14.95",
        "PublishDate": "April 12, 2022",
        "Publisher": "Storey Publishing",
        "Pages": "224",
        "Dimensions": "4.6 X 6.9 X 0.7 inches | 0.45 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "\n      "
        ]
      },
      "Author": {
        "name": "James Crews Danusha Laméris",
        "about": "James Crews is the editor of the best-selling anthology, How to Love the World, which has been featured on NPR's Morning Edition, in the Boston Globe, and the Washington Post, and is the author of four prize-winning collections of poetry: The Book of What Stays, Telling My Father, Bluebird, and Every Waking Moment. His poems have been reprinted in the New York Times Magazine, Ploughshares, The New Republic, and The Christian Century, and in former US poet laureate Ted Kooser's weekly newspaper column, \"American Life in Poetry,\" and featured on Tracy K. Smith's podcast, The Slowdown. He worked with Ted Kooser on \"American Life in Poetry,\" which reaches millions of readers across the world. Crews holds an MFA in creative writing from the University of Wisconsin-Madison and a PhD in writing and literature from the University of Nebraska-Lincoln. He teaches poetry at the University at Albany and lives with his husband in Shaftsbury, Vermont.Danusha Laméris is the author of two books: The Moons of August (Autumn House, 2014), which was chosen by Naomi Shihab Nye as the winner of the Autumn House Press poetry prize, and Bonfire Opera (University of Pittsburgh, 2020), which won the Northern California Book Award. Winner of the Lucille Clifton Legacy Award, she teaches in the Pacific University low-residency MFA Program and co-hosts with James Crews the Poetry of Resilience online seminars. She lives in Santa Cruz County, California."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781635865332.jpg?height=500&v=v2-6b024abeaaff2c08c40024aa5c8fdefb"
    }
  },
  {
    "bookName": "Customs: Poems",
    "bookAuthor": "Solmaz Sharif",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/customs-poems/9781644450796",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "March 01, 2022",
        "Publisher": "Graywolf Press",
        "Pages": "72",
        "Dimensions": "5.5 X 8.2 X 0.4 inches | 0.3 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Solmaz Sharif",
        "about": ""
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781644450796.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Trees Witness Everything",
    "bookAuthor": "Victoria Chang",
    "bookPrice": "$17.00 $15.81",
    "linkDetail": "https://bookshop.org/books/the-trees-witness-everything/9781556596322",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.81",
        "sale": "$17.00",
        "PublishDate": "April 26, 2022",
        "Publisher": "Copper Canyon Press",
        "Pages": "144",
        "Dimensions": "4.0 X 8.9 X 0.7 inches | 0.35 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Victoria Chang",
        "about": "Born in Detroit, Michigan to Taiwanese immigrants, Victoria Chang was educated at the University of Michigan, Harvard University, and Stanford Business School and holds an MFA in poetry from Warren Wilson. She is the author of six books of poetry, including Obit, which was named a New York Times 100 Notable Books of 2020 and included on Time Magazine's 100 Must-Read Books of 2020. She lives in Southern California with her family and serves as the Program Chair of Antioch's Low-Residency MFA Program."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781556596322.jpg?height=500&v=v2-d35f99d3c2a5ed7884a4e8699705fa37"
    }
  },
  {
    "bookName": "When I Grow Up I Want to Be a List of Further Possibilities",
    "bookAuthor": "Chen Chen",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/when-i-grow-up-i-want-to-be-a-list-of-further-possibilities-9781942683339/9781942683339",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "April 11, 2017",
        "Publisher": "BOA Editions",
        "Pages": "96",
        "Dimensions": "6.9 X 8.9 X 0.3 inches | 0.4 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "Chen Chen Jericho Brown",
        "about": "Chen Chen was born in Xiamen, China, and grew up in Massachusetts. His work has appeared in two chapbooks and in such publications as Poetry, Gulf Coast, Indiana Review, Best of the Net, and The Best American Poetry. The recipient of the 2016 A. Poulin, Jr. Poetry Prize, he has been awarded fellowships from Kundiman, the Saltonstall Foundation, Lambda Literary, and in 2015, he was a finalist for the Ruth Lilly and Dorothy Sargent Rosenberg Poetry Fellowships. He earned his BA at Hampshire College and his MFA at Syracuse University. Currently, he is pursuing a PhD in English and Creative Writing at Texas Tech University. Chen lives in Lubbock, Texas, with his partner, Jeff Gilbert, and their pug dog, Rupert Giles. Jericho Brown is the recipient of the Whiting Writers Award and fellowships from the Radcliffe Institute for Advanced Study at Harvard University and the National Endowment for the Arts. His first book, Please (New Issues, 2008), won the American Book Award, and his second book, The New Testament (Copper Canyon, 2014), was named one of the best poetry books of the year by Library Journal. His poems have appeared in The Nation, The New Republic, The New Yorker, and The Best American Poetry. Brown earned a PhD from the University of Houston, an MFA from the University of New Orleans, and a BA from Dillard University. He is an assistant professor in the creative writing program at Emory University in Atlanta."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781942683339.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "A Responsibility to Awe",
    "bookAuthor": "Rebecca Elson",
    "bookPrice": "$18.99 $17.66",
    "linkDetail": "https://bookshop.org/books/a-responsibility-to-awe/9781784106553",
    "bookDetail": {
      "bookDetail": {
        "price": "$17.66",
        "sale": "$18.99",
        "PublishDate": "September 27, 2018",
        "Publisher": "Carcanet Press",
        "Pages": "160",
        "Dimensions": "5.3 X 0.5 X 8.4 inches | 0.45 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Rebecca Elson Anne Berkeley Angelo Di Cintio",
        "about": "Rebecca Elson was an astronomer. Her principal work focused on globular clusters, teasing out the history of stellar birth, life and death. Born in Montreal, Quebec, of Canadian and US parents, she studied at Smith, St Andrews, and the University of British Columbia. She took her PhD at Cambridge, where she won an Isaac Newton Studentship. She started publishing poems while working at the Institute of Advanced Studies in Princeton, and researched at the Harvard Center for Astrophysics. In 1991 she returned to the Institute of Astronomy at Cambridge to work on the first Hubble data. She died in Cambridge in 1999, aged 39.Anne Berkeley's pamphlet The buoyancy aid and other poems was published in 1997, and a selection of her work appeared in Oxford Poets 2002. She won the TLS prize in 2000 and the Avron competition in 2004. Angelo di Cintio is an Italian artist to whom Rebecca Elson was married. Bernard O'Donoghue teaches Medieval English at Wadham College, Oxford, and has published seven books of poems, including Gunpowder, which won the Whitbread Prize for Poetry in 1995."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781784106553.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "New Moons: Contemporary Writing by North American Muslims",
    "bookAuthor": "",
    "bookPrice": "$21.95 $20.41",
    "linkDetail": "https://bookshop.org/books/new-moons-contemporary-writing-by-north-american-muslims/9781636280066",
    "bookDetail": {
      "bookDetail": {
        "price": "$20.41",
        "sale": "$21.95",
        "PublishDate": "November 16, 2021",
        "Publisher": "Red Hen Press",
        "Pages": "368",
        "Dimensions": "6.0 X 8.8 X 1.0 inches | 1.1 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Kazim Ali",
        "about": "Kazim Ali was born in the United Kingdom and has lived transnationally in the United States, Canada, India, France, and the Middle East. His books encompass multiple genres, including the volumes of poetry Inquisition, Sky Ward, winner of the Ohioana Book Award in Poetry; The Far Mosque, winner of Alice James Books' New England/New York Award; The Fortieth Day; All One's Blue; and the cross-genre texts Bright Felon and Wind Instrument. His novels include the recently published The Secret Room: A String Quartet and among his books of essays are the hybrid memoir Silver Road: Essays, Maps & Calligraphies and Fasting for Ramadan: Notes from a Spiritual Practice. He is also an accomplished translator (of Marguerite Duras, Sohrab Sepehri, Ananda Devi, Mahmoud Chokrollahi, and others) and an editor of several anthologies and books of criticism. After a career in public policy and organizing, Ali taught at various colleges and universities, including Oberlin College, Davidson College, St. Mary's College of California, and Naropa University. He is currently a Professor of Literature at the University of California, San Diego. His newest books are a volume of three long poems entitled The Voice of Sheila Chandra and a memoir of his Canadian childhood, Northern Light."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781636280066.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Registers of Illuminated Villages: Poems",
    "bookAuthor": "Tarfia Faizullah",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/registers-of-illuminated-villages-poems/9781555978006",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "March 06, 2018",
        "Publisher": "Graywolf Press",
        "Pages": "96",
        "Dimensions": "6.4 X 0.4 X 8.9 inches | 0.4 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Tarfia Faizullah",
        "about": "Tarfia Faizullah is the author of Seam, winner of a VIDA Award and a Great Lakes Colleges Association New Writers Award. She teaches at the University of Michigan and lives in Detroit."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781555978006.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Glass Harmonica",
    "bookAuthor": "Geoff Bouvier",
    "bookPrice": "$14.00",
    "linkDetail": "https://bookshop.org/books/glass-harmonica/9781935835035",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.00",
        "sale": "",
        "PublishDate": "July 15, 2011",
        "Publisher": "Quale Press",
        "Pages": "92",
        "Dimensions": "",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Geoff Bouvier",
        "about": "Geoff Bouvier's first book, LIVING ROOM, was selected by Heather McHugh as the 2005 APR/Honickman Prize winner and was published by Copper Canyon Press. In 2009, he served as the poet-in-residence at the University of California-Berkeley. For five years, he wrote long-form magazine journalism with The San Diego Reader, publishing over fifty cover stories in that time. His poems have appeared in numerous journals, including American Poetry Review, Boston Review, DENVER QUARTERLY, jubilat, NEW AMERICAN WRITING, and VOLT. GLASS HARMONICA was published by Quale Press in 2011."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781935835035.jpg?height=500&v=v2-b3ae3ca85cc2f33b6fc59add00000000"
    }
  },
  {
    "bookName": "Bless the Daughter Raised by a Voice in Her Head: Poems",
    "bookAuthor": "Warsan Shire",
    "bookPrice": "$17.00 $15.81",
    "linkDetail": "https://bookshop.org/books/bless-the-daughter-raised-by-a-voice-in-her-head-poems/9780593134351",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.81",
        "sale": "$17.00",
        "PublishDate": "March 01, 2022",
        "Publisher": "Random House Trade",
        "Pages": "96",
        "Dimensions": "5.4 X 8.8 X 0.5 inches | 0.28 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Warsan Shire",
        "about": "Warsan Shire is a Somali British writer and poet born in Nairobi and raised in London. She has written two chapbooks, Teaching My Mother How to Give Birth and Her Blue Body. She was awarded the inaugural Brunel International African Poetry Prize and served as the first Young Poet Laureate of London. She is the youngest member of the Royal Society of Literature and is included in the Penguin Modern Poets series. Shire wrote the poetry for the Peabody Award-winning visual album Lemonade and the Disney film Black Is King in collaboration with Beyoncé Knowles-Carter. She also wrote the short film Brave Girl Rising, highlighting the voices and faces of Somali girls in Africa's largest refugee camp. Warsan Shire lives in Los Angeles with her husband and two children. Bless the Daughter Raised by a Voice in Her Head is her full-length debut poetry collection."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780593134351.jpg?height=500&v=v2-575f30d16fdb73ad9918e0cfeb5db779"
    }
  },
  {
    "bookName": "You Better Be Lightning",
    "bookAuthor": "Andrea Gibson",
    "bookPrice": "$18.00 $16.74",
    "linkDetail": "https://bookshop.org/books/you-better-be-lightning/9781943735990",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.74",
        "sale": "$18.00",
        "PublishDate": "November 09, 2021",
        "Publisher": "Button Poetry",
        "Pages": "128",
        "Dimensions": "5.4 X 8.4 X 0.4 inches | 0.35 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "The poems range from close examination of the deeply personal to the vastness of the world, exploring the expansiveness of the human experience from love to illness, from space to climate change, and so much more in between. ",
          "One of the most celebrated poets and performers of the last two decades, Andrea Gibson's trademark honesty and vulnerability are on full display in "
        ]
      },
      "Author": {
        "name": "Andrea Gibson",
        "about": "One of the most celebrated and successful poets of the last two decades, Andrea Gibson began their career in 1999 with a break-up poem at an open mic in Boulder, Colorado. In 2008, Gibson leapt into the forefront of the national spoken word poetry scene when they won the first ever Woman of the World Poetry Slam. Gibson is the author of four previous books of poetry and has release seven spoken-word albums. The honesty of Gibson's work makes audiences and readers feel welcome as they are. They are based out of Boulder, CO."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781943735990.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Iliad: (penguin Classics Deluxe Edition)",
    "bookAuthor": "Homer",
    "bookPrice": "$20.00 $18.60",
    "linkDetail": "https://bookshop.org/books/the-iliad-penguin-classics-deluxe-edition-15586a81-3e1d-420d-9fd5-48bd1c9f2800/9780140275360",
    "bookDetail": {
      "bookDetail": {
        "price": "$18.60",
        "sale": "$20.00",
        "PublishDate": "November 01, 1998",
        "Publisher": "Penguin Group",
        "Pages": "704",
        "Dimensions": "5.7 X 8.4 X 1.9 inches | 1.65 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Homer Robert Fagles Bernard Knox",
        "about": "Homer was probably born around 725BC on the Coast of Asia Minor, now the coast of Turkey, but then really a part of Greece. Homer was the first Greek writer whose work survives. He was one of a long line of bards, or poets, who worked in the oral tradition. Homer and other bards of the time could recite, or chant, long epic poems. Both works attributed to Homer - the Iliad and the Odyssey - are over ten thousand lines long in the original. Homer must have had an amazing memory but was helped by the formulaic poetry style of the time.In the Iliad Homer sang of death and glory, of a few days in the struggle between the Greeks and the Trojans. Mortal men played out their fate under the gaze of the gods. The Odyssey is the original collection of tall traveller's tales. Odysseus, on his way home from the Trojan War, encounters all kinds of marvels from one-eyed giants to witches and beautiful temptresses. His adventures are many and memorable before he gets back to Ithaca and his faithful wife Penelope.We can never be certain that both these stories belonged to Homer. In fact 'Homer' may not be a real name but a kind of nickname meaning perhaps 'the hostage' or 'the blind one'. Whatever the truth of their origin, the two stories, developed around three thousand years ago, may well still be read in three thousand years' time.Robert Fagles (1933-2008) was Arthur W. Marks '19 Professor of Comparative Literature, Emeritus, at Princeton University. He was the recipient of the 1997 PEN/Ralph Manheim Medal for Translation and a 1996 Award in Literature from the American Academy of Arts and Letters. His translations include Sophocles's Three Theban Plays, Aeschylus's Oresteia (nominated for a National Book Award), Homer's Iliad (winner of the 1991 Harold Morton Landon Translation Award by The Academy of American Poets), Homer's Odyssey, and Virgil's Aeneid. Bernard Knox (1914-2010) was Director Emeritus of Harvard's Center for Hellenic Studies in Washington, D.C. He taught at Yale University for many years. Among his numerous honors are awards from the National Institute of Arts and Letters and the National Endowment for the Humanities. His works include The Heroic Temper: Studies in Sophoclean Tragedy, Oedipus at Thebes: Sophocles' Tragic Hero and His Time and Essays Ancient and Modern (awarded the 1989 PEN/Spielvogel-Diamonstein Award)."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780140275360.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Pilgrim Bell: Poems",
    "bookAuthor": "Kaveh Akbar",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/pilgrim-bell-poems/9781644450598",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "August 03, 2021",
        "Publisher": "Graywolf Press",
        "Pages": "80",
        "Dimensions": "6.5 X 9.0 X 0.35 inches | 0.3 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Kaveh Akbar",
        "about": "Kaveh Akbar is the author of Calling a Wolf a Wolf and has received honors such as a Levis Reading Prize and multiple Pushcart Prizes. Born in Tehran, Iran, he teaches at Purdue University and in low-residency programs at Warren Wilson and Randolph Colleges."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781644450598.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Soft Science",
    "bookAuthor": "Franny Choi",
    "bookPrice": "$16.95 $15.76",
    "linkDetail": "https://bookshop.org/books/soft-science/9781938584992",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.76",
        "sale": "$16.95",
        "PublishDate": "April 02, 2019",
        "Publisher": "Alice James Books",
        "Pages": "100",
        "Dimensions": "5.9 X 8.9 X 0.4 inches | 0.4 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          " ",
          " \"Franny Choi combines technology and poetry to stunning effect.\" -",
          " \"...these beautiful, fractal-like poems are meditations on identity and autonomy and offer consciousness-expanding forays into topics like violence and gender, love and isolation.\" -"
        ]
      },
      "Author": {
        "name": "Franny Choi",
        "about": "Franny Choi is a writer, performer, and educator. She is the author of Floating, Brilliant, Gone (Write Bloody, 2014) and the chapbook Death by Sex Machine (Sibling Rivalry Press, 2017). She has been a finalist for multiple national poetry slams, and her poems have appeared in Poetry Magazine, American Poetry Review, the New England Review, and elsewhere. She is a Kundiman Fellow, Senior News Editor for Hyphen, co-host of the podcast VS, and member of the Dark Noise Collective. Her second collection, Soft Science, is forthcoming from Alice James Books."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781938584992.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "We Had Our Reasons: Poems by Ricardo Ruiz and Other...",
    "bookAuthor": "Ricardo Ruiz",
    "bookPrice": "$18.00 $16.74",
    "linkDetail": "https://bookshop.org/books/we-had-our-reasons-poems-by-ricardo-ruiz-and-other-hardworking-mexicans-from-eastern-washington/9798985263220",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.74",
        "sale": "$18.00",
        "PublishDate": "May 03, 2022",
        "Publisher": "Pulley Press",
        "Pages": "212",
        "Dimensions": "5.83 X 8.27 X 0.53 inches | 0.52 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "Ricardo Ruiz",
        "about": "The son of potato factory workers, Ricardo hails from Othello, Washington and his works often draw from his experience as a first-generation Mexican-American. He is passionate about elevating the marginalized voices from rural communities and takes pride in being a conduit for cultural connection. His own struggles straddling cultures provide insight to the difficulties of the Mexican migrant worker and their families.Ricardo holds a Associates Degree in Business and Accounting from Big Bend Community College where he was recognized as Student of the year in both Business and Economics and English Composition. He also holds a Bachelors of Art in English: Creative Writing from the University of Washington and is an Army Veteran. While in the military Ricardo was recognized as Distinguished Honor Graduate and Distinguished Leader during his Advanced Leadership Course.Ricardo's happiest moments are when he is spending time with his children, writing with his daughter, playing video games with his son, cuddling his dad's dog Xena, and dancing in the kitchen with his wife-to-be. Ricardo takes pride in being a conduit for cultural connection and brings marginalized voices into the center of all conversations that he is in. His own struggles straddling cultures provide insight into the difficulties of the Mexican migrant worker and their families."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9798985263220.jpg?height=500&v=v2-d7480ac68093f5ef74455eb1c9062ec8"
    }
  },
  {
    "bookName": "If They Come for Us: Poems",
    "bookAuthor": "Fatimah Asghar",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/if-they-come-for-us-poems/9780525509783",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "August 07, 2018",
        "Publisher": "One World",
        "Pages": "128",
        "Dimensions": "5.4 X 8.1 X 0.5 inches | 0.3 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "\"Elegant and playful . . . The poet invents new forms and updates classic ones.\"--"
        ]
      },
      "Author": {
        "name": "Fatimah Asghar",
        "about": "Fatimah Asghar is a nationally touring poet, performer, educator, and writer. She is the writer of Brown Girls, an Emmy-nominated web series that highlights friendships between women of color. She is a member of Dark Noise and a Ruth Lilly and Dorothy Sargent Rosenberg Poetry Fellow."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780525509783.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Blood on the Fog: Pocket Poets Series No. 62",
    "bookAuthor": "Tongo Eisen-Martin",
    "bookPrice": "$15.95 $14.83",
    "linkDetail": "https://bookshop.org/books/blood-on-the-fog-pocket-poets-series-no-62/9780872868755",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.83",
        "sale": "$15.95",
        "PublishDate": "September 21, 2021",
        "Publisher": "City Lights Books",
        "Pages": "112",
        "Dimensions": "4.8 X 6.2 X 0.6 inches | 0.25 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Tongo Eisen-Martin",
        "about": "Tongo Eisen-Martin is the Poet Laureate of San Francisco, California. He is the author of Heaven Is All Goodbyes (City Lights Books, 2017), which was shortlisted for the Griffin International Poetry Prize, received the California Book Award for Poetry, an American Book Award, and a PEN Oakland Book Award. He is also the author of someone's dead already (Bootstrap Press, 2015). Blood on the Fog, his newest collection of poems, is volume 62 in the City Lights Pocket Poets Series."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780872868755.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Narrow Road to the Interior",
    "bookAuthor": "Kimiko Hahn",
    "bookPrice": "$17.00",
    "linkDetail": "https://bookshop.org/books/the-narrow-road-to-the-interior/9780393330274",
    "bookDetail": {
      "bookDetail": {
        "price": "$17.00",
        "sale": "",
        "PublishDate": "February 01, 2008",
        "Publisher": "W. W. Norton & Company",
        "Pages": "120",
        "Dimensions": "6.4 X 8.33 X 0.34 inches | 0.34 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Kimiko Hahn",
        "about": "Kimiko Hahn is the author of ten collections of poems. Her honors include a Guggenheim Fellowship, a PEN/Voelcker Award, and a Theodore Roethke Memorial Poetry Prize. A distinguished professor at Queens College, CUNY, she lives in Queens."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780393330274.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "How to Love the World: Poems of Gratitude and Hope",
    "bookAuthor": "James Crews",
    "bookPrice": "$14.95 $13.90",
    "linkDetail": "https://bookshop.org/books/how-to-love-the-world-poems-of-gratitude-and-hope/9781635863864",
    "bookDetail": {
      "bookDetail": {
        "price": "$13.90",
        "sale": "$14.95",
        "PublishDate": "March 23, 2021",
        "Publisher": "Storey Publishing",
        "Pages": "208",
        "Dimensions": "4.7 X 7.0 X 0.6 inches | 0.5 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "James Crews Ross Gay",
        "about": "James Crews is the editor of the best-selling anthology, How to Love the World, which has been featured on NPR's Morning Edition, in the Boston Globe, and the Washington Post, and is the author of four prize-winning collections of poetry: The Book of What Stays, Telling My Father, Bluebird, and Every Waking Moment. His poems have been reprinted in the New York Times Magazine, Ploughshares, The New Republic, and The Christian Century, and in former US poet laureate Ted Kooser's weekly newspaper column, \"American Life in Poetry,\" and featured on Tracy K. Smith's podcast, The Slowdown. He worked with Ted Kooser on \"American Life in Poetry,\" which reaches millions of readers across the world. Crews holds an MFA in creative writing from the University of Wisconsin-Madison and a PhD in writing and literature from the University of Nebraska-Lincoln. He teaches poetry at the University at Albany and lives with his husband in Shaftsbury, Vermont.Ross Gay is the New York Times bestselling author of The Book of Delights: Essays and four books of poetry. His Catalog of Unabashed Gratitude won the 2015 National Book Critics Circle Award and the 2016 Kingsley Tufts Poetry Award, and was a finalist for the National Book Award; and Be Holding won the 2021 PEN America Jean Stein Book Award. He is a founding board member of the Bloomington Community Orchard, a non-profit, free-fruit-for-all food justice and joy project. Gay has received fellowships from Cave Canem, the Bread Loaf Writer's Conference, and the Guggenheim Foundation. He teaches at Indiana University."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781635863864.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Appalachian Elegy: Poetry and Place",
    "bookAuthor": "Bell Hooks",
    "bookPrice": "$21.95",
    "linkDetail": "https://bookshop.org/books/appalachian-elegy-poetry-and-place/9780813136691",
    "bookDetail": {
      "bookDetail": {
        "price": "$21.95",
        "sale": "",
        "PublishDate": "September 28, 2012",
        "Publisher": "University Press of Kentucky",
        "Pages": "79",
        "Dimensions": "5.54 X 8.51 X 0.26 inches | 0.3 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Bell Hooks",
        "about": "bell hooks is the author of more than thirty books, including Ain't I a Woman? Black Women and Feminism, named by Publishers Weekly as one of the twenty most influential women's books of the last twenty years."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780813136691.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Queer Nature: A Poetry Anthology",
    "bookAuthor": "",
    "bookPrice": "$24.95 $23.20",
    "linkDetail": "https://bookshop.org/books/queer-nature-a-poetry-anthology/9781637680384",
    "bookDetail": {
      "bookDetail": {
        "price": "$23.20",
        "sale": "$24.95",
        "PublishDate": "May 11, 2022",
        "Publisher": "Autumn House Press",
        "Pages": "320",
        "Dimensions": "6.0 X 8.9 X 1.1 inches | 1.14 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "\n      "
        ]
      },
      "Author": {
        "name": "Michael Walsh",
        "about": "Michael Walsh is the author of poetry books including The Dirt Riddles and Creep Love, as well as two chapbooks: Adam Walking the Garden and Sleepwalks. His poems and stories have appeared in journals such as The Journal, Chattahoochee Review, Alaska Quarterly Review, Cimarron Review, Crab Orchard Review, Great River Review, North Dakota Quarterly, and Prairie Schooner. He lives in Minneapolis and works as a curriculum administrator at the University of Minnesota."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781637680384.jpg?height=500&v=v2-c6302402b3b64e857c641f66a83ae139"
    }
  },
  {
    "bookName": "We Want It All: An Anthology of Radical Trans Poetics",
    "bookAuthor": "",
    "bookPrice": "$22.95 $21.34",
    "linkDetail": "https://bookshop.org/books/we-want-it-all-an-anthology-of-radical-trans-poetics/9781643620336",
    "bookDetail": {
      "bookDetail": {
        "price": "$21.34",
        "sale": "$22.95",
        "PublishDate": "November 24, 2020",
        "Publisher": "Nightboat Books",
        "Pages": "480",
        "Dimensions": "6.0 X 9.0 X 1.3 inches | 1.65 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Andrea Abi-Karam Kay Gabriel",
        "about": "Kay Gabriel is a poet and essayist. She's the author of Elegy Department Spring / Candy Sonnets 1 (BOAAT Press, 2017), the recipient of fellowships from Lambda Literary and the Poetry Project, and recently completed her PhD at Princeton University. Andrea Abi-Karam is an arab-american genderqueer punk poet-performer cyborg, writing on the art of killing bros, the intricacies of cyborg bodies, trauma & delayed healing. Their chapbook, THE AFTERMATH (Commune Editions), attempts to queer Fanon's vision of how poetry fails to inspire revolution. Andrea's first book, EXTRATRANSMISSION (Kelsey Street Press, 2019), is a poetic critique of the U.S. military's role in the War on Terror."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781643620336.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "New Poets of Native Nations",
    "bookAuthor": "Heid E. Erdrich",
    "bookPrice": "$18.00 $16.74",
    "linkDetail": "https://bookshop.org/books/new-poets-of-native-nations/9781555978099",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.74",
        "sale": "$18.00",
        "PublishDate": "July 10, 2018",
        "Publisher": "Graywolf Press",
        "Pages": "304",
        "Dimensions": "6.0 X 8.9 X 0.9 inches | 1.05 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Heid E. Erdrich",
        "about": "Heid E. Erdrich is the author of five collections of poetry, including Curator of Ephemera at the New Museum for Archaic Media. She is Ojibwe enrolled at Turtle Mountain, and lives and teaches in Minneapolis."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781555978099.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Earth Room",
    "bookAuthor": "Rachel Mannheimer",
    "bookPrice": "$18.99 $17.66",
    "linkDetail": "https://bookshop.org/books/earth-room/9781955125109",
    "bookDetail": {
      "bookDetail": {
        "price": "$17.66",
        "sale": "$18.99",
        "PublishDate": "April 05, 2022",
        "Publisher": "Changes Pub.",
        "Pages": "100",
        "Dimensions": "4.8 X 6.9 X 0.5 inches | 0.25 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Rachel Mannheimer",
        "about": "RACHEL MANNHEIMER was born and raised in Anchorage, Alaska, and lives in New Haven, Connecticut, where she works as a literary scout and as a senior editor for The Yale Review. This is her first book."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781955125109.jpg?height=500&v=v2-1f421baa9a94bf9fee54084dc5f9a5ab"
    }
  },
  {
    "bookName": "Love Poems in Quarantine",
    "bookAuthor": "Sarah Ruhl",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/love-poems-in-quarantine/9781556596308",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "May 31, 2022",
        "Publisher": "Copper Canyon Press",
        "Pages": "144",
        "Dimensions": "5.43 X 7.4 X 0.47 inches | 0.45 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Sarah Ruhl",
        "about": "Sarah Ruhl is a playwright, poet, and essayist. She has been a two-time Pulitzer prize finalist, a Tony award nominee, and the recipient of the MacArthur genius award. She teaches at the Yale School of Drama and lives in Brooklyn with her children and husband."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781556596308.jpg?height=500&v=v2-ae429761f3056d40048eac0283af49af"
    }
  }
]