[{"bookName":"Mirrors in the Earth: Reflections on Self-Healing from the...","bookAuthor":"Asia Suler","bookPrice":"$19.95 $18.55","linkDetail":"https://bookshop.org/books/mirrors-in-the-earth-reflections-on-self-healing-from-the-living-world/9781623176914","bookDetail":{"bookDetail":{"price":"$18.55","sale":"$19.95","PublishDate":"June 28, 2022","Publisher":"North Atlantic Books","Pages":"320","Dimensions":"6.1 X 8.9 X 1.1 inches | 1.0 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Asia Suler","about":"ASIA SULER is an herbalist, nature writer, spiritual educator, ecological philosopher, social media figure, and entrepreneur. As a teacher in the realms of herbalism and Earth spirituality, she has taught for the most well-known herbal programs in the country, including the Chestnut School of Herbal Medicine, the Northwest School of Botanical Medicine, and The Blue Ridge School of Herbal Medicine. She has guided more than 10,000 people through her various online programs."},"bookImage":"https://images-us.bookshop.org/ingram/9781623176914.jpg?height=500&v=v2-338b51816b38dea250c691fc60c28dd5"}},{"bookName":"How We Heal: Uncover Your Power and Set Yourself Free","bookAuthor":"Alexandra Elle","bookPrice":"$24.95 $23.20","linkDetail":"https://bookshop.org/books/how-we-heal-uncover-your-power-and-set-yourself-free/9781797216263","bookDetail":{"bookDetail":{"price":"$23.20","sale":"$24.95","PublishDate":"November 08, 2022","Publisher":"Chronicle Books","Pages":"256","Dimensions":"0.0 X 0.0 X 0.0 inches | 0.0 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Alexandra Elle","about":"Alexandra Elle is a writer, wellness educator, and certified Breathwork coach. Her work has been featured by a wide range of media outlines, including the New York Times, NPR, Good Morning America, ABC News, Essence, The Cut, MindBodyGreen, Bet, and Forbes, among many others. She teaches workshops and leads retreats centered around writing and self-care, and was host of the popular hey, girl podcast. She is the author of several books and journals, including, most recently, After the Rain and the In Courage Journal. She lives in the Washington DC metro area with her husband and three daughters."},"bookImage":"https://images-us.bookshop.org/ingram/9781797216263.jpg?height=500&v=v2-a84ea218dc68264e793b064107289161"}},{"bookName":"Under the Skin: The Hidden Toll of Racism on American Lives...","bookAuthor":"Linda Villarosa","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/under-the-skin-the-hidden-toll-of-racism-on-american-lives-and-on-the-health-of-our-nation/9780385544887","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"June 14, 2022","Publisher":"Doubleday Books","Pages":"288","Dimensions":"6.43 X 9.31 X 1.14 inches | 1.25 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Linda Villarosa","about":"LINDA VILLAROSA is a journalism professor at the City University of New York and a contributing writer at the New York Times Magazine, where she covers the intersection of race and health. She has also served as executive editor at Essence and as a science editor at The New York Times. Her article on maternal and infant mortality was a finalist for a National Magazine Award. She is a contributor to The 1619 Project."},"bookImage":"https://images-us.bookshop.org/ingram/9780385544887.jpg?height=500&v=v2-be8cef32fdc84713a70569d54bff7def"}},{"bookName":"Four Thousand Weeks: Time Management for Mortals","bookAuthor":"Oliver Burkeman","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/four-thousand-weeks-time-management-for-mortals-9781250849359/9780374159122","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"August 10, 2021","Publisher":"Farrar, Straus and Giroux","Pages":"288","Dimensions":"5.7 X 8.2 X 1.0 inches | 0.9 pounds","Languages":"English","Type":"Hardcover","description":{}},"Author":{"name":"Oliver Burkeman","about":"Oliver Burkeman is the author of The Antidote: Happiness for People Who Can't Stand Positive Thinking. He wrote a long-running weekly column on psychology for The Guardian, This Column Will Change Your Life, and his work has also appeared in The New York Times, The Wall Street Journal, Psychologies, and New Philosopher. He lives in New York City."},"bookImage":"https://images-us.bookshop.org/ingram/9780374159122.jpg?height=500&v=v2"}},{"bookName":"Set Boundaries, Find Peace: A Guide to Reclaiming Yourself","bookAuthor":"Nedra Glover Tawwab","bookPrice":"$26.00 $24.18","linkDetail":"https://bookshop.org/books/set-boundaries-find-peace-a-guide-to-reclaiming-yourself/9780593192092","bookDetail":{"bookDetail":{"price":"$24.18","sale":"$26.00","PublishDate":"March 16, 2021","Publisher":"Tarcherperigee","Pages":"304","Dimensions":"6.3 X 8.1 X 1.2 inches | 0.95 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Nedra Glover Tawwab","about":"Nedra Glover Tawwab, a licensed therapist and sought-after relationship expert, has practiced relationship therapy for twelve years and is the founder and owner of the group therapy practice Kaleidoscope Counseling. She has been recently featured in The New York Times, The Guardian, Psychology Today, Self, and Vice, and has appeared on numerous podcasts, including Don't Keep Your Day Job, Do the Thing, and Therapy for Black Girls. Tawwab runs a popular Instagram account where she shares practices, tools, and reflections for mental health and hosts weekly Q&As about boundaries and relationships. She lives in Charlotte, North Carolina, with her family."},"bookImage":"https://images-us.bookshop.org/ingram/9780593192092.jpg?height=500&v=v2"}},{"bookName":"Essential Labor: Mothering as Social Change","bookAuthor":"Angela Garbes","bookPrice":"$25.99 $24.17","linkDetail":"https://bookshop.org/books/essential-labor-mothering-as-social-change/9780062937360","bookDetail":{"bookDetail":{"price":"$24.17","sale":"$25.99","PublishDate":"May 10, 2022","Publisher":"Harper Wave","Pages":"256","Dimensions":"5.7 X 8.2 X 1.2 inches | 0.7 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Angela Garbes","about":"Angela Garbes is the author of Like a Mother, an NPR Best Book of the Year and finalist for the Washington State Book Award in Nonfiction. Her work has appeared in The New York Times, The Cut, New York, Bon Appétit, and featured on NPR's Fresh Air. She also cohosts The Double Shift, an acclaimed podcast challenging the status quo of motherhood in America. She lives with her family in Seattle."},"bookImage":"https://images-us.bookshop.org/ingram/9780062937360.jpg?height=500&v=v2-f67f26cf7b971bcdb9a1dadd00000000"}},{"bookName":"On Repentance and Repair: Making Amends in an Unapologetic World","bookAuthor":"Danya Ruttenberg","bookPrice":"$25.95 $24.13","linkDetail":"https://bookshop.org/books/on-repentance-and-repair-making-amends-in-an-unapologetic-world/9780807010518","bookDetail":{"bookDetail":{"price":"$24.13","sale":"$25.95","PublishDate":"September 13, 2022","Publisher":"Beacon Press","Pages":"256","Dimensions":"","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Danya Ruttenberg","about":"Rabbi Danya Ruttenberg is an award-winning author and writer. She serves as Scholar in Residence at the National Council of Jewish Women (NCJW). Ruttenberg was named by Newsweek and The Daily Beast as one of ten \"rabbis to watch;\" as one of 21 \"faith leaders to watch\" by the Center for American Progress; and by The Forward as one of the top 50 most influential women rabbis. She has been a Washington Post Sunday crossword clue (83 Down) and called a \"wunderkund of Jewish feminism\" by Publishers Weekly. She has written for The New York Times, The Atlantic, Salon, Time, Newsweek, and many other publications, and contributes regularly to The Washington Post and The Forward. She is the author of seven books, including Nurture the Wow: Finding Spirituality in the Frustration, Boredom, Tears, Poop, Desperation, Wonder, and Radical Amazement of Parenting (Flatiron Books), which was a National Jewish Book Award finalist and PJ Library Parents' Choice selection; Surprised By God: How I Learned to Stop Worrying and Love Religion (Beacon Press), nominated for the Sami Rohr Prize for Jewish literature and a Hadassah Book Club selection.Before her ordination from the Ziegler School of Rabbinic Studies in 2008, she worked as a freelance writer, and has in the years since also served as rabbi and educator at Tufts and Northwestern Universities, for Hillel International, for the dialogue project Ask Big Questions and Avodah, an organization dedicated to creating leaders for economic justice. She lives in the Chicago area with her spouse and three children."},"bookImage":"https://images-us.bookshop.org/ingram/9780807010518.jpg?height=500&v=v2-1fd91298a8788edba570567165005b24"}},{"bookName":"For You When I Am Gone: Twelve Essential Questions to Tell a...","bookAuthor":"Steve Leder","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/for-you-when-i-am-gone-twelve-essential-questions-to-tell-a-life-story/9780593421550","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"June 07, 2022","Publisher":"Avery Publishing Group","Pages":"224","Dimensions":"5.34 X 7.36 X 0.9 inches | 0.56 pounds","Languages":"English","Type":"Hardcover","description":["\n      "]},"Author":{"name":"Steve Leder","about":"Steve Leder is the senior rabbi of Wilshire Boulevard Temple in Los Angeles. After receiving his degree in writing and graduating cum laude from Northwestern University, and spending time studying at Trinity College, Oxford University, Leder received a master's degree in Hebrew letters in 1986 and rabbinical ordination in 1987 from Hebrew Union College. He is the author of five books: The Extraordinary Nature of Ordinary Things, More Money Than God: Living a Rich Life Without Losing Your Soul, and the bestsellers More Beautiful Than Before: How Suffering Transforms Us, and The Beauty of What Remains."},"bookImage":"https://images-us.bookshop.org/ingram/9780593421550.jpg?height=500&v=v2-6e318651047057542054d08b2614224f"}},{"bookName":"American Detox: The Myth of Wellness and How We Can Truly Heal","bookAuthor":"Kerri Kelly","bookPrice":"$18.95 $17.62","linkDetail":"https://bookshop.org/books/american-detox-the-myth-of-wellness-and-how-we-can-truly-heal/9781623177249","bookDetail":{"bookDetail":{"price":"$17.62","sale":"$18.95","PublishDate":"June 07, 2022","Publisher":"North Atlantic Books","Pages":"320","Dimensions":"5.98 X 8.93 X 0.79 inches | 1.1 pounds","Languages":"English","Type":"Paperback","description":[" "]},"Author":{"name":"Kerri Kelly Angel Kyodo Williams","about":"KERRI KELLY is the founder of CTZNWELL, a movement that is democratizing wellbeing for all. A descendant of generations of firemen and first responders, Kelly has dedicated her life to kicking down doors and fighting for justice. She's been teaching yoga for over 20 years and is known for making waves in the wellness industry by challenging norms, disrupting systems and mobilizing people to act. A community organizer and wellness activist, Kelly is recognized across communities for her inspired work to bridge transformational practice with social justice. Kelly is a powerful facilitator, TED speaker and is the host of the prominent podcast CTZN. You can learn more about her work at kerrikelly.co and ctznwell.org."},"bookImage":"https://images-us.bookshop.org/ingram/9781623177249.jpg?height=500&v=v2-1c8c7e4a701c90580b113974de290c77"}},{"bookName":"Polysecure: Attachment, Trauma and Consensual Nonmonogamy","bookAuthor":"Jessica Fern","bookPrice":"$19.95 $18.55","linkDetail":"https://bookshop.org/books/polysecure-attachment-trauma-and-consensual-nonmonogamy/9781944934989","bookDetail":{"bookDetail":{"price":"$18.55","sale":"$19.95","PublishDate":"October 23, 2020","Publisher":"Thorntree Press","Pages":"288","Dimensions":"5.2 X 7.8 X 1.0 inches | 0.75 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Jessica Fern Nora Samaran Eve Rickert","about":"Jessica Fern is a psychotherapist, public speaker and trauma and relationship expert. In her international private practice, Jessica works with individuals, couples and people in multiple-partner relationships who no longer want to be limited by their reactive patterns, cultural conditioning, insecure attachment styles and past traumas, helping them to embody new possibilities in life and love. Naava Smolash, who sometimes writes under the pen name Nora Samaran, is the author of Turn This World Inside Out: The Emergence of Nurturance Culture (AK Press, 2019). Eve Rickert is the co-author of More Than Two: A Practical Guide to Ethical Polyamory (Thorntree Press, 2014)."},"bookImage":"https://images-us.bookshop.org/ingram/9781944934989.jpg?height=500&v=v2-81504dbfdb39ae5fa3718f585409ef13"}},{"bookName":"Finding Me: A Memoir","bookAuthor":"Viola Davis","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/finding-me-a-memoir/9780063037328","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"April 26, 2022","Publisher":"HarperOne","Pages":"304","Dimensions":"6.31 X 9.35 X 1.17 inches | 1.02 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Viola Davis","about":"VIOLA DAVIS is an internationally acclaimed actress and producer, known for her exceptional performances in television shows like 'How to Get Away with Murder' and movies like 'Fences' and 'The Help.' She is the winner of an Academy Award, an Emmy Award, and two Tony Awards, and in 2021 she won a Screen Actors Guild award for her role in 'Ma Rainey's Black Bottom'. In both 2012 and 2017, Time magazine named her one of the 100 most influential people in the world. Davis is also the founder and CEO of JuVee Productions, an artist driven production company that develops and produces independent film, theater, television, and digital content."},"bookImage":"https://images-us.bookshop.org/ingram/9780063037328.jpg?height=500&v=v2-ac6dfb8fb2a31f4c5dd006c5eb93467e"}},{"bookName":"Fox World: 500 Miles of Walks and Talks with an Old Fox","bookAuthor":"Jack Russell","bookPrice":"$24.99 $23.24","linkDetail":"https://bookshop.org/books/fox-world-500-miles-of-walks-and-talks-with-an-old-fox-9781039114470/9781039114463","bookDetail":{"bookDetail":{"price":"$23.24","sale":"$24.99","PublishDate":"October 13, 2021","Publisher":"FriesenPress","Pages":"348","Dimensions":"6.0 X 9.0 X 0.72 inches | 1.03 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Jack Russell","about":"Jack Russell wrote Fox World after heart trauma almost took his life four times. During recovery, he sought a calm refuge and found it in a nearby forest where he reunited with an aging red fox that he once saved as a pup. Jack drafted the 342-page Fox World on his smartphone as he and the wild red fox walked daily. Previously, Jack traveled North America and Europe for over three decades to assist Fortune 1000 companies with building distribution channels, developing new products, and launching start-ups. His efforts were instrumental in building a pet health insurance company in America and he underwrote over one hundred affinity marketing programs in his career. Jack studied economics at Virginia Commonwealth University and years later, attended executive programs at The Wharton School and Georgetown University. He lives in Lake Frederick, Virginia with his wife, Susan, and their Jack Russell terriers. Along with fighting for Mr. Fox's forest to be declared a nature preserve, Jack and Susan enjoy giving freedom rides to shelter dogs and assisting with their shelter medical bills. He is a beginner at photography, an ever-learning birdwatcher, a football fan when Green Bay is on television and an enthusiastic golfer of diminishing skills."},"bookImage":"https://images-us.bookshop.org/ingram/9781039114463.jpg?height=500&v=v2-bf3bc190d229a9ca3fe320dd00000000"}},{"bookName":"Just Giving: Why Philanthropy Is Failing Democracy and How It...","bookAuthor":"Rob Reich","bookPrice":"$17.95 $16.69","linkDetail":"https://bookshop.org/books/just-giving-why-philanthropy-is-failing-democracy-and-how-it-can-do-better/9780691202273","bookDetail":{"bookDetail":{"price":"$16.69","sale":"$17.95","PublishDate":"May 05, 2020","Publisher":"Princeton University Press","Pages":"256","Dimensions":"5.5 X 8.5 X 0.8 inches | 0.55 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Rob Reich","about":"Rob Reich is professor of political science and codirector of the Stanford Center on Philanthropy and Civil Society at Stanford University."},"bookImage":"https://images-us.bookshop.org/ingram/9780691202273.jpg?height=500&v=v2"}},{"bookName":"Who Is Wellness For?: An Examination of Wellness Culture and...","bookAuthor":"Fariha Roisin","bookPrice":"$26.99 $25.10","linkDetail":"https://bookshop.org/books/who-is-wellness-for-an-examination-of-wellness-culture-and-who-it-leaves-behind/9780063077089","bookDetail":{"bookDetail":{"price":"$25.10","sale":"$26.99","PublishDate":"June 14, 2022","Publisher":"Harper Wave","Pages":"320","Dimensions":"5.7 X 8.3 X 1.3 inches | 0.85 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Fariha Roisin","about":"Fariha Róisín is a multidisciplinary artist, born in Ontario, Canada. She was raised in Sydney, Australia, and is based in Los Angeles, California. As a Muslim queer Bangladeshi, she is interested in the margins, liminality, otherness, and the mercurial nature of being. Her work has pioneered a refreshing and renewed conversation about wellness, contemporary Islam and queer identities and has been featured in the New York Times, Al Jazeera, The Guardian, and Vogue. She is the author of the poetry collection How To Cure A Ghost (2019), as well as the novel Like A Bird (2020). Her upcoming work is a book of non-fiction entitled, Who Is Wellness For? out summer 2022, her second book of poetry is entitled Survival Takes a Wild Imagination."},"bookImage":"https://images-us.bookshop.org/ingram/9780063077089.jpg?height=500&v=v2-d1cf0e30ff4270ed29bb00dd00000000"}},{"bookName":"Good Inside: A Guide to Becoming the Parent You Want to Be","bookAuthor":"Becky Kennedy","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/good-inside-a-guide-to-becoming-the-parent-you-want-to-be/9780063159488","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"September 13, 2022","Publisher":"Harper Wave","Pages":"336","Dimensions":"0.0 X 0.0 X 0.0 inches | 0.0 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Becky Kennedy","about":"Dr. Becky Kennedy is a clinical psychologist and mom of three, recently named \"The Millennial Parenting Whisperer\" by TIME Magazine, who's rethinking the way we raise our children. She specializes in thinking deeply about what's happening for kids and translating these ideas into simple, actionable strategies for parents to use in their homes. Dr. Becky's goal is to empower parents to feel sturdier and more equipped to manage the challenges of parenting."},"bookImage":"https://images-us.bookshop.org/ingram/9780063159488.jpg?height=500&v=v2-a81d803fedc0bc19490c0add00000000"}},{"bookName":"How to Keep House While Drowning: A Gentle Approach to...","bookAuthor":"Kc Davis","bookPrice":"$22.00 $20.46","linkDetail":"https://bookshop.org/books/how-to-keep-house-while-drowning-a-gentle-approach-to-cleaning-and-organizing/9781668002841","bookDetail":{"bookDetail":{"price":"$20.46","sale":"$22.00","PublishDate":"April 26, 2022","Publisher":"S&s/Simon Element","Pages":"160","Dimensions":"5.3 X 7.21 X 0.66 inches | 0.54 pounds","Languages":"English","Type":"Hardcover","description":[" -How to start by setting priorities"," -How to stagger tasks so you won't procrastinate"," -How to clean in quick bursts within your existing daily routine"," -How to use creative shortcuts to transform a room from messy to functional "]},"Author":{"name":"Kc Davis","about":"KC Davis is a licensed professional therapist, author, and speaker. She is the creator of the mental health platform Struggle Care, where she shares a revolutionary approach to self and home care for those dealing with mental health, physical illness, and hard seasons of life. KC began her mental health journey at sixteen, when she entered treatment for drug addiction and mental health issues. After getting sober, she became a speaker and advocate for mental health and recovery. She lives in Houston with her husband and two daughters."},"bookImage":"https://images-us.bookshop.org/ingram/9781668002841.jpg?height=500&v=v2-cd2d884afcacfada037c1a585173b2cc"}},{"bookName":"A Haunted Road Atlas: Sinister Stops, Dangerous Destinations,...","bookAuthor":"Em Schulz and Christine Schiefer","bookPrice":"$24.99 $23.24","linkDetail":"https://bookshop.org/books/a-haunted-road-atlas-sinister-stops-dangerous-destinations-and-true-crime-tales/9781524872106","bookDetail":{"bookDetail":{"price":"$23.24","sale":"$24.99","PublishDate":"May 31, 2022","Publisher":"Andrews McMeel Publishing","Pages":"304","Dimensions":"6.93 X 8.98 X 0.94 inches | 1.8 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Christine Schiefer Em Schulz","about":"Christine Schiefer (she/her) and Em Schulz (they/them) are the hosts of paranormal and true crime podcast And That's Why We Drink. Every Sunday, they dig into a new set of spooky ghost stories and true crime tales. After all, they're just here for the boos! With over 100 million lifetime downloads, And That's Why We Drink is consistently featured in the top 20 on the comedy podcast charts, and winner of the 2019 and 2021 \"People's Voice\" Webby Award for Best Comedy Podcast."},"bookImage":"https://images-us.bookshop.org/ingram/9781524872106.jpg?height=500&v=v2-351b60d4a6fccb900a9b8cb4ec7fe078"}},{"bookName":"Grading for Equity: What It Is, Why It Matters, and How It...","bookAuthor":"Joe Feldman","bookPrice":"$38.45","linkDetail":"https://bookshop.org/books/grading-for-equity-what-it-is-why-it-matters-and-how-it-can-transform-schools-and-classrooms/9781506391571","bookDetail":{"bookDetail":{"price":"$38.45","sale":"","PublishDate":"October 15, 2018","Publisher":"Corwin Publishers","Pages":"296","Dimensions":"6.93 X 9.84 X 0.71 inches | 1.4 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Joe Feldman","about":"Joe Feldman has worked in education at the local and national levels for over 20 years in both charter and district school contexts, as a teacher, principal, and district administrator. He began his career as a high school English and American History teacher in Atlanta Public Schools and was the founding principal of a charter high school in Washington, DC. He has been the Director of Charter Schools for New York City Department of Education, the Director of K-12 Instruction in Union City, California, and was a Fellow to the Chief of Staff for U.S. Secretary of Education Richard Riley. Joe is currently CEO of Crescendo Education Group (crescendoedgroup.org), a consulting organization that partners with school and districts to help teachers use improved and more equitable grading and assessment practices. Joe graduated from Stanford, Harvard Graduate School of Education, and NYU Law School. He is the author of several articles on grading and assessment, and the author of Teaching Without Bells: What We Can Learn from Powerful Practice in Small Schools (Paradigm). He lives in Oakland with his wife and two children."},"bookImage":"https://images-us.bookshop.org/ingram/9781506391571.jpg?height=500&v=v2"}},{"bookName":"Thanks for the Feedback: The Science and Art of Receiving...","bookAuthor":"Douglas Stone and Sheila Heen","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/thanks-for-the-feedback-the-science-and-art-of-receiving-feedback-well/9780143127130","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"March 31, 2015","Publisher":"Penguin Books","Pages":"368","Dimensions":"5.4 X 8.3 X 0.9 inches | 0.65 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Sheila Heen Douglas Stone","about":"DOUGLAS STONE and SHEILA HEEN are lecturers on law at Harvard Law School and cofounders of Triad Consulting. They both live in New England."},"bookImage":"https://images-us.bookshop.org/ingram/9780143127130.jpg?height=500&v=v2"}},{"bookName":"Rest Is Resistance: A Manifesto","bookAuthor":"Tricia Hersey","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/rest-is-resistance-a-manifesto/9780316365215","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"October 11, 2022","Publisher":"Little, Brown Spark","Pages":"272","Dimensions":"0.0 X 0.0 X 0.0 inches | 0.0 pounds","Languages":"English","Type":"Hardcover","description":["In "]},"Author":{"name":"Tricia Hersey","about":"Tricia Hersey is an artist, poet, theologian and community organizer. She is the founder of The Nap Ministry, an organization that examines rest as a form of resistance by curating sacred spaces for the community to rest via Collective Napping Experiences, immersive workshops, performance art installations, and social media. Tricia is a global pioneer and originator of the movement to understand the liberatory power of rest. She is the creator of the Rest is Resistance and Rest as Reparations frameworks. Her research interests include Black liberation theology, womanism, somatics, and cultural trauma. Tricia is a Chicago native and currently lives in South Georgia."},"bookImage":"https://images-us.bookshop.org/ingram/9780316365215.jpg?height=500&v=v2-7534b605303185cdd952913979c3d3a0"}},{"bookName":"The Art of Gathering: How We Meet and Why It Matters","bookAuthor":"Priya Parker","bookPrice":"$17.00 $15.81","linkDetail":"https://bookshop.org/books/the-art-of-gathering-how-we-meet-and-why-it-matters/9781594634932","bookDetail":{"bookDetail":{"price":"$15.81","sale":"$17.00","PublishDate":"April 14, 2020","Publisher":"Riverhead Books","Pages":"320","Dimensions":"5.4 X 8.2 X 0.9 inches | 0.65 pounds","Languages":"English","Type":"Paperback","description":["From the host of the New York Times podcast "]},"Author":{"name":"Priya Parker","about":"PRIYA PARKER works to help people create collective meaning in their lives through gatherings. She is a master facilitator, strategic advisor, acclaimed author of The Art of Gathering: How We Meet and Why it Matters, and the host and executive producer of the New York Times podcast, Together Apart. Trained in the field of conflict resolution, Parker has worked on race relations on American college campuses and on peace processes in the Arab world, southern Africa, and India. She studied organizational design at M.I.T., public policy at the Harvard Kennedy School, and political and social thought at the University of Virginia. She lives with her husband and two children in Brooklyn, NY. @priyaparker"},"bookImage":"https://images-us.bookshop.org/ingram/9781594634932.jpg?height=500&v=v2"}},{"bookName":"The Little Book of Restorative Justice in Education:...","bookAuthor":"Dorothy Vaandering and Katherine Evans","bookPrice":"$5.99 $5.57","linkDetail":"https://bookshop.org/books/the-little-book-of-restorative-justice-in-education-fostering-responsibility-healing-and-hope-in-schools/9781680991727","bookDetail":{"bookDetail":{"price":"$5.57","sale":"$5.99","PublishDate":"September 20, 2016","Publisher":"Good Books","Pages":"144","Dimensions":"5.4 X 8.4 X 0.6 inches | 0.3 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Katherine Evans Dorothy Vaandering","about":"Katherine Evans, an Assistant Professor of Education at Eastern Mennonite University, has helped develop EMU's graduate program in Restorative Justice in Education, which supports educators as they create more just and equitable educational opportunities for all students including those marginalized based on race, ethnicity, ability, language, sexual orientation, and gender identity. She lives in Harrisonburg, Virginia. Dorothy Vaandering is an associate professor at the Faculty of Education, Memorial University, Newfoundland, and Labrador. After an extensive career as a Primary-Elementary educator, she now researches the implementation and sustainability of restorative justice in education. She passionately works to connect theory and practice in her current role as researcher and teacher-educator. She lives in Newfoundland and Labrador, Canada."},"bookImage":"https://images-us.bookshop.org/ingram/9781680991727.jpg?height=500&v=v2-5da3af7f1751c676861872769566ef9c"}},{"bookName":"Permission to Come Home: Reclaiming Mental Health as Asian...","bookAuthor":"Jenny Wang","bookPrice":"$29.00 $26.97","linkDetail":"https://bookshop.org/books/permission-to-come-home-reclaiming-mental-health-as-asian-americans/9781538708002","bookDetail":{"bookDetail":{"price":"$26.97","sale":"$29.00","PublishDate":"May 03, 2022","Publisher":"Balance","Pages":"288","Dimensions":"6.3 X 9.1 X 1.1 inches | 1.0 pounds","Languages":"English","Type":"Hardcover","description":["Asian Americans are experiencing a racial reckoning regarding their identity, inspiring them to radically reconsider the cultural frameworks that enabled their assimilation into American culture. As Asian Americans investigate the personal and societal effects of longstanding cultural narratives suggesting they take up as little space as possible, their mental health becomes critically important. Yet despite the fact that over 18 million people of Asian descent live in the United States today -- they are the racial group least likely to seek out mental health services. ",".\n      "]},"Author":{"name":"Jenny Wang","about":"Dr. Jenny Wang is a Taiwanese American clinical psychologist and national speaker on Asian American mental health and racial trauma in Asian American, BIPOC, and immigrant communities. Her work focuses on the intersection of Asian American identity, mental health, and social justice. She is the founder of the @asiansformentalhealth Instagram community, in which she discusses the unique experiences of Asian diaspora and immigrant communities. She spearheaded the Asian, Pacific Islander, and South Asian American Therapist Directory and its companion Canadian directory to help Asians seek culturally-reverent mental health providers."},"bookImage":"https://images-us.bookshop.org/ingram/9781538708002.jpg?height=500&v=v2-88aa28ec49a8b165bd154fbc295b27e0"}},{"bookName":"The Three Mothers: How the Mothers of Martin Luther King,...","bookAuthor":"Anna Malaika Tubbs","bookPrice":"$17.99 $16.73","linkDetail":"https://bookshop.org/books/the-three-mothers-how-the-mothers-of-martin-luther-king-jr-malcolm-x-and-james-baldwin-shaped-a-nation/9781250756138","bookDetail":{"bookDetail":{"price":"$16.73","sale":"$17.99","PublishDate":"December 28, 2021","Publisher":"Flatiron Books","Pages":"288","Dimensions":"5.3 X 8.1 X 0.9 inches | 0.56 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Anna Malaika Tubbs","about":"ANNA MALAIKA TUBBS is a multidisciplinary expert on current and historical understandings of race, gender, and equity. After graduating Phi Beta Kappa from Stanford University with a BA in anthropology, Anna earned her MA in gender studies and her Ph.D. in sociology from the University of Cambridge as a Bill and Melinda Gates Cambridge Scholar. She lives with her husband, Michael Tubbs, and their children Michael Malakai and Nehemiah Neven."},"bookImage":"https://images-us.bookshop.org/ingram/9781250756138.jpg?height=500&v=v2-80010a0b26facb30aa103a4410d6ff44"}}]