[{"bookName":"Think Again: The Power of Knowing What You Don't Know","bookAuthor":"Adam Grant","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/think-again-the-power-of-knowing-what-you-don-t-know-9781984878106/9781984878106","bookDetail":{"bookDetail":{"price":"$17.65","sale":"$18.98","PublishDate":"August 15, 2017","Publisher":"Ten Speed Press","Pages":"320","Dimensions":"5.8 X 1.0 X 8.8 inches | 0.95 pounds","Languages":"English","Type":"Paperback","description":["\"One of the most useful relationship books you could ever read, no matter what your lifestyle choices. It's chock-full of great information about communication, jealousy, asking for what you want, and maintaining a relationship with integrity.\"--Annie Sprinkle, PhD, sexologist and author of ","- Tributes to polyamory pioneers","- Tools for conflict resolution and instructions on how to improve interpersonal dynamics","- New sidebars on topics such as asexuality, sex workers, LGBTQ terminology, and ways polys can connect and thrive "]},"Author":{"name":"Janet W. Hardy Dossie Easton","about":"Janet W. Hardy is the author of more than ten books and the founder of Greenery Press, a now defunct publisher specializing in sexually adventurous books. She has an MFA in creative writing from St. Mary's College, and swore off monogamy in 1987. Dossie Easton is a licensed marriage and family therapist specializing in alternative sexualities and relationships, with twenty years of experience counseling open relationships. She is the author of four other books, and has been an ethical slut since 1969."},"bookImage":"https://images-us.bookshop.org/ingram/9780399579660.jpg?height=500&v=v2"}},{"bookName":"The Ethical Slut, Third Edition: A Practical Guide to...","bookAuthor":"Dossie Easton and Janet W. Hardy","bookPrice":"$18.98 $17.65","linkDetail":"https://bookshop.org/books/the-ethical-slut-third-edition-a-practical-guide-to-polyamory-open-relationships-and-other-freedoms-in-sex-and-love-revised/9780399579660","bookDetail":{"bookDetail":{"price":"$14.88","sale":"$16.00","PublishDate":"September 01, 1995","Publisher":"Anchor Books","Pages":"272","Dimensions":"5.1 X 7.7 X 0.9 inches | 0.48 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Anne Lamott","about":"Anne Lamott is the author of the New York Times bestsellers Almost Everything; Hallelujah Anyway; Help, Thanks, Wow; Small Victories; Stitches; Some Assembly Required; Grace (Eventually); Plan B; Traveling Mercies; and Operating Instructions. She is also the author of seven novels, including Imperfect Birds and Rosie. A past recipient of a Guggenheim Fellowship and an inductee to the California Hall of Fame, she lives in Northern California."},"bookImage":"https://images-us.bookshop.org/ingram/9780385480017.jpg?height=500&v=v2"}},{"bookName":"Bird by Bird: Some Instructions on Writing and Life","bookAuthor":"Anne Lamott","bookPrice":"$16.00 $14.88","linkDetail":"https://bookshop.org/books/bird-by-bird-some-instructions-on-writing-and-life/9780385480017","bookDetail":{"bookDetail":{"price":"$14.83","sale":"$15.95","PublishDate":"March 08, 2022","Publisher":"Soho Press","Pages":"168","Dimensions":"5.5 X 8.2 X 0.7 inches | 0.5 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Matt Bell","about":"Matt Bell is the author most recently of the novels Scrapper (a Michigan Notable Book) and In the House upon the Dirt between the Lake and the Woods (a finalist for the Young Lions Fiction Award and an Indies Choice Adult Debut Book of the Year Honor Recipient, as well as the winner of the Paula Anderson Book Award). His stories have appeared in Best American Mystery Stories, Tin House, Conjunctions, Fairy Tale Review, Gulf Coast, and many other publications. A native of Michigan, he now teaches creative writing at Arizona State University."},"bookImage":"https://images-us.bookshop.org/ingram/9781641293419.jpg?height=500&v=v2-dc250b9c3fdba11746fbf4d583415505"}},{"bookName":"Refuse to Be Done: How to Write and Rewrite a Novel in Three...","bookAuthor":"Matt Bell","bookPrice":"$15.95 $14.83","linkDetail":"https://bookshop.org/books/refuse-to-be-done-how-to-write-and-rewrite-a-novel-in-three-drafts/9781641293419","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"February 02, 2021","Publisher":"Viking","Pages":"320","Dimensions":"6.1 X 9.1 X 1.3 inches | 1.24 pounds","Languages":"English","Type":"Hardcover","description":["--Brené Brown, Ph.D., #1 "]},"Author":{"name":"Adam Grant","about":"Adam Grant is an organizational psychologist at Wharton, where he has been the top-rated professor for seven straight years. He is one of TED's most popular speakers, his books have sold millions of copies, his talks have been viewed more than 25 million times, and his podcast WorkLife with Adam Grant has topped the charts. His pioneering research has inspired people to rethink fundamental assumptions about motivation, generosity, and creativity. He has been recognized as one of the world's ten most influential management thinkers and Fortune's 40 Under 40, and has received distinguished scientific achievement awards from the American Psychological Association and the National Science Foundation. Adam received his B.A. from Harvard and his Ph.D. from the University of Michigan, and he is a former Junior Olympic springboard diver. He lives in Philadelphia with his wife and their three children."},"bookImage":"https://images-us.bookshop.org/ingram/9781984878106.jpg?height=500&v=v2-565e142b9d3e6292b67ed3485a5dae26"}},{"bookName":"Nature, Culture and the Sacred: A Woman Listens For Leadership","bookAuthor":"Nina Simons","bookPrice":"$16.95 $15.76","linkDetail":"https://bookshop.org/books/nature-culture-and-the-sacred-a-woman-listens-for-leadership-9781734757170/9781734757170","bookDetail":{"bookDetail":{"price":"$32.50","sale":"$34.95","PublishDate":"February 29, 2016","Publisher":"Jossey-Bass","Pages":"384","Dimensions":"7.4 X 9.1 X 0.7 inches | 1.4 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Elena Aguilar","about":"ELENA AGUILAR is a teacher, coach and consultant with over twenty years of experience working in schools. Elena is also the author of The Art of Coaching: Effective Strategies for School Transformation. She has been a frequent writer for Edutopia since 2008 and writes a blog on EdWeek Teacher for coaches."},"bookImage":"https://images-us.bookshop.org/ingram/9781118984154.jpg?height=500&v=v2"}},{"bookName":"Do Hard Things: Why We Get Resilience Wrong and the...","bookAuthor":"Steve Magness","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/do-hard-things-why-we-get-resilience-wrong-and-the-surprising-science-of-real-toughness/9780063098619","bookDetail":{"bookDetail":{"price":"$15.76","sale":"$16.95","PublishDate":"June 07, 2022","Publisher":"Green Fire Press","Pages":"352","Dimensions":"6.0 X 9.0 X 0.79 inches | 1.13 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Nina Simons Anneke Campbell","about":"NINA SIMONS, co-founder of Bioneers, is a social entrepreneur passionate about reinventing leadership, restoring the feminine, and co-creating a healthy and equitable future for all life on Earth. An advocate for social and environmental healing, she speaks and teaches internationally on leadership and transformational social change and is dedicated to the value of creating truly diverse collaborations and connections among issues, leaders and movements."},"bookImage":"https://images-us.bookshop.org/ingram/9781734757170.jpg?height=500&v=v2"}},{"bookName":"The Art of Coaching Teams: Building Resilient Communities...","bookAuthor":"Elena Aguilar","bookPrice":"$34.95 $32.50","linkDetail":"https://bookshop.org/books/the-art-of-coaching-teams-building-resilient-communities-that-transform-schools/9781118984154","bookDetail":{"bookDetail":{"price":"$24.99","sale":"","PublishDate":"October 15, 2019","Publisher":"Barbara W. Sarnecka","Pages":"368","Dimensions":"6.0 X 9.0 X 0.76 inches | 1.08 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Barbara W. Sarnecka","about":"Barbara W. Sarnecka is a Professor of Cognitive Sciences at the University of California, Irvine. She is the creator of the graduate Writing Workshop seminar, guiding dozens of doctoral students and postdocs to produce their best writing while maintaining their health and sanity. Professor Sarnecka is currently conducting randomized controlled trials to investigate how doctoral writing groups affect writing productivity, skill development and well-being in doctoral students across the sciences and humanities. Other research in her lab focuses on conceptual change and cognitive development from infancy through adulthood. This includes studies of numerical cognition in early childhood, social cognition in infancy through childhood, exploratory play and decision-making in middle childhood, conceptual change in science education, and adult moral cognition and reasoning."},"bookImage":"https://images-us.bookshop.org/ingram/9781733484602.jpg?height=500&v=v2"}},{"bookName":"The Writing Workshop: Write More, Write Better, Be Happier in...","bookAuthor":"Barbara W. Sarnecka","bookPrice":"$24.99","linkDetail":"https://bookshop.org/books/the-writing-workshop-write-more-write-better-be-happier-in-academia/9781733484602","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"June 21, 2022","Publisher":"HarperOne","Pages":"320","Dimensions":"6.0 X 9.1 X 1.3 inches | 1.05 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Steve Magness","about":"Steve Magness is a world-renowned expert on performance, coauthor of Peak Performance and The Passion Paradox, and the author of The Science of Running. He is the co-host of two podcasts: The Growth Equation podcast, with Brad Stulberg, and On Coaching with Magness and Marcus, with Jon Marcus. He has written for Runner's World and Sports Illustrated, and he has been featured in The New Yorker, Wall Street Journal, the New York Times, Men's Health, The Guardian, Business Insider, and ESPN The Magazine, and he has been featured on NPR and CNN International. Magness has served as a consultant and speaker for NASA, the Houston Rockets, Murphy Oil, the Brooklyn Nets, the Cleveland Guardians, the Seattle Sounders, the New Orleans Pelicans, Athletics New Zealand, Canadian Athletics, New Zealand High Performance, and more. He lives in Houston, Texas."},"bookImage":"https://images-us.bookshop.org/ingram/9780063098619.jpg?height=500&v=v2"}},{"bookName":"The Four Agreements: A Practical Guide to Personal Freedom","bookAuthor":"Don Miguel Ruiz and Janet Mills","bookPrice":"$12.95 $12.04","linkDetail":"https://bookshop.org/books/the-four-agreements-a-practical-guide-to-personal-freedom/9781878424310","bookDetail":{"bookDetail":{"price":"$21.34","sale":"$22.95","PublishDate":"April 19, 2022","Publisher":"Chronicle Books","Pages":"128","Dimensions":"7.84 X 9.23 X 0.63 inches | 1.09 pounds","Languages":"English","Type":"Hardcover","description":["- Parents (or aunts, uncles, grandparents) who have bought Sophie Blackall's books for their children and fallen in love with her artwork","- Shoppers looking for the perfect grad gift or baby shower gift","- People looking for a way to express sympathy with someone who is struggling or grieving\n      "]},"Author":{"name":"Sophie Blackall","about":"Sophie Blackall is an Australian illustrator based in New York. Blackall has illustrated more than forty children's books, including Finding Winnie, for which she won the 2016 Randolph Caldecott Medal, and Hello Lighthouse, which won the Caldecott Medal in 2019. She is the illustrator of the long-running Ivy & Bean series of early reader chapter books, and the author of the picture book If You Come to Earth, also from Chronicle Books."},"bookImage":"https://images-us.bookshop.org/ingram/9781797214481.jpg?height=500&v=v2-e1a5789b4719485450448eddf2152b59"}},{"bookName":"Adult Children of Emotionally Immature Parents: How to Heal...","bookAuthor":"Lindsay C. Gibson","bookPrice":"$18.95 $17.62","linkDetail":"https://bookshop.org/books/adult-children-of-emotionally-immature-parents-how-to-heal-from-distant-rejecting-or-self-involved-parents-9781626251700/9781626251700","bookDetail":{"bookDetail":{"price":"$17.62","sale":"$18.95","PublishDate":"June 01, 2015","Publisher":"New Harbinger Publications","Pages":"216","Dimensions":"6.0 X 8.9 X 0.6 inches | 0.65 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Lindsay C. Gibson","about":"Lindsay C. Gibson, PsyD, is a clinical psychologist in private practice who specializes in individual psychotherapy with adult children of emotionally immature parents. She is author of Who You Were Meant to Be and writes a monthly column on well-being for Tidewater Women magazine. In the past she has served as an adjunct assistant professor of graduate psychology for the College of William and Mary, as well as for Old Dominion University. Gibson lives and practices in Virginia Beach, Virginia."},"bookImage":"https://images-us.bookshop.org/ingram/9781626251700.jpg?height=500&v=v2-c5aa83a96f4380b7a466ed88d2804fc4"}},{"bookName":"Ace: What Asexuality Reveals about Desire, Society, and the...","bookAuthor":"Angela Chen","bookPrice":"$26.95 $25.06","linkDetail":"https://bookshop.org/books/ace-what-asexuality-reveals-about-desire-society-and-the-meaning-of-sex-9781662036811/9780807013793","bookDetail":{"bookDetail":{"price":"$12.04","sale":"$12.95","PublishDate":"November 07, 1997","Publisher":"Amber-Allen Publishing","Pages":"160","Dimensions":"5.1 X 7.2 X 0.6 inches | 0.38 pounds","Languages":"English","Type":"Paperback","description":[" - Translated into 46 languages worldwide "]},"Author":{"name":"Janet Mills Don Miguel Ruiz","about":"Don Miguel Ruiz is the bestselling author of The Four Agreements (a New York Times bestseller for over a decade), The Four Agreements Companion Book, The Mastery of Love, The Voice of Knowledge, The Circle of Fire, and The Fifth Agreement. The teachings of Ruiz are best known for transforming complex human issues into simple common sense -- a talent that has earned him millions of fans and international acclaim. Janet Mills is the founder and president of Amber-Allen Publishing and co-author, with don Miguel Ruiz, of six books in The Toltec Wisdom Series. Mills is also the creator of \"The Four Agreements for a Better Life\" online course, editor of Deepak Chopra's bestselling title, The Seven Spiritual Laws of Success, and publisher of the world-renowned \"Seth Books\" by Jane Roberts."},"bookImage":"https://images-us.bookshop.org/ingram/9781878424310.jpg?height=500&v=v2-d1ed76c4172cc827b330dca7ef8fa9b7"}},{"bookName":"Things to Look Forward to","bookAuthor":"Sophie Blackall","bookPrice":"$22.95 $21.34","linkDetail":"https://bookshop.org/books/things-to-look-forward-to/9781797214481","bookDetail":{"bookDetail":{"price":"$25.06","sale":"$26.95","PublishDate":"September 15, 2020","Publisher":"Beacon Press","Pages":"224","Dimensions":"6.3 X 9.1 X 1.0 inches | 1.0 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Angela Chen","about":"Angela Chen is a journalist and writer in New York City. Her reporting and criticism have appeared in the Wall Street Journal, Atlantic, Guardian, Paris Review, Electric Literature, Catapult, and elsewhere. Chen is a member of the ace community and has spoken about asexuality at academic conferences and events including World Pride. Find her on Twitter @chengela or at angelachen.org."},"bookImage":"https://images-us.bookshop.org/ingram/9780807013793.jpg?height=500&v=v2"}},{"bookName":"Care Work: Dreaming Disability Justice","bookAuthor":"Leah Lakshmi Piepzna-Samarasinha","bookPrice":"$17.95 $16.69","linkDetail":"https://bookshop.org/books/care-work-dreaming-disability-justice-9798200307470/9781551527383","bookDetail":{"bookDetail":{"price":"$27.85","sale":"$29.95","PublishDate":"March 04, 2013","Publisher":"Jossey-Bass","Pages":"368","Dimensions":"7.0 X 9.1 X 0.8 inches | 1.38 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Elena Aguilar","about":"Elena Aguilar is an instructional and leadership coach in the Oakland Unified School District. Elena writes about education for Edutopia and for Education Week's Teacher Magazine, and is also a member of the Teacher Leaders Network."},"bookImage":"https://images-us.bookshop.org/ingram/9781118206539.jpg?height=500&v=v2"}},{"bookName":"The Art of Coaching: Effective Strategies for School...","bookAuthor":"Elena Aguilar","bookPrice":"$29.95 $27.85","linkDetail":"https://bookshop.org/books/the-art-of-coaching-effective-strategies-for-school-transformation-9798200581696/9781118206539","bookDetail":{"bookDetail":{"price":"$16.69","sale":"$17.95","PublishDate":"October 30, 2018","Publisher":"Arsenal Pulp Press","Pages":"304","Dimensions":"5.9 X 7.9 X 0.8 inches | 0.8 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Leah Lakshmi Piepzna-Samarasinha","about":"Leah Lakshmi Piepzna-Samarasinha is the Lambda Literary Award-winning author of the non-fiction books Dirty River: A Queer Femme of Color Dreaming Her Way Home and Consensual Genocide, and the poetry books Bodymap and Love Cake, and is the co-editor of The Revolution Starts at Home. A lead artist with disability justice performance collective Sins Invalid and co-founder of queer and trans people of color performance troupe Mangos With Chili, she performs and teaches across North America."},"bookImage":"https://images-us.bookshop.org/ingram/9781551527383.jpg?height=500&v=v2"}},{"bookName":"How to Be Perfect: The Correct Answer to Every Moral Question","bookAuthor":"Michael Schur","bookPrice":"$28.99 $26.96","linkDetail":"https://bookshop.org/books/how-to-be-perfect-the-correct-answer-to-every-moral-question-9781982159313/9781982159313","bookDetail":{"bookDetail":{"price":"$26.96","sale":"$28.99","PublishDate":"January 25, 2022","Publisher":"Simon & Schuster","Pages":"304","Dimensions":"6.32 X 9.21 X 1.1 inches | 0.98 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Michael Schur","about":"Michael Schur is a television writer and producer who has worked on shows like The Office, Master of None, The Comeback, and Hacks, and created or cocreated Parks and Recreation, Brooklyn 99, The Good Place, and Rutherford Falls. He lives in Los Angeles with his wife Jennifer, and their two kids, William and Ivy."},"bookImage":"https://images-us.bookshop.org/ingram/9781982159313.jpg?height=500&v=v2-01621df7ab2ea9400403dc3f56fb15f7"}},{"bookName":"Cultish: The Language of Fanaticism","bookAuthor":"Amanda Montell","bookPrice":"$27.99 $26.03","linkDetail":"https://bookshop.org/books/cultish-the-language-of-fanaticism-9781665097260/9780062993151","bookDetail":{"bookDetail":{"price":"$26.03","sale":"$27.99","PublishDate":"June 15, 2021","Publisher":"Harper Wave","Pages":"320","Dimensions":"5.6 X 8.3 X 1.3 inches | 0.85 pounds","Languages":"English","Type":"Hardcover","description":["What makes \"cults\" so intriguing and frightening? What makes them powerful? The reason why so many of us binge Manson documentaries by the dozen and fall down rabbit holes researching suburban moms gone QAnon is because we're looking for a satisfying explanation for what causes people to join--and more importantly, stay in--extreme groups. We secretly want to know: could it happen to me? Amanda Montell's argument is that, on some level, it already has . . ."]},"Author":{"name":"Amanda Montell","about":"Amanda Montell is a writer and reporter from Baltimore with bylines in Marie Claire, Cosmopolitan, Woman's Day, The Rumpus, Byrdie.com, and WhoWhatWear, where she is the staff features editor. As a pop linguist, Amanda's insights have been featured in Glamour, Bustle, Refinery29, Hello Giggles, and Bust Magazine. Amanda graduated from NYU with a degree in linguistics. She lives in Los Angeles. Find her on Instagram @amanda montell."},"bookImage":"https://images-us.bookshop.org/ingram/9780062993151.jpg?height=500&v=v2"}},{"bookName":"Journal of Radical Permission: A Daily Guide for Following...","bookAuthor":"Sonya Renee Taylor and Adrienne Maree Brown","bookPrice":"$16.95 $15.76","linkDetail":"https://bookshop.org/books/journal-of-radical-permission-a-daily-guide-for-following-your-soul-s-calling/9781523002429","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"April 21, 2020","Publisher":"Penguin Books","Pages":"352","Dimensions":"5.4 X 8.3 X 0.8 inches | 0.62 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Emily Oster","about":"Emily Oster is a professor of economics at Brown University and the author of Expecting Better, Cribsheet, and The Family Firm. She writes the newsletter ParentData and her work has been featured in The New York Times, The Wall Street Journal, The Washington Post, The Atlantic, and Bloomberg. She has two children."},"bookImage":"https://images-us.bookshop.org/ingram/9780525559276.jpg?height=500&v=v2"}},{"bookName":"How to Tell a Story: The Essential Guide to Memorable...","bookAuthor":"The Moth, Catherine Burns, et al.","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/how-to-tell-a-story-the-essential-guide-to-memorable-storytelling-from-the-moth/9780593139004","bookDetail":{"bookDetail":{"price":"$20.46","sale":"$22.00","PublishDate":"December 01, 2014","Publisher":"Many Rivers Press","Pages":"","Dimensions":"5.2 X 0.8 X 7.5 inches | 0.7 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"David Whyte","about":"David Whyte is professor of Socio-legal Studies at the University of Liverpool, where he teaches sociology and criminology and researches the relationship between law and institutional power. His most recent books are Neoliberalism and the Moral Economy of Fraud (ed. with Jörg Wiegratz, 2016), Corporate Human Rights Violations (with Stefanie Khoury, 2017), and The Violence of Austerity (ed. with Vickie Cooper, 2017)."},"bookImage":"https://images-us.bookshop.org/ingram/9781932887341.jpg?height=500&v=v2"}},{"bookName":"Consolations: The Solace, Nourishment and Underlying Meaning...","bookAuthor":"David Whyte","bookPrice":"$22.00 $20.46","linkDetail":"https://bookshop.org/books/consolations-the-solace-nourishment-and-underlying-meaning-of-everyday-words/9781932887341","bookDetail":{"bookDetail":{"price":"$15.76","sale":"$16.95","PublishDate":"August 02, 2022","Publisher":"Berrett-Koehler Publishers","Pages":"128","Dimensions":"","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Sonya Renee Taylor Adrienne Maree Brown","about":"adrienne maree brown is the writer-in-residence at the Emergent Strategy Ideation Institute. She is the author of eight books, including Emergent Strategy: Shaping Change, Changing Worlds and Pleasure Activism: The Politics of Feeling Good. She is cohost of the How to Survive the End of the World, Octavia's Parables, and The Emergent Strategy podcasts. Sonya Renee Taylor is the founder and radical executive officer of the Body Is Not an Apology, a digital media and education company. Her work as an activist and educator and her commitment to radical self-love and transformation have reached millions of people. Taylor also is the author of the bestselling The Body Is Not an Apology."},"bookImage":"https://images-us.bookshop.org/ingram/9781523002429.jpg?height=500&v=v2-14722a8e46b76f40753b6411ad68458f"}},{"bookName":"Cribsheet: A Data-Driven Guide to Better, More Relaxed...","bookAuthor":"Emily Oster","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/cribsheet-a-data-driven-guide-to-better-more-relaxed-parenting-from-birth-to-preschool-9780525559276/9780525559276","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"April 26, 2022","Publisher":"Crown Publishing Group (NY)","Pages":"336","Dimensions":"5.6 X 8.2 X 1.3 inches | 1.0 pounds","Languages":"English","Type":"Hardcover","description":["-","-","- "]},"Author":{"name":"The Moth Meg Bowles Catherine Burns Sarah Austin Jenness Padma Lakshmi","about":"The Moth is an acclaimed nonprofit organization dedicated to the art and craft of storytelling. Since its launch in 1997, The Moth has presented more than fifty thousand stories and received the MacArthur Award for Creative and Effective Institutions and a Peabody Award for The Moth Radio Hour, which airs on more than 570 stations nationwide. The Moth podcast is downloaded more than ninety million times annually. Meg Bowles, Catherine Burns, Jenifer Hixson, Sarah Austin Jenness, and Kate Tellers, along with The Moth's artistic and workshop teams, have spent more than two decades helping people all around the world tell their true personal stories."},"bookImage":"https://images-us.bookshop.org/ingram/9780593139004.jpg?height=500&v=v2-84960f58b000a2efe83e1ba9a3bed80f"}},{"bookName":"Island Wisdom: Hawaiian Traditions and Practices for a...","bookAuthor":"Kainoa Daines and Annie Daly","bookPrice":"$19.95 $18.55","linkDetail":"https://bookshop.org/books/island-wisdom-hawaiian-traditions-and-practices-for-a-meaningful-life/9781797216935","bookDetail":{"bookDetail":{"price":"$14.88","sale":"$16.00","PublishDate":"December 01, 2020","Publisher":"Graywolf Press","Pages":"272","Dimensions":"5.4 X 8.2 X 0.8 inches | 0.74 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Carmen Maria Machado","about":"Carmen Maria Machado is the author of Her Body and Other Parties, which was a finalist for the National Book Award and winner of the National Book Critics Circle's John Leonard Prize. She lives in Philadelphia with her wife."},"bookImage":"https://images-us.bookshop.org/ingram/9781644450383.jpg?height=500&v=v2"}},{"bookName":"Nasty, Brutish, and Short: Adventures in Philosophy with My Kids","bookAuthor":"Scott Hershovitz","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/nasty-brutish-and-short-adventures-in-philosophy-with-my-kids/9781984881816","bookDetail":{"bookDetail":{"price":"$18.55","sale":"$19.95","PublishDate":"October 25, 2022","Publisher":"Chronicle Prism","Pages":"144","Dimensions":"","Languages":"English","Type":"Hardcover","description":["More than just a beautiful paradise, Hawai'i has a rich culture, deeply rooted in tradition. Native Hawaiian and cultural expert Kainoa Daines has spent many years teaching visitors to the islands about this time-honored wisdom, and now he has teamed up with journalist Annie Daly to share that knowledge with you. ","- Travelers who have visited or are thinking of visiting Hawai'i ","- Readers curious to learn about Hawaiian culture and language ","- Anyone seeking a more thoughtful and balanced life\n      "]},"Author":{"name":"Kainoa Daines Annie Daly","about":"Annie Daly is a New York City-based journalist and the author of Destination Wellness, an exploration of different healthy living philosophies around the world. She's written for many wellness and travel publications, including Self, Afar, Condé Nast Traveler, Travel + Leisure, and more. She grew up visiting Hawai'i with her family, and considers herself a forever student of the islands. Kainoa Daines is the Senior Director of Culture and Product Development for the Hawaii Visitors & Convention Bureau. He is a proud member of the Royal Order of Kamehameha I and the Hawaiian Civic Club of Honolulu. He is a resident of Honolulu, with roots on all the major Hawaiian Islands."},"bookImage":"https://images-us.bookshop.org/ingram/9781797216935.jpg?height=500&v=v2-deef9942a8bc19aa7319ab439540522e"}},{"bookName":"Five Practices for Equity-Focused School Leadership","bookAuthor":"Gretchen Givens Generett, Mark Anthony Gooden, et al.","bookPrice":"$33.95 $31.57","linkDetail":"https://bookshop.org/books/five-practices-for-equity-focused-school-leadership/9781416629757","bookDetail":{"bookDetail":{"price":"$31.57","sale":"$33.95","PublishDate":"February 08, 2021","Publisher":"ASCD","Pages":"246","Dimensions":"8.0 X 10.0 X 0.55 inches | 1.17 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Gretchen Givens Generett Mark Anthony Gooden Sharon I. Radd","about":"Gretchen Givens Generett, PhD, is Interim Dean and Professor of Foundations in the School of Education at Duquesne University. She holds the Noble J. Dick Endowed Chair in Community Outreach at Duquesne, where she has served as the Director for the University Council Educational Administration Center for Educational Leadership and Social Justice and the Associate Dean for Graduate Studies and Research. She is a qualitative researcher whose scholarship intermingles traditional sociology of education, African American studies, and feminist studies with more progressive concepts of justice that examine agency, empowerment, and action. Her most recent scholarship is a book entitled The American Dream for Students of Color: Barriers to Educational Success, coauthored with Dr. Amy M. Olson. Generett received her BA in English from Spelman College and her PhD in Foundations of Education from the University of North Carolina at Chapel Hill.Mark Anthony Gooden, PhD, is the Christian Johnson Endeavor Professor in Education Leadership and Director of the Endeavor Antiracist & Restorative Leadership Initiative at Teachers College, Columbia University. He is the former Director of the Summer Principals Academy-NYC in the Department of Organization and Leadership at Teachers College. His research focuses broadly on culturally responsive school leadership with specific interests in antiracist leadership, the principalship, urban educational leadership, and legal issues in education. Before entering higher education, he served as a secondary mathematics teacher and departmental chairperson in Columbus (OH) Public Schools. He has spent two decades in higher education. Gooden earned his BA in mathematics from Albany State University (a historically Black college/university). He holds an MEd in mathematics education, and an MA and a PhD in policy and leadership, all from The Ohio State University.Sharon I. Radd, EdD, is Program Director and Associate Professor of Organizational Leadership at St. Catherine University, Principal at Sankalpa Consulting, and an Equity Fellow for the Midwest and Plains Equity Assistance Center at IUPUI. Prior to entering higher education, she spent 23 years in K-12 public education as a school social worker, building-level administrator, district administrator, and professional development provider. Awarded a 2006 Archibald Bush Leadership Fellowship and winner of the 2010 Social Justice Dissertation Award given by the American Educational Research Association LSJ-SIG, she specializes in the areas of leadership, educational equity, adult learning, organizational change, team functioning, and cross-cultural proficiency. Radd holds bachelor's degrees in sociology and social work; a master's degree in educational leadership; and, from the University of St. Thomas, an EdD in leadership."},"bookImage":"https://images-us.bookshop.org/ingram/9781416629757.jpg?height=500&v=v2"}},{"bookName":"In the Dream House: A Memoir","bookAuthor":"Carmen Maria Machado","bookPrice":"$16.00 $14.88","linkDetail":"https://bookshop.org/books/in-the-dream-house-a-memoir-9781665180313/9781644450383","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"May 03, 2022","Publisher":"Penguin Press","Pages":"384","Dimensions":"6.4 X 9.3 X 1.3 inches | 1.4 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Scott Hershovitz","about":"Scott Hershovitz is director of the Law and Ethics Program and professor of law and philosophy at the University of Michigan. He holds a BA in philosophy and politics from the University of Georgia, a JD from Yale Law School, and a D.Phil. from the University of Oxford, where he was a Rhodes Scholar. Professor Hershovitz served as a law clerk for Justice Ruth Bader Ginsburg of the U.S. Supreme Court. He is married to Julie Kaplan, a social worker, whom he met at summer camp. They live in Ann Arbor with their two children, Rex and Hank."},"bookImage":"https://images-us.bookshop.org/ingram/9781984881816.jpg?height=500&v=v2-9439282336494689df11c3383f343747"}},{"bookName":"The Book of Delights: Essays","bookAuthor":"Ross Gay","bookPrice":"$24.95 $23.20","linkDetail":"https://bookshop.org/books/the-book-of-delights-essays/9781616207922","bookDetail":{"bookDetail":{"price":"$23.20","sale":"$24.95","PublishDate":"February 12, 2019","Publisher":"Algonquin Books","Pages":"288","Dimensions":"5.2 X 7.2 X 1.2 inches | 0.64 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Ross Gay","about":"In addition to The Book of Delights: Essays, Ross Gay is the author of three books of poetry, including Catalog of Unabashed Gratitude, winner of the 2015 National Book Critics Circle Award and the 2016 Kingsley Tufts Poetry Award. Catalog was also a finalist for the 2015 National Book Award in Poetry, the Ohioana Book Award, the Balcones Poetry Prize, the Hurston/Wright Legacy Award, and was nominated for an NAACP Image Award. He is a founding editor, with Karissa Chen and Patrick Rosal, of the online sports magazine Some Call It Ballin' and founding board member of the Bloomington Community Orchard, a nonprofit, free-fruit-for-all food justice and joy project. Gay has received fellowships from the Cave Canem Foundation, the Bread Loaf Writers' Conference, and the Guggenheim Foundation. He teaches at Indiana University."},"bookImage":"https://images-us.bookshop.org/ingram/9781616207922.jpg?height=500&v=v2"}}]