[
  {
    "bookName": "The Last House on Needless Street",
    "bookAuthor": "Catriona Ward",
    "bookPrice": "$27.99 $26.03",
    "linkDetail": "https://bookshop.org/books/the-last-house-on-needless-street-9781432896126/9781250812629",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.03",
        "sale": "$27.99",
        "PublishDate": "September 28, 2021",
        "Publisher": "Tor Nightfire",
        "Pages": "352",
        "Dimensions": "6.57 X 9.46 X 1.18 inches | 1.21 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          "A man who drinks alone in front of his TV, trying to ignore the gaps in his memory.",
          "And a house cat who loves napping and reading the Bible. "
        ]
      },
      "Author": {
        "name": "Catriona Ward",
        "about": "CATRIONA WARD was born in Washington, DC and grew up in the United States, Kenya, Madagascar, Yemen, and Morocco. She studied English at Oxford and later the Creative Writing Masters at the University of East Anglia. She won the August Derleth Award for Best Horror Novel for her debut, The Girl from Rawblood, and again for Little Eve, making her the first woman to win the prize twice. Little Eve also won the Shirley Jackson Award for Best Novel, and will be published by Nightfire."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781250812629.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Hidden Pictures",
    "bookAuthor": "Jason Rekulak",
    "bookPrice": "$27.99 $26.03",
    "linkDetail": "https://bookshop.org/books/hidden-pictures-9798885780537/9781250819345",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.03",
        "sale": "$27.99",
        "PublishDate": "May 10, 2022",
        "Publisher": "Flatiron Books",
        "Pages": "384",
        "Dimensions": "6.52 X 9.53 X 1.36 inches | 1.59 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          " ",
          " From Jason Rekulak, Edgar-nominated author of "
        ]
      },
      "Author": {
        "name": "Jason Rekulak",
        "about": "Jason Rekulak is the author of The Impossible Fortress, which was translated into 12 languages and was nominated for the Edgar Award. For many years, he was the publisher of Quirk Books, an independent press, where he acquired and edited multiple New York Times bestsellers. He lives in Philadelphia with his family."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781250819345.jpg?height=500&v=v2-a6717a237407af153e28414c67b2cfc0"
    }
  },
  {
    "bookName": "Something Is Killing the Children Vol. 1",
    "bookAuthor": "James Tynion IV and Werther Dell'edera",
    "bookPrice": "$14.99 $13.94",
    "linkDetail": "https://bookshop.org/books/something-is-killing-the-children-vol-1-9781684155583/9781684155583",
    "bookDetail": {
      "bookDetail": {
        "price": "$13.94",
        "sale": "$14.99",
        "PublishDate": "May 26, 2020",
        "Publisher": "Boom! Studios",
        "Pages": "128",
        "Dimensions": "6.6 X 10.0 X 0.3 inches | 0.65 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "James Tynion IV Werther Dell'edera",
        "about": "James Tynion IV is a comic book writer, best known for his work on the Batman franchise for DC Comics. James' comics career began with co-writing the back-up stories on Scott Snyder and Greg Capullo's character defining run on BATMAN, which would lead to his making his own name on a number of Bat-Centric series. This work would culminate in James serving as the showrunner of two consecutive weekly comic series, BATMAN ETERNAL and BATMAN & ROBIN ETERNAL. Recently, he has become the writer of the massive cross-over project, BATMAN/TEENAGE MUTANT NINJA TURTLES, bringing two of the most successful franchises together for the first time. The first issue was one of the best selling comic issues of 2015. The Young Adult Science Fiction epic THE WOODS broke all records for original series at the company when it was released in 2014, and has recently been optioned for television by Universal Cable Productions. He has also penned the critical successes MEMETIC, COGNETIC and UFOLOGY for the publisher. James has also recently stepped into the shoes of one of the most iconic anti-heroes in the comics medium with the critically acclaimed relaunch of CONSTANTINE: THE HELLBLAZER with Ming Doyle and Riley Rossmo. An alumni of Sarah Lawrence College, Tynion now lives and works in Los Angeles, CA. Werther Dell'Edera (born January 1, 1975) is an Italian comic book artist who provided interior art for the unreleased comic Aliens: Colonial Marines - Rising Threat for Dark Horse Comics, as Well as Marvel Comics, and BOOM! Studios hit Something is Killing the Children."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781684155583.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "11/22/63",
    "bookAuthor": "Stephen King",
    "bookPrice": "$20.99 $19.52",
    "linkDetail": "https://bookshop.org/books/11-22-63/9781451627299",
    "bookDetail": {
      "bookDetail": {
        "price": "",
        "sale": "",
        "PublishDate": "",
        "Publisher": "",
        "Pages": "",
        "Dimensions": "",
        "Languages": "",
        "Type": "",
        "description": []
      },
      "Author": {
        "name": "",
        "about": ""
      }
    }
  },
  {
    "bookName": "Pet Sematary",
    "bookAuthor": "Stephen King",
    "bookPrice": "$28.00 $26.04",
    "linkDetail": "https://bookshop.org/books/pet-sematary-6be8cf72-8bb6-4f74-8d38-a9a402ad31ba/9781982112394",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.04",
        "sale": "$28.00",
        "PublishDate": "December 04, 2018",
        "Publisher": "Scribner Book Company",
        "Pages": "416",
        "Dimensions": "6.4 X 9.4 X 1.5 inches | 1.55 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Stephen King",
        "about": "Stephen King is the author of more than sixty books, all of them worldwide bestsellers. His recent work includes Fairy Tale, Billy Summers, If It Bleeds, The Institute, Elevation, The Outsider, Sleeping Beauties (cowritten with his son Owen King), and the Bill Hodges trilogy: End of Watch, Finders Keepers, and Mr. Mercedes (an Edgar Award winner for Best Novel and a television series streaming on Peacock). His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller. His epic works The Dark Tower, It, Pet Sematary, and Doctor Sleep are the basis for major motion pictures, with It now the highest-grossing horror film of all time. He is the recipient of the 2020 Audio Publishers Association Lifetime Achievement Award, the 2018 PEN America Literary Service Award, the 2014 National Medal of Arts, and the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781982112394.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Queen of Teeth",
    "bookAuthor": "Hailey Piper",
    "bookPrice": "$14.95 $13.90",
    "linkDetail": "https://bookshop.org/books/queen-of-teeth-9781946335418/9781946335418",
    "bookDetail": {
      "bookDetail": {
        "price": "$13.90",
        "sale": "$14.95",
        "PublishDate": "August 01, 2021",
        "Publisher": "Rooster Republic LLC",
        "Pages": "198",
        "Dimensions": "6.0 X 9.0 X 0.42 inches | 0.6 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "Hailey Piper",
        "about": "Hailey Piper is the author of The Worm and His Kings, The Possession of Natalie Glasgow, An Invitation to Darkness, and Benny Rose, the Cannibal King. She is a member of the Horror Writers Association, and her short stories appear in Daily Science Fiction, Flash Fiction Online, The Arcanist, Tales to Terrify, Monsters Out of the Closet, and Year's Best Hardcore Horror, Volume 5, among other publications. A trans woman from the haunted woods of New York, she now lives with her wife in Maryland, where together they cast hexes, raise the dead, and summon the elder gods, sometimes all in one night. Find Hailey on Twitter via @HaileyPiperSays or at www.haileypiper.com."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781946335418.jpg?height=500&v=v2-5f0675b95b2cbed69a27bfd6b62b595f"
    }
  },
  {
    "bookName": "The Library at Mount Char",
    "bookAuthor": "Scott Hawkins",
    "bookPrice": "$17.00 $15.81",
    "linkDetail": "https://bookshop.org/books/the-library-at-mount-char-9781622317721/9780553418620",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.81",
        "sale": "$17.00",
        "PublishDate": "March 15, 2016",
        "Publisher": "Crown Publishing Group (NY)",
        "Pages": "400",
        "Dimensions": "5.1 X 7.9 X 0.9 inches | 0.6 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "Carolyn's not so different from the other people around her. She likes guacamole and cigarettes and steak. She knows how to use a phone. Clothes are a bit tricky, but everyone says nice things about her outfit with the Christmas sweater over the gold bicycle shorts. "
        ]
      },
      "Author": {
        "name": "Scott Hawkins",
        "about": "SCOTT HAWKINS works as a software engineer for Intel. He and his wife live in Atlanta, where they spend much of their time playing Olympic-caliber fetch with their large pack of foster dogs. THE LIBRARY AT MOUNT CHAR is his first novel."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780553418620.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Twisted Ones",
    "bookAuthor": "T. Kingfisher",
    "bookPrice": "$16.98 $15.79",
    "linkDetail": "https://bookshop.org/books/the-twisted-ones-9781508297499/9781534429567",
    "bookDetail": {
      "bookDetail": {
        "price": "",
        "sale": "",
        "PublishDate": "",
        "Publisher": "",
        "Pages": "",
        "Dimensions": "",
        "Languages": "",
        "Type": "",
        "description": []
      },
      "Author": {
        "name": "",
        "about": ""
      }
    }
  },
  {
    "bookName": "The Elementals",
    "bookAuthor": "Michael McDowell",
    "bookPrice": "$20.39",
    "linkDetail": "https://bookshop.org/books/the-elementals-9781941147177/9781941147177",
    "bookDetail": {
      "bookDetail": {
        "price": "$20.39",
        "sale": "",
        "PublishDate": "June 17, 2014",
        "Publisher": "Valancourt Books",
        "Pages": "230",
        "Dimensions": "5.5 X 8.5 X 0.58 inches | 0.54 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Michael McDowell Michael Rowe",
        "about": "Michael McDowell, Ed.D. is the Superintendent of the Ross School District. Most recently, he served as the Associate Superintendent of Instructional and Personnel Services at the Tamalpais Union High School District. During his tenure, the Tamalpais Union High School District was recognized by the Marzano Research Laboratories as one of the top highly reliable organizations in the United States, and schools within the district received recognitions by the US News and World Report, and honored with California Distinguished Schools accolades.Prior to his role as a central office administrator, Dr. McDowell served as the Principal of North Tahoe High School, a California Distinguished School. Prior to administration, Dr. McDowell was a leadership and instructional coach for the New Tech Network supporting educators in designing, implementing, and enhancing innovative schools across the country. Before engaging in the nonprofit sector, Dr. McDowell created and implemented an environmental science and biology program at Napa New Technology High School, infusing 1:1 technology, innovative teaching and assessment, and leveraging student voice in the classroom. Additionally, Dr. McDowell, taught middle school math and science in Pacifica, CA.Dr. McDowell is a national presenter, speaking on instruction, learning, leadership and innovation. He has provided professional development services to large school districts, State Departments of Education, and higher education. In addition, he was a former National Faculty member for the Buck Institute of Education and a key thought leader in the inception of their leadership work in scaling innovation in instructional methodologies. His expertise in design and implementation is complimented by his scholarly approach to leadership, learning, and instruction. He holds a B.S. in Environmental Science and a M.A. in Curriculum and Instruction from the University of Redlands and an Ed.D. from the University of La Verne. He received departmental honors for his work in Environmental Science and was awarded the Tom Fine Creative Leadership Award for his doctoral work at the University of La Verne. He has also completed certification programs through Harvard University, the California Association of School Business Officials, the American Association of School Personnel Administrators, and Cognition Education. He holds both a California single subject teaching credential and an administrative credential.Dr Michael Rowe is a Lecturer at the School of Modern History, Queen's University, Belfast."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781941147177.jpg?height=500&v=v2-53f164ec4d800e2ed288d3d26ae23685"
    }
  },
  {
    "bookName": "Negative Space",
    "bookAuthor": "B. R. Yeager",
    "bookPrice": "$14.99",
    "linkDetail": "https://bookshop.org/books/negative-space-9781733569453/9781733569453",
    "bookDetail": {
      "bookDetail": {
        "price": "",
        "sale": "",
        "PublishDate": "",
        "Publisher": "",
        "Pages": "",
        "Dimensions": "",
        "Languages": "",
        "Type": "",
        "description": []
      },
      "Author": {
        "name": "",
        "about": ""
      }
    }
  },
  {
    "bookName": "Mary: An Awakening of Terror",
    "bookAuthor": "Nat Cassidy",
    "bookPrice": "$21.99 $20.45",
    "linkDetail": "https://bookshop.org/books/mary-an-awakening-of-terror/9781250265234",
    "bookDetail": {
      "bookDetail": {
        "price": "$20.45",
        "sale": "$21.99",
        "PublishDate": "July 19, 2022",
        "Publisher": "Tor Nightfire",
        "Pages": "416",
        "Dimensions": "",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "Nat Cassidy",
        "about": "NAT CASSIDY writes horror for the page, stage, and screen. His critically-acclaimed, award-winning horror plays have been produced across the United States, as well as Off- and Off-Off-Broadway. He won the New York Innovative Theatre Award for Outstanding Solo Performance for his one-man show about H. P. Lovecraft and was commissioned by the Kennedy Center to write the libretto for a short opera (about the end of the world, of course). An established actor on stage and television (usually playing monsters and villains on shows such as Blue Bloods, Bull, Quantico, FBI, and Law & Order: SVU), Nat also authored the novelization of the hit podcast Steal the Stars, which was published by Tor Books and named one of the best books of 2017 by NPR. Mary: An Awakening of Terror is Nat's Nightfire debut. He lives in New York with his wife."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781250265234.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Things Have Gotten Worse Since We Last Spoke and Other...",
    "bookAuthor": "Eric Larocca",
    "bookPrice": "$19.95 $18.55",
    "linkDetail": "https://bookshop.org/books/things-have-gotten-worse-since-we-last-spoke-and-other-misfortunes/9781803361499",
    "bookDetail": {
      "bookDetail": {
        "price": "$18.55",
        "sale": "$19.95",
        "PublishDate": "September 06, 2022",
        "Publisher": "Titan Books (UK)",
        "Pages": "288",
        "Dimensions": "",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          "\n      "
        ]
      },
      "Author": {
        "name": "Eric Larocca",
        "about": "Eric LaRocca (he/they) is the author of several works of horror and dark fiction including the viral sensation Things Have Gotten Worse Since We Last Spoke. A lover of luxury fashion and an admirer of European musical theatre, Eric can often be found roaming the streets of his home city, Boston, MA, for inspiration. For more information, please follow @hystericteeth on Twitter/Instagram or visit ericlarocca.com."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781803361499.jpg?height=500&v=v2-437316239626b6ce91ecae1ca24b14d9"
    }
  },
  {
    "bookName": "The Beautiful Thing That Awaits Us All",
    "bookAuthor": "Laird Barron",
    "bookPrice": "$15.99 $14.87",
    "linkDetail": "https://bookshop.org/books/the-beautiful-thing-that-awaits-us-all/9781597805537",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.87",
        "sale": "$15.99",
        "PublishDate": "July 01, 2014",
        "Publisher": "Night Shade Books",
        "Pages": "304",
        "Dimensions": "5.9 X 8.9 X 0.9 inches | 0.88 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Laird Barron Norman Partridge",
        "about": "Laird Barron is the author of the novel The Croning and three collections of short fiction: The Imago Sequence, Occultation, and The Beautiful Thing That Awaits Us All. His work has appeared in many magazines and anthologies. An expatriate Alaskan, Barron currently resides in the wilds of upstate New York."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781597805537.jpg?height=500&v=v2-c4dbf439679baff7bc1d9785f58f4d80"
    }
  },
  {
    "bookName": "Anoka: A Collection of Indigenous Horror",
    "bookAuthor": "Shane Hawk",
    "bookPrice": "$9.99 $9.29",
    "linkDetail": "https://bookshop.org/books/anoka-a-collection-of-indigenous-horror/9798985411102",
    "bookDetail": {
      "bookDetail": {
        "price": "$9.29",
        "sale": "$9.99",
        "PublishDate": "October 26, 2020",
        "Publisher": "Black Hills Press",
        "Pages": "132",
        "Dimensions": "5.0 X 8.0 X 0.33 inches | 0.28 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Shane Hawk",
        "about": ""
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9798985411102.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Police Lucifer",
    "bookAuthor": "William Watson",
    "bookPrice": "$8.00 $7.44",
    "linkDetail": "https://bookshop.org/books/police-lucifer/9780578285528",
    "bookDetail": {
      "bookDetail": {
        "price": "$7.44",
        "sale": "$8.00",
        "PublishDate": "May 17, 2022",
        "Publisher": "Cloak",
        "Pages": "44",
        "Dimensions": "4.25 X 7.0 X 0.11 inches | 0.0 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "William Watson",
        "about": "Retired attorney William Watson was commissioned in the Army upon graduation from Princeton University in 1965 and went on active duty after graduating from Harvard Law School in 1968. He lives in Denver, Colorado."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780578285528.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Shiver: Junji Ito Selected Stories",
    "bookAuthor": "Junji Ito",
    "bookPrice": "$22.99 $21.38",
    "linkDetail": "https://bookshop.org/books/shiver-junji-ito-selected-stories/9781421596938",
    "bookDetail": {
      "bookDetail": {
        "price": "",
        "sale": "",
        "PublishDate": "",
        "Publisher": "",
        "Pages": "",
        "Dimensions": "",
        "Languages": "",
        "Type": "",
        "description": []
      },
      "Author": {
        "name": "",
        "about": ""
      }
    }
  },
  {
    "bookName": "Gwendy's Final Task",
    "bookAuthor": "Richard Chizmar and Stephen King",
    "bookPrice": "$28.00 $26.04",
    "linkDetail": "https://bookshop.org/books/gwendy-s-final-task/9781587678011",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.04",
        "sale": "$28.00",
        "PublishDate": "February 15, 2022",
        "Publisher": "Cemetery Dance Publications",
        "Pages": "412",
        "Dimensions": "5.9 X 9.0 X 1.4 inches | 1.16 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": {}
      },
      "Author": {
        "name": "Stephen King Richard Chizmar",
        "about": "Stephen King is the author of more than sixty books, all of them worldwide bestsellers. His recent work includes Fairy Tale, Billy Summers, If It Bleeds, The Institute, Elevation, The Outsider, Sleeping Beauties (cowritten with his son Owen King), and the Bill Hodges trilogy: End of Watch, Finders Keepers, and Mr. Mercedes (an Edgar Award winner for Best Novel and a television series streaming on Peacock). His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller. His epic works The Dark Tower, It, Pet Sematary, and Doctor Sleep are the basis for major motion pictures, with It now the highest-grossing horror film of all time. He is the recipient of the 2020 Audio Publishers Association Lifetime Achievement Award, the 2018 PEN America Literary Service Award, the 2014 National Medal of Arts, and the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King. Richard Chizmar is the coauthor (with Stephen King) of the New York Times bestselling novella, Gwendy's Button Box and Gwendy's Final Task. Recent books include The Girl on the Porch; The Long Way Home, his fourth short story collection; and Widow's Point, a chilling tale about a haunted lighthouse written with his son, Billy Chizmar, which was recently made into a feature film. His short fiction has appeared in dozens of publications, including Ellery Queen's Mystery Magazine and The Year's 25 Finest Crime and Mystery Stories. He has won two World Fantasy awards, four International Horror Guild awards, and the HWA's Board of Trustee's award. Chizmar's work has been translated into more than fifteen languages throughout the world, and he has appeared at numerous conferences as a writing instructor, guest speaker, panelist, and guest of honor. He is the author of Chasing the Boogeyman. Follow him on Twitter @RichardChizmar or visit his website at: RichardChizmar.com."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781587678011.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Remina",
    "bookAuthor": "Junji Ito",
    "bookPrice": "$22.99 $21.38",
    "linkDetail": "https://bookshop.org/books/remina/9781974717477",
    "bookDetail": {
      "bookDetail": {
        "price": "$21.38",
        "sale": "$22.99",
        "PublishDate": "December 15, 2020",
        "Publisher": "Viz Media",
        "Pages": "256",
        "Dimensions": "5.9 X 8.3 X 0.9 inches | 1.1 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Junji Ito",
        "about": "Junji Ito made his professional manga debut in 1987 and since then has gone on to be recognized as one of the greatest contemporary artists working in the horror genre. His titles include Tomie and Uzumaki, which have been adapted into live-action films; Gyo, which was adapted into an animated film; and his short story collections Fragments of Horror, Shiver and Frankenstein, all of which are available from VIZ Media. Ito's influences include classic horror manga artists Kazuo Umezz and Hideshi Hino, as well as authors Yasutaka Tsutsui and H.P. Lovecraft."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781974717477.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Fisherman",
    "bookAuthor": "John Langan",
    "bookPrice": "$16.99",
    "linkDetail": "https://bookshop.org/books/the-fisherman-9781939905215/9781939905215",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.99",
        "sale": "",
        "PublishDate": "June 30, 2016",
        "Publisher": "Word Horde",
        "Pages": "282",
        "Dimensions": "6.0 X 0.64 X 9.0 inches | 0.92 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "John Langan",
        "about": "John Langan has taught reading and writing at Atlantic Cape Community College for more than 25 years. The author of a popular series of college textbooks on both writing and reading, John enjoys the challenge of developing instructive materials that are clear and lively. Before teaching, he earned advanced degrees in writing at Rutgers University and in reading at Rowan University. He also spent a year writing fiction that \"is now at the back of a drawer waiting to be discovered and acclaimed posthumously.\" While in school, he supported himself by working as a truck driver, a machinist, a battery assembler, a hospital attendant, and an apple packer. In addition to his wife and Philly sports teams, his passions include reading and conveying to nonreaders the pleasure and power of books. Through Townsend Press, his educational publishing company, he has developed the nonprofit \"Townsend Library\"--a collection of more than 100 new and classic stories that appeal to readers of any age."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781939905215.jpg?height=500&v=v2-8b4d0cca9cadd0ec3bd0f798ea3bfb2e"
    }
  },
  {
    "bookName": "Death in Her Hands",
    "bookAuthor": "Ottessa Moshfegh",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/death-in-her-hands/9781984879370",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "June 22, 2021",
        "Publisher": "Penguin Books",
        "Pages": "272",
        "Dimensions": "5.0 X 7.6 X 0.8 inches | 0.4 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Ottessa Moshfegh",
        "about": "Ottessa Moshfegh is a fiction writer from New England. Eileen, her first novel, was shortlisted for the National Book Critics Circle Award and the Man Booker Prize, and won the PEN/Hemingway Award for debut fiction. My Year of Rest and Relaxation and Death in Her Hands, her second and third novels, were New York Times bestsellers. She is also the author of the short story collection Homesick for Another World and a novella, McGlue. She lives in Southern California."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781984879370.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "If It Bleeds",
    "bookAuthor": "Stephen King",
    "bookPrice": "$18.00 $16.74",
    "linkDetail": "https://bookshop.org/books/if-it-bleeds-9781982137977/9781982137984",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.74",
        "sale": "$18.00",
        "PublishDate": "June 01, 2021",
        "Publisher": "Scribner Book Company",
        "Pages": "448",
        "Dimensions": "5.4 X 8.1 X 1.1 inches | 0.86 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Stephen King",
        "about": "Stephen King is the author of more than sixty books, all of them worldwide bestsellers. His recent work includes Fairy Tale, Billy Summers, If It Bleeds, The Institute, Elevation, The Outsider, Sleeping Beauties (cowritten with his son Owen King), and the Bill Hodges trilogy: End of Watch, Finders Keepers, and Mr. Mercedes (an Edgar Award winner for Best Novel and a television series streaming on Peacock). His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller. His epic works The Dark Tower, It, Pet Sematary, and Doctor Sleep are the basis for major motion pictures, with It now the highest-grossing horror film of all time. He is the recipient of the 2020 Audio Publishers Association Lifetime Achievement Award, the 2018 PEN America Literary Service Award, the 2014 National Medal of Arts, and the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781982137984.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Interview with the Vampire",
    "bookAuthor": "Anne Rice",
    "bookPrice": "$8.99 $8.36",
    "linkDetail": "https://bookshop.org/books/interview-with-the-vampire-9780345337665/9780345337665",
    "bookDetail": {
      "bookDetail": {
        "price": "$8.36",
        "sale": "$8.99",
        "PublishDate": "September 13, 1991",
        "Publisher": "Ballantine Books",
        "Pages": "352",
        "Dimensions": "4.2 X 1.2 X 6.8 inches | 0.4 pounds",
        "Languages": "English",
        "Type": "Mass Market Paperbound",
        "description": {}
      },
      "Author": {
        "name": "Anne Rice",
        "about": "Anne Rice is the author of thirty-seven books, including the Vampire Chronicles, the Lives of the Mayfair Witches, and the Wolf Gift book series. Rice was born in New Orleans in 1941 and grew up there and in Texas. She lived in San Francisco with her husband, the poet and painter, Stan Rice until 1988, when they returned to New Orleans to live with their son, Christopher. In 2006, Rice moved to Rancho Mirage, California. She died in 2021."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780345337665.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Dark Tower I: The Gunslinger Volume 1",
    "bookAuthor": "Stephen King",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/the-dark-tower-i-the-gunslinger-volume-1/9781501143519",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "May 03, 2016",
        "Publisher": "Scribner Book Company",
        "Pages": "288",
        "Dimensions": "5.5 X 8.3 X 0.8 inches | 0.57 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Stephen King",
        "about": "Stephen King is the author of more than sixty books, all of them worldwide bestsellers. His recent work includes Fairy Tale, Billy Summers, If It Bleeds, The Institute, Elevation, The Outsider, Sleeping Beauties (cowritten with his son Owen King), and the Bill Hodges trilogy: End of Watch, Finders Keepers, and Mr. Mercedes (an Edgar Award winner for Best Novel and a television series streaming on Peacock). His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller. His epic works The Dark Tower, It, Pet Sematary, and Doctor Sleep are the basis for major motion pictures, with It now the highest-grossing horror film of all time. He is the recipient of the 2020 Audio Publishers Association Lifetime Achievement Award, the 2018 PEN America Literary Service Award, the 2014 National Medal of Arts, and the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781501143519.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Death of Jane Lawrence",
    "bookAuthor": "Caitlin Starling",
    "bookPrice": "$27.99 $26.03",
    "linkDetail": "https://bookshop.org/books/the-death-of-jane-lawrence/9781250272584",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.03",
        "sale": "$27.99",
        "PublishDate": "October 05, 2021",
        "Publisher": "St. Martin's Press",
        "Pages": "368",
        "Dimensions": "6.2 X 9.4 X 1.3 inches | 1.25 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": {}
      },
      "Author": {
        "name": "Caitlin Starling",
        "about": "Caitlin Starling writes horror-tinged speculative fiction of all flavors. Her first novel, The Luminous Dead, won the LOHF Best Debut Award and was nominated for both the Bram Stoker and Locus Awards. She is also the author of the gothic horror tales Yellow Jessamine and The Death of Jane Lawrence, as well as a novella in the Vampire: The Masquerade audio collection, Walk Among Us. Her nonfiction has appeared in Nightmare and Uncanny. Starling also works in narrative design, and has been paid to invent body parts. She's always on the lookout for new ways to inflict insomnia."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781250272584.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Hellbound Heart",
    "bookAuthor": "Clive Barker",
    "bookPrice": "$14.99 $13.94",
    "linkDetail": "https://bookshop.org/books/the-hellbound-heart/9780061452888",
    "bookDetail": {
      "bookDetail": {
        "price": "$13.94",
        "sale": "$14.99",
        "PublishDate": "October 02, 2007",
        "Publisher": "Harper Perennial",
        "Pages": "176",
        "Dimensions": "5.4 X 7.98 X 0.46 inches | 0.35 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Clive Barker",
        "about": "Clive Barker is the bestselling author of twenty-two books, including the New York Times bestsellers Abarat; Abarat: Days of Magic, Nights of War; and The Thief of Always. He is also an acclaimed painter, film producer, and director. For twelve years Mr. Barker has been working on a vast array of paintings to illuminate the text of The Books of Abarat, more than one hundred and twenty-five of which can be found within this volume.Mr. Barker lives in California. He shares his house with seven dogs, three cockatiels, several undomesticated geckoes, an African gray parrot called Smokey, and a yellow-headed Amazon parrot called Malingo."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780061452888.jpg?height=500&v=v2"
    }
  }
]