[
  {
    "bookName": "Between the World and Me",
    "bookAuthor": "Ta-Nehisi Coates",
    "bookPrice": "$26.00 $24.18",
    "linkDetail": "https://bookshop.org/books/between-the-world-and-me/9780812993547",
    "bookDetail": {
      "bookDetail": {
        "price": "$19.98",
        "sale": "",
        "PublishDate": "April 17, 2021",
        "Publisher": "James Fell",
        "Pages": "394",
        "Dimensions": "6.0 X 9.0 X 0.81 inches | 1.15 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "James Fell",
        "about": "James Fell has written columns for the Los Angeles Times, Chicago Tribune, Chatelaine, and AskMen. He has also written for TIME Magazine, NPR, Guardian, Men's Health, and Women's Health.After a dozen years of writing about fitness and motivation, he suddenly switched genres to begin writing about history, a subject for which he has a master's degree, in a sweary and sarcastic manner. Much to his surprise, it proved immensely popular, instantly garnering millions of readers each month. He continues to post history stories daily on his Facebook page (@BodyForWife) and is one of the most popular writers on Substack at JamesFell.Substack.com."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781777574208.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "On This Day in History Sh!t Went Down",
    "bookAuthor": "James Fell",
    "bookPrice": "$19.98",
    "linkDetail": "https://bookshop.org/books/on-this-day-in-history-sh-t-went-down/9781777574208",
    "bookDetail": {
      "bookDetail": {
        "price": "$29.76",
        "sale": "$32.00",
        "PublishDate": "September 07, 2021",
        "Publisher": "Scribner Book Company",
        "Pages": "576",
        "Dimensions": "6.4 X 9.1 X 1.7 inches | 1.98 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          " "
        ]
      },
      "Author": {
        "name": "Ada Ferrer",
        "about": "Ada Ferrer is Julius Silver Professor of History and Latin American and Caribbean Studies at New York University, where she has taught since 1995. She is the author of Insurgent Cuba: Race, Nation, and Revolution, 1868-1898, winner of the Berkshire Book Prize for the best first book by a woman in any field of history, and Freedom's Mirror: Cuba and Haiti in the Age of Revolution, which won the Frederick Douglass Book Prize from the Gilder Lehrman Center at Yale University as well as multiple prizes from the American Historical Association. Born in Cuba and raised in the United States, she has been traveling to and conducting research on the island since 1990."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781501154553.jpg?height=500&v=v2-e1dd04587e272b2187ad9240db7eb566"
    }
  },
  {
    "bookName": "Cuba: An American History",
    "bookAuthor": "Ada Ferrer",
    "bookPrice": "$32.00 $29.76",
    "linkDetail": "https://bookshop.org/books/cuba-an-american-history-9781501154553/9781501154553",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.04",
        "sale": "$28.00",
        "PublishDate": "June 07, 2022",
        "Publisher": "Little Brown and Company",
        "Pages": "240",
        "Dimensions": "6.2 X 9.3 X 1.1 inches | 0.9 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          " ­ ",
          " An instant bestseller in Ireland, "
        ]
      },
      "Author": {
        "name": "Séamas O'Reilly",
        "about": "Seamas O'Reilly is a columnist for the Observer and writes about media and politics for the Irish Times, New Statesman, Guts, and VICE. He lives in the London borough of Hackney with his family."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780316424257.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Did Ye Hear Mammy Died?: A Memoir",
    "bookAuthor": "Séamas O'Reilly",
    "bookPrice": "$28.00 $26.04",
    "linkDetail": "https://bookshop.org/books/did-ye-hear-mammy-died-a-memoir/9780316424257",
    "bookDetail": {
      "bookDetail": {
        "price": "$24.18",
        "sale": "$26.00",
        "PublishDate": "July 14, 2015",
        "Publisher": "One World",
        "Pages": "176",
        "Dimensions": "5.1 X 7.3 X 0.9 inches | 0.55 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Ta-Nehisi Coates",
        "about": "Ta-Nehisi Coates is a national correspondent for The Atlantic. His book Between the World and Me won the National Book Award in 2015. Coates is the recipient of a MacArthur Fellowship. He lives in New York City with his wife and son."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780812993547.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Sapiens: A Brief History of Humankind",
    "bookAuthor": "Yuval Noah Harari",
    "bookPrice": "$24.99 $23.24",
    "linkDetail": "https://bookshop.org/books/sapiens-a-brief-history-of-humankind-9781467601573/9780062316110",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "April 10, 2020",
        "Publisher": "University of Chicago Press",
        "Pages": "240",
        "Dimensions": "5.3 X 8.3 X 0.6 inches | 0.6 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Eve L. Ewing",
        "about": "Eve L. Ewing is an author and a sociologist of education whose research is focused on racism, social inequality, urban policy, and the impact of these forces on American public schools and the lives of young people. Her works include Ghosts in the Schoolyard: Racism & School Closings on Chicago's South Side, the poetry collections Electric Arches and 1919, and the middle-grade text Maya and the Robot. She has written for the Champions series, the Ironheart series, and other Marvel projects. Along with the award-winning author and poet Nate Marshall, Ewing wrote the play No Blue Memories: The Life of Gwendolyn Brooks, commissioned by the Poetry Foundation. Ewing is currently an assistant professor at the University of Chicago School of Social Service and an instructor for the Prison + Neighborhood Art Project, a visual arts and humanities project that connects teaching artists and scholars to men at Stateville Maximum Security Prison through classes, workshops, and guest lectures."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780226526164.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Facemaker: A Visionary Surgeon's Battle to Mend the...",
    "bookAuthor": "Lindsey Fitzharris",
    "bookPrice": "$30.00 $27.90",
    "linkDetail": "https://bookshop.org/books/the-facemaker-a-visionary-surgeon-s-battle-to-mend-the-disfigured-soldiers-of-world-war-i/9780374282301",
    "bookDetail": {
      "bookDetail": {
        "price": "$14.88",
        "sale": "$16.00",
        "PublishDate": "June 11, 2019",
        "Publisher": "Haymarket Books",
        "Pages": "88",
        "Dimensions": "8.0 X 7.8 X 0.3 inches | 0.35 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          " ",
          " ",
          " ",
          " ",
          " ",
          " ",
          " The Chicago Race Riot of 1919, the most intense of the riots comprising the nation's Red Summer, has shaped the last century but is not widely discussed. In "
        ]
      },
      "Author": {
        "name": "Eve L. Ewing",
        "about": "Dr. Eve L. Ewing is a sociologist of education and a writer from Chicago. She is the author of Electric Arches, which received awards from the American Library Association and the Poetry Society of America and was named one of the year's best books by NPR and the Chicago Tribune. She is also author of Ghosts in the Schoolyard: Racism and School Closings on Chicago's South Side and the co-author (with Nate Marshall) of No Blue Memories: The Life of Gwendolyn Brooks. She is an assistant professor at the University of Chicago School of Social Service Administration. Her work has been published in The New Yorker, The Atlantic, The New York Times, and many other venues."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781608465989.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "1919",
    "bookAuthor": "Eve L. Ewing",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/1919-9781608465989/9781608465989",
    "bookDetail": {
      "bookDetail": {
        "price": "$27.90",
        "sale": "$30.00",
        "PublishDate": "June 07, 2022",
        "Publisher": "Farrar, Straus and Giroux",
        "Pages": "336",
        "Dimensions": "6.34 X 9.31 X 1.2 inches | 1.3 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          "Lindsey Fitzharris, the award-winning author of "
        ]
      },
      "Author": {
        "name": "Lindsey Fitzharris",
        "about": "Lindsey Fitzharris is the author of The Butchering Art: Joseph Lister's Quest to Transform the Grisly World of Victorian Medicine, which won the PEN/E. O. Wilson Award for Literary Science Writing and has been translated into multiple languages. Her TV series The Curious Life and Death of . . . aired on the Smithsonian Channel. She contributes regularly to The Wall Street Journal, Scientific American, and other notable publications, and holds a doctorate in the History of Science and Medicine from the University of Oxford."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780374282301.jpg?height=500&v=v2-136178db1540a7c85a4477853363b4fb"
    }
  },
  {
    "bookName": "Ghosts in the Schoolyard: Racism and School Closings on...",
    "bookAuthor": "Eve L. Ewing",
    "bookPrice": "$16.00 $14.88",
    "linkDetail": "https://bookshop.org/books/ghosts-in-the-schoolyard-racism-and-school-closings-on-chicago-s-south-side/9780226526164",
    "bookDetail": {
      "bookDetail": {
        "price": "$23.24",
        "sale": "$24.99",
        "PublishDate": "May 15, 2018",
        "Publisher": "Harper Perennial",
        "Pages": "464",
        "Dimensions": "6.0 X 9.0 X 1.3 inches | 2.15 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Yuval Noah Harari",
        "about": "Prof. Yuval Noah Harari is a historian, philosopher, and the bestselling author of Sapiens: A Brief History of Humankind, Homo Deus: A Brief History of Tomorrow, 21 Lessons for the 21st Century, and Sapiens: A Graphic History. His books have sold over 35 million copies in 65 languages, and he is considered one of the world's most influential public intellectuals today. The Guardian has credited Sapiens with revolutionizing the non-fiction market and popularizing \"brainy books\".In 2020 Harari joined forces with renowned comics artists David Vandermeulen and Daniel Casanave, to create Sapiens: A Graphic History: a radical adaptation of the original Sapiens into a graphic novel series. This illustrated collection casts Yuval Noah Harari in the role of guide, who takes the reader through the entire history of the human species, accompanied by a range of fictional characters and traveling through time, space and popular culture references.Born in Haifa, Israel, in 1976, Harari received his PhD from the University of Oxford in 2002, and is currently a lecturer at the Department of History, the Hebrew University of Jerusalem. He originally specialized in world history, medieval history and military history, and his current research focuses on macro-historical questions such as: What is the relationship between history and biology? What is the essential difference between Homo sapiens and other animals? Is there justice in history? Does history have a direction? Did people become happier as history unfolded? What ethical questions do science and technology raise in the 21st century?"
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780062316110.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Vagina Obscura: An Anatomical Voyage",
    "bookAuthor": "Rachel E Gross",
    "bookPrice": "$30.00 $27.90",
    "linkDetail": "https://bookshop.org/books/vagina-obscura-an-anatomical-voyage-9781324050537/9781324006312",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.04",
        "sale": "$28.00",
        "PublishDate": "June 08, 2021",
        "Publisher": "Random House",
        "Pages": "416",
        "Dimensions": "5.91 X 8.35 X 1.5 inches | 1.32 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Tiya Miles",
        "about": "Tiya Miles is professor of history and Radcliffe Alumnae Professor at the Radcliffe Institute for Advanced Study and director of the Charles Warren Center for Studies in American History at Harvard University. She is a recipient of a MacArthur Foundation fellowship and the Hiett Prize in the Humanities from the Dallas Institute of Humanities and Culture. Miles is the author of The Dawn of Detroit, which won the Frederick Douglass Book Prize, among other honors, as well as the acclaimed books Ties That Bind, The House on Diamond Hill, The Cherokee Rose: A Novel of Gardens and Ghosts, and Tales from the Haunted South, a published lecture series."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781984854995.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "A Little Devil in America: In Praise of Black Performance",
    "bookAuthor": "Hanif Abdurraqib",
    "bookPrice": "$18.00 $16.74",
    "linkDetail": "https://bookshop.org/books/a-little-devil-in-america-in-praise-of-black-performance-9798885780292/9781984801203",
    "bookDetail": {
      "bookDetail": {
        "price": "$27.90",
        "sale": "$30.00",
        "PublishDate": "March 29, 2022",
        "Publisher": "W. W. Norton & Company",
        "Pages": "336",
        "Dimensions": "6.38 X 9.36 X 1.11 inches | 1.26 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Rachel E Gross",
        "about": "Rachel E. Gross is an award-winning science journalist based in Brooklyn, New York. A former Knight Science Journalism Fellow and digital science editor of Smithsonian magazine, she writes for BBC Future, the New York Times, and Scientific American."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781324006312.jpg?height=500&v=v2-5626a79f93cb53b05f8bbd1d01cd6d2d"
    }
  },
  {
    "bookName": "Black on Both Sides: A Racial History of Trans Identity",
    "bookAuthor": "C. Riley Snorton",
    "bookPrice": "$24.95 $23.20",
    "linkDetail": "https://bookshop.org/books/black-on-both-sides-a-racial-history-of-trans-identity/9781517901738",
    "bookDetail": {
      "bookDetail": {
        "price": "$23.20",
        "sale": "$24.95",
        "PublishDate": "December 05, 2017",
        "Publisher": "University of Minnesota Press",
        "Pages": "256",
        "Dimensions": "5.4 X 8.3 X 0.8 inches | 0.66 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          " Winner of the William Sanders Scarborough Prize from the Modern Language Association 2018 ",
          " Winner of an American Library Association Stonewall Honor 2018 ",
          " Winner of Lambda Literary Award for Transgender Nonfiction 2018 ",
          " Winner of the Sylvia Rivera Award in Transgender Studies from the Center for Lesbian and Gay Studies"
        ]
      },
      "Author": {
        "name": "C. Riley Snorton",
        "about": "C. Riley Snorton is associate professor of Africana studies and feminist, gender, and sexuality studies at Cornell University and visiting associate professor of American studies and ethnicity at the University of Southern California. He is author of Nobody Is Supposed to Know: Black Sexuality on the Down Low (Minnesota, 2014)."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781517901738.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "All That She Carried: The Journey of Ashley's Sack, a Black...",
    "bookAuthor": "Tiya Miles",
    "bookPrice": "$28.00 $26.04",
    "linkDetail": "https://bookshop.org/books/all-that-she-carried-the-journey-of-ashley-s-sack-a-black-family-keepsake/9781984854995",
    "bookDetail": {
      "bookDetail": {
        "price": "$16.74",
        "sale": "$18.00",
        "PublishDate": "March 08, 2022",
        "Publisher": "Random House Trade",
        "Pages": "320",
        "Dimensions": "5.32 X 8.08 X 0.69 inches | 0.5 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "ONE OF THE TEN BEST BOOKS OF THE YEAR: "
        ]
      },
      "Author": {
        "name": "Hanif Abdurraqib",
        "about": "Hanif Abdurraqib is a poet, essayist, and cultural critic from Columbus, Ohio. His poetry has been published in PEN American, Muzzle, Vinyl, and other journals, and his essays and criticism have been published in The New Yorker, Pitchfork, The New York Times, and Fader. His first full-length poetry collection, The Crown Ain't Worth Much, was named a finalist for the Eric Hoffer book award and nominated for a Hurston-Wright Legacy Award. His first collection of essays, They Can't Kill Us Until They Kill Us was named a book of the year by NPR, Esquire, BuzzFeed, O: The Oprah Magazine, Pitchfork and Chicago Tribune, among others. Go Ahead in the Rain: Notes to a Tribe Called Quest was a New York Times bestseller and a National Book Critics Circle Award and Kirkus Prize finalist and was longlisted for the National Book Award. His second collection of poems, A Fortune for Your Disaster, won the Lenore Marshall Poetry Prize. He is a graduate of Beechcroft High School. In 2021, he was named a MacArthur \"Genius Grant\" Fellow."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781984801203.jpg?height=500&v=v2-4e06f8378008b767d1d81432e80d185e"
    }
  },
  {
    "bookName": "Jesus and John Wayne: How White Evangelicals Corrupted a...",
    "bookAuthor": "Kristin Kobes Du Mez",
    "bookPrice": "$28.95 $26.92",
    "linkDetail": "https://bookshop.org/books/jesus-and-john-wayne-how-white-evangelicals-corrupted-a-faith-and-fractured-a-nation-9781631499050/9781631495731",
    "bookDetail": {
      "bookDetail": {
        "price": "$34.88",
        "sale": "$37.50",
        "PublishDate": "June 07, 2022",
        "Publisher": "Random House",
        "Pages": "672",
        "Dimensions": "",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "David I. Kertzer",
        "about": "David I. Kertzer is the Paul Dupee, Jr., University Professor of Social Science and professor of anthropology and Italian studies at Brown University, where he formerly served as provost. He is the author of twelve previous books, including The Pope and Mussolini, winner of the Pulitzer Prize, and The Kidnapping of Edgardo Mortara, a National Book Award finalist. In 2005 he was elected to membership in the American Academy of Arts and Sciences. Kertzer and his wife, Susan, live in Rhode Island and Maine."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780812989946.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Born to Be Hanged: The Epic Story of the Gentlemen Pirates...",
    "bookAuthor": "Keith Thomson",
    "bookPrice": "$32.00 $29.76",
    "linkDetail": "https://bookshop.org/books/born-to-be-hanged-the-epic-story-of-the-gentlemen-pirates-who-raided-the-south-seas-rescued-a-princess-and-stole-a-fortune-9781668614723/9780316703611",
    "bookDetail": {
      "bookDetail": {
        "price": "$29.76",
        "sale": "$32.00",
        "PublishDate": "May 10, 2022",
        "Publisher": "Little Brown and Company",
        "Pages": "384",
        "Dimensions": "6.35 X 9.49 X 1.25 inches | 1.29 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Keith Thomson",
        "about": "Keith Thomson is the author of several novels, including Pirates of Pensacola and the New York Times bestseller Once a Spy. The former Columbia history major also writes nonfiction for the New York Times, Garden & Gun, and the Huffington Post on a range of topics, including national security and piracy. He lives in Birmingham, Alabama."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780316703611.jpg?height=500&v=v2-68fa690fb893d1ecfe926f345a8cea2f"
    }
  },
  {
    "bookName": "The Pope at War: The Secret History of Pius XII, Mussolini,...",
    "bookAuthor": "David I. Kertzer",
    "bookPrice": "$37.50 $34.88",
    "linkDetail": "https://bookshop.org/books/the-pope-at-war-the-secret-history-of-pius-xii-mussolini-and-hitler/9780812989946",
    "bookDetail": {
      "bookDetail": {
        "price": "$27.89",
        "sale": "$29.99",
        "PublishDate": "May 03, 2022",
        "Publisher": "Ecco Press",
        "Pages": "464",
        "Dimensions": "6.4 X 9.24 X 1.5 inches | 1.46 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Mark Rozzo",
        "about": "Mark Rozzo is a contributing editor at Vanity Fair . He has also written for the Los Angeles Times, the New Yorker, the New York Times, Esquire, Vogue, the Wall Street Journal, the Oxford American, the Washington Post, and many others. He teaches nonfiction writing at Columbia University."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780062939975.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Everybody Thought We Were Crazy: Dennis Hopper, Brooke...",
    "bookAuthor": "Mark Rozzo",
    "bookPrice": "$29.99 $27.89",
    "linkDetail": "https://bookshop.org/books/everybody-thought-we-were-crazy-dennis-hopper-brooke-hayward-and-1960s-los-angeles/9780062939975",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.92",
        "sale": "$28.95",
        "PublishDate": "June 23, 2020",
        "Publisher": "Liveright Publishing Corporation",
        "Pages": "368",
        "Dimensions": "6.6 X 9.3 X 1.5 inches | 1.3 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Kristin Kobes Du Mez",
        "about": "Kristin Kobes Du Mez is a professor of history at Calvin University and the author of A New Gospel for Women. She has written for the Washington Post, Christianity Today, Christian Century, and Religion & Politics, among other publications. She lives in Grand Rapids, Michigan."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781631495731.jpg?height=500&v=v2-b4a6d21b11ccbaef189b1b8f4d0b38e9"
    }
  },
  {
    "bookName": "The Color of Money: Black Banks and the Racial Wealth Gap",
    "bookAuthor": "Mehrsa Baradaran",
    "bookPrice": "$18.95 $17.62",
    "linkDetail": "https://bookshop.org/books/the-color-of-money-black-banks-and-the-racial-wealth-gap-9780674970953/9780674237476",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.81",
        "sale": "$17.00",
        "PublishDate": "October 19, 2021",
        "Publisher": "Grove Press",
        "Pages": "336",
        "Dimensions": "5.43 X 8.11 X 0.94 inches | 0.8 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": []
      },
      "Author": {
        "name": "Frantz Fanon Richard Philcox Cornel West",
        "about": "Frantz Fanon was born in Martinique in 1925. He served in the French Army during World War II, and later studied medicine and psychiatry in France, where he published his first book, Black Skin, White Masks in 1952. He joined the Algerian Nationalist Movement in the mid-1950s, and published The Wretched of the Earth shortly before dying of leukemia in December 1961."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780802158635.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Splendid and the Vile: A Saga of Churchill, Family, and...",
    "bookAuthor": "Erik Larson",
    "bookPrice": "$32.00 $29.76",
    "linkDetail": "https://bookshop.org/books/the-splendid-and-the-vile-a-saga-of-churchill-family-and-defiance-during-the-blitz/9780385348713",
    "bookDetail": {
      "bookDetail": {
        "price": "$17.62",
        "sale": "$18.95",
        "PublishDate": "March 11, 2019",
        "Publisher": "Belknap Press",
        "Pages": "384",
        "Dimensions": "5.4 X 8.2 X 1.2 inches | 0.75 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "--"
        ]
      },
      "Author": {
        "name": "Mehrsa Baradaran",
        "about": "Mehrsa Baradaran is Professor of Law at UCI Law and a celebrated authority on banking law. In addition to the prizewinning The Color of Money, she is author of How the Other Half Banks. She has advised US senators and representatives on policy and spoken at national and international forums including the World Bank."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780674237476.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Jakarta Method: Washington's Anticommunist Crusade and...",
    "bookAuthor": "Vincent Bevins",
    "bookPrice": "$18.99 $17.66",
    "linkDetail": "https://bookshop.org/books/the-jakarta-method-washington-s-anticommunist-crusade-and-the-mass-murder-program-that-shaped-our-world/9781541724006",
    "bookDetail": {
      "bookDetail": {
        "price": "$17.66",
        "sale": "$18.99",
        "PublishDate": "April 27, 2021",
        "Publisher": "PublicAffairs",
        "Pages": "352",
        "Dimensions": "5.4 X 8.0 X 1.0 inches | 0.7 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "\n      "
        ]
      },
      "Author": {
        "name": "Vincent Bevins",
        "about": "Vincent Bevins is an award-winning journalist and correspondent. He covered Southeast Asia for the Washington Post, reporting from across the entire region and paying special attention to the legacy of the 1965 massacre in Indonesia. He previously served as the Brazil correspondent for the Los Angeles Times, also covering nearby parts of South America, and before that he worked for the Financial Times in London.Among the other publications he has written for are the New York Times, The Atlantic, The Economist, the Guardian, Foreign Policy, the New York Review of Books, Folha de S.Paulo, The New Republic, The New Inquiry, The Awl, The Baffler, and New York magazine. Vincent was born and raised in California and spent the last few years living in Jakarta."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781541724006.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Wretched of the Earth",
    "bookAuthor": "Frantz Fanon",
    "bookPrice": "$17.00 $15.81",
    "linkDetail": "https://bookshop.org/books/the-wretched-of-the-earth-9780802141323/9780802158635",
    "bookDetail": {
      "bookDetail": {
        "price": "$29.76",
        "sale": "$32.00",
        "PublishDate": "February 25, 2020",
        "Publisher": "Crown Publishing Group (NY)",
        "Pages": "608",
        "Dimensions": "6.4 X 9.3 X 1.5 inches | 2.0 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Erik Larson",
        "about": "Erik Larson is the author of six New York Times bestsellers, most recently The Splendid and the Vile: A Saga of Churchill, Family, and Defiance During the Blitz, which examines how Winston Churchill and his \"Secret Circle\" went about surviving the German air campaign of 1940-41. Larson's The Devil in the White City is set to be a Hulu limited series; his In the Garden of Beasts is under option by Tom Hanks for a feature film. He recently published an audio-original ghost story, No One Goes Alone, which has been optioned by Chernin Entertainment, in association with Netflix. His Thunderstruck has been optioned by Sony Pictures Television for a limited TV series. Larson lives in Manhattan with his wife, who is a writer and retired neonatologist; they have three grown daughters."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780385348713.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Ashkenazi Herbalism: Rediscovering the Herbal Traditions of...",
    "bookAuthor": "Deatra Cohen and Adam Siegel",
    "bookPrice": "$24.95 $23.20",
    "linkDetail": "https://bookshop.org/books/ashkenazi-herbalism-rediscovering-the-herbal-traditions-of-eastern-european-jews/9781623175443",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.96",
        "sale": "$28.99",
        "PublishDate": "June 14, 2022",
        "Publisher": "Hanover Square Press",
        "Pages": "272",
        "Dimensions": "6.25 X 9.12 X 0.92 inches | 0.93 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": [
          "*AN ",
          "Fire Island, a thin strip of beach off the Long Island coast, has long been a vital space in the queer history of America. Both utopian and exclusionary, healing and destructive, the island is a locus of contradictions, all of which coalesce against a stunning ocean backdrop.",
          "Now, poet and scholar Jack Parlett tells the story of this iconic destination--its history, its meaning and its cultural significance--told through the lens of the artists and creators who sought refuge on its shores. Together, figures as divergent as Walt Whitman, Oscar Wilde, James Baldwin, Carson McCullers, Frank O'Hara, Patricia Highsmith and Jeremy O. Harris tell the story of a queer space in constant evolution.",
          "Transporting, impeccably researched and gorgeously written, "
        ]
      },
      "Author": {
        "name": "Jack Parlett",
        "about": "Jack Parlett is a writer, poet, and scholar. He is the author of The Poetics of Cruising: Queer Visual Culture from Whitman to Grindr, published by the University of Minnesota Press and Same Blue, Different You, a chapbook. He holds a Junior Research Fellowship at University College, Oxford, where he teaches American literature and literary theory. His essays have appeared in Poetry London, Lit Hub, and elsewhere. He lives in Oxford."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781335475183.jpg?height=500&v=v2-2e87b7e3301a084db4f33a672551aa52"
    }
  },
  {
    "bookName": "Maus II: A Survivor's Tale: And Here My Troubles Began",
    "bookAuthor": "Art Spiegelman",
    "bookPrice": "$16.95 $15.76",
    "linkDetail": "https://bookshop.org/books/maus-ii-a-survivor-s-tale-and-here-my-troubles-began/9780679729778",
    "bookDetail": {
      "bookDetail": {
        "price": "$15.76",
        "sale": "$16.95",
        "PublishDate": "September 01, 1992",
        "Publisher": "Pantheon Books",
        "Pages": "144",
        "Dimensions": "6.42 X 9.12 X 0.41 inches | 0.77 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": {}
      },
      "Author": {
        "name": "Art Spiegelman",
        "about": "ART SPIEGELMAN is one of the world's most admired and beloved comic artists, best known for his Pulitzer Prize-winning Holocaust narrative, Maus. Born in Stockholm in 1948, Spiegelman began studying cartooning in high school and drawing professionally at age sixteen. He studied art and philosophy at Harpur College before joining the underground comics movement in the 1960s. Spiegelman taught history and the aesthetics of comics at the School of Visual Arts in New York from 1979 to 1986, and in 1980 he founded RAW, the acclaimed avant-garde comics magazine, with his wife, Françoise Mouly. Honors Spiegelman has received include induction into the Will Eisner Hall of Fame and the Art Director's Club Hall of Fame. In 2005, he was named one of Time magazine's 100 Most Influential People. He was made an Officier de l'Ordre des Arts et des Lettres in 2007, and in 2011 he was awarded the Grand Prix at the Angoulême International Comics Festival. In 2015, he was elected to the American Academy of Arts and Letters, and in 2018 he became the first comic artist to receive the Edward MacDowell Medal. His art has been exhibited at museums throughout the world, including the Pompidou Center in Paris, the Ludwig Museum in Cologne, the Vancouver Art Gallery, the Jewish Museum in New York City, and the Los Angeles Museum of Contemporary Art."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780679729778.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Travels with George: In Search of Washington and His Legacy",
    "bookAuthor": "Nathaniel Philbrick",
    "bookPrice": "$30.00 $27.90",
    "linkDetail": "https://bookshop.org/books/travels-with-george-in-search-of-washington-and-his-legacy-9780593460214/9780525562177",
    "bookDetail": {
      "bookDetail": {
        "price": "$27.90",
        "sale": "$30.00",
        "PublishDate": "September 14, 2021",
        "Publisher": "Viking",
        "Pages": "400",
        "Dimensions": "6.22 X 9.13 X 1.42 inches | 1.35 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Nathaniel Philbrick",
        "about": "Nathaniel Philbrick grew up in Pittsburgh, Pennsylvania, and earned a BA in English from Brown University and an MA in America Literature from Duke University, where he was a James B. Duke Fellow. He was Brown University's first Intercollegiate All-American sailor in 1978, the same year he won the Sunfish North Americans in Barrington, Rhode Island. After working as an editor at Sailing World magazine, he wrote and edited several books about sailing, including The Passionate Sailor, Second Wind, and Yaahting: A Parody. In 2000, Philbrick published the New York Times bestseller In the Heart of the Sea, which won the National Book Award for nonfiction. The book is the basis of the Warner Bros. motion picture Heart of the Sea, directed by Ron Howard and starring Chris Hemsworth, Cillian Murphy, Brendan Gleeson, Benjamin Walker, Ben Wishaw, and Tom Holland. The book also inspired a 2001 Dateline special on NBC as well as the 2010 two-hour PBS American Experience film Into the Deep by Ric Burns. Philbrick's writing has appeared in Vanity Fair, The New York Times Book Review, The Wall Street Journal, the Los Angeles Times, and The Boston Globe. He has appeared on the Today show, The Morning Show, Dateline, PBS's American Experience, C-SPAN, and NPR. He and his wife live on Nantucket."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780525562177.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "Fire Island: A Century in the Life of an American Paradise",
    "bookAuthor": "Jack Parlett",
    "bookPrice": "$28.99 $26.96",
    "linkDetail": "https://bookshop.org/books/fire-island-a-century-in-the-life-of-an-american-paradise-9798200915637/9781335475183",
    "bookDetail": {
      "bookDetail": {
        "price": "$23.20",
        "sale": "$24.95",
        "PublishDate": "April 06, 2021",
        "Publisher": "North Atlantic Books",
        "Pages": "352",
        "Dimensions": "6.0 X 8.9 X 1.0 inches | 1.15 pounds",
        "Languages": "English",
        "Type": "Paperback",
        "description": [
          "Including the first ",
          "Part I introduces a brief history of the Ashkenazim and provides an overview of traditional medicine among Eastern European Jews. Part II offers a comparative overview of healing customs among Jews of the Pale of Settlement, their many native plants, and the remedies applied by local healers to treat a range of illnesses. This "
        ]
      },
      "Author": {
        "name": "Deatra Cohen Adam Siegel",
        "about": "DEATRA COHEN is a former reference librarian, is a clinical herbalist who trained with the Berkeley (formerly Ohlone) Herbal Center, belongs to a Western Clinical Herbal collective, and is a Master Gardener at the University of California. In her research, Cohen became frustrated with the lack of practical information available to Jews of Ashkenazi descent, and related to Eastern European traditions in general. Ashkenazi Herbalism was written to reconcile this lack, and the first work in any language to document the herbal practices of Ashkenazi Jews. ADAM SIEGEL is a research librarian at University of California, Davis, and a historian of Central and Eastern Europe, studying issues around cultural contact and plant knowledge in the region. Siegel is a literary translator who has translated works from Russian, Czech, German, Croatian, Serbian, French, Italian, Swedish, and Norwegian, and was awarded a National Endowment for the Arts Literary Translation Fellowship in 2014. Siegel conducted the non-English research for this work, reviewing literature and scholarship in Yiddish, Ukrainian, Russian, German, Polish, and Hebrew."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9781623175443.jpg?height=500&v=v2"
    }
  },
  {
    "bookName": "The Nineties: A Book",
    "bookAuthor": "Chuck Klosterman",
    "bookPrice": "$28.00 $26.04",
    "linkDetail": "https://bookshop.org/books/the-nineties-a-book/9780735217959",
    "bookDetail": {
      "bookDetail": {
        "price": "$26.04",
        "sale": "$28.00",
        "PublishDate": "February 08, 2022",
        "Publisher": "Penguin Press",
        "Pages": "384",
        "Dimensions": "5.9 X 9.3 X 1.4 inches | 1.4 pounds",
        "Languages": "English",
        "Type": "Hardcover",
        "description": []
      },
      "Author": {
        "name": "Chuck Klosterman",
        "about": "Chuck Klosterman is the bestselling author of eight nonfiction books (including The Nineties; Sex, Drugs, and Cocoa Puffs; and But What If We're Wrong?), two novels (Downtown Owl and The Visible Man), and the short story collection Raised in Captivity. He has written for The New York Times, The Washington Post, GQ, Esquire, Spin, The Guardian (London), The Believer, and ESPN. Klosterman served as the Ethicist for The New York Times Magazine for three years and was an original founder of the website Grantland with Bill Simmons. He was raised in rural North Dakota and now lives in Portland, Oregon."
      },
      "bookImage": "https://images-us.bookshop.org/ingram/9780735217959.jpg?height=500&v=v2-2919aa0ac43d63f855d49c713ffa150c"
    }
  }
]