[{"bookName":"Watergate: A New History","bookAuthor":"Garrett M. Graff","bookPrice":"$35.00 $32.55","linkDetail":"https://bookshop.org/books/watergate-a-new-history/9781982139162","bookDetail":{"bookDetail":{"price":"$17.65","sale":"$18.98","PublishDate":"October 19, 2021","Publisher":"Ten Speed Press","Pages":"144","Dimensions":"7.32 X 9.31 X 0.65 inches | 1.15 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Adrienne Keene Ciara Sana","about":"Adrienne Keene is a citizen of the Cherokee Nation, an assistant professor of American studies and ethnic studies at Brown University, and holds a doctorate in culture, communities, and education from the Harvard Graduate School of Education. She cohosts the podcast All My Relations and is the longtime author of Native Appropriations, a blog discussing representations of Native peoples in popular culture. Her writing has appeared in such outlets as Teen Vogue, the New York Times, Stanford Magazine, and Indian Country Today, and she has appeared on NPR, CBC, Al Jazeera, PBS, BuzzFeed, and Slate's Represent podcast.Ciara Sana is a Chamoru artist currently based in Bellingham, Washington, but grew up in Guam, where she was surrounded by a mix of Indigenous Chamoru culture and people from all over the Pacific islands, Asia, and the U.S. mainland. Ciara's art is deeply rooted in her culture and inspired by all the different styles and flavors found on the beautiful island. The goal of her work is to empower and uplift others, celebrate differences, and encourage love."},"bookImage":"https://images-us.bookshop.org/ingram/9781984857941.jpg?height=500&v=v2"}},{"bookName":"Four Hundred Souls: A Community History of African America,...","bookAuthor":"Ibram X Kendi and Keisha N. Blain","bookPrice":"$32.00 $29.76","linkDetail":"https://bookshop.org/books/four-hundred-souls-a-community-history-of-african-america-1619-2019-9780593402429/9780593134047","bookDetail":{"bookDetail":{"price":"$32.55","sale":"$35.00","PublishDate":"February 15, 2022","Publisher":"Avid Reader Press / Simon & Schuster","Pages":"832","Dimensions":"6.5 X 9.1 X 1.8 inches | 2.5 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Garrett M. Graff","about":"Garrett M. Graff, a distinguished journalist and bestselling historian, has spent more than a dozen years covering politics, technology, and national security. Today, he serves as the director of cyber initiatives for The Aspen Institute and is a contributor to Wired, CNN, and Politico. He's written for publications from Esquire to Rolling Stone to The New York Times, and edited two of Washington's most prestigious magazines, Washingtonian and Politico. Graff is the author of multiple books, including The Threat Matrix, the national bestseller Raven Rock, and the New York Times bestseller The Only Plane in the Sky."},"bookImage":"https://images-us.bookshop.org/ingram/9781982139162.jpg?height=500&v=v2-be34d4f0ac5dba9cf23539e7ba3c1891"}},{"bookName":"Been There, Done That: A Rousing History of Sex","bookAuthor":"Rachel Feltman","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/been-there-done-that-a-rousing-history-of-sex/9781645037163","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"May 17, 2022","Publisher":"Bold Type Books","Pages":"336","Dimensions":"5.4 X 8.0 X 1.3 inches | 0.95 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Rachel Feltman","about":"Rachel Feltman's first paying gig was organizing a bookshelf full of textbooks on vulvar disease at the age of seven, and she never looked back. She's the Executive Editor of Popular Science and hosts PopSci's podcast The Weirdest Thing I Learned This Week. In 2014, Feltman founded the Washington Post's Speaking of Science blog, known for headlines like \"You probably have herpes, but that's really okay,\" and \"Uranus might be full of surprises.\" Feltman studied environmental science at Simon's Rock and has a master's in science reporting from NYU. She's a musician, an actress, and the stepmom of a very spry 14-year-old cat."},"bookImage":"https://images-us.bookshop.org/ingram/9781645037163.jpg?height=500&v=v2-eb1880a415e17ff99d16aa4259356f5d"}},{"bookName":"Notable Native People: 50 Indigenous Leaders, Dreamers, and...","bookAuthor":"Adrienne Keene and Ciara Sana","bookPrice":"$18.98 $17.65","linkDetail":"https://bookshop.org/books/notable-native-people-50-indigenous-leaders-dreamers-and-changemakers-from-past-and-present/9781984857941","bookDetail":{"bookDetail":{"price":"$29.76","sale":"$32.00","PublishDate":"February 02, 2021","Publisher":"One World","Pages":"528","Dimensions":"6.1 X 9.2 X 1.8 inches | 1.8 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Ibram X Kendi Keisha N. Blain","about":"Dr. Ibram X. Kendi is the Andrew W. Mellon Professor in the Humanities at Boston University and the founding director of the BU Center for Antiracist Research. He is a contributing writer at The Atlantic and a CBS News racial justice contributor. He is the host of the new action podcast Be Antiracist. Dr. Kendi is the author of many highly acclaimed books including Stamped from the Beginning: The Definitive History of Racist Ideas in America, which won the National Book Award for Nonfiction, making him the youngest-ever winner of that award. He has also produced five straight #1 New York Times bestsellers, including How to Be an Antiracist, Antiracist Baby, and Stamped: Racism, Antiracism, and You, co-authored by Jason Reynolds. In 2020, Time magazine named Dr. Kendi one of the 100 most influential people in the world. He was awarded a 2021 MacArthur Fellowship, popularly known as the Genius Grant. Keisha N. Blain is an award-winning historian, professor, and writer. She is currently an associate professor of history at the University of Pittsburgh, the president of the African American Intellectual History Society, and an editor for The Washington Post's Made by History section. Her writing has appeared in popular outlets such as The Atlantic, The Guardian, Politico, and Time. She is the author of Set the World on Fire: Black Nationalist Women and the Global Struggle for Freedom and Until I Am Free: Fannie Lou Hamer's Enduring Message to America."},"bookImage":"https://images-us.bookshop.org/ingram/9780593134047.jpg?height=500&v=v2"}},{"bookName":"The Women's House of Detention: A Queer History of a...","bookAuthor":"Hugh Ryan","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/the-women-s-house-of-detention-a-queer-history-of-a-forgotten-prison/9781645036661","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"May 10, 2022","Publisher":"Bold Type Books","Pages":"368","Dimensions":"5.7 X 8.8 X 1.4 inches | 1.2 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Hugh Ryan","about":"Hugh Ryan is a writer and curator. His first book, When Brooklyn Was Queer, won a 2020 New York City Book Award, was a New York Times Editors' Choice in 2019, and was a finalist for the Randy Shilts and Lambda Literary Awards. He was honored with the 2020 Allan Berube Prize from the American Historical Association. In 2019-2021, he worked on the Hidden Voices: LGBTQ+ Stories in U.S. History curricular materials for the NYC Department of Education."},"bookImage":"https://images-us.bookshop.org/ingram/9781645036661.jpg?height=500&v=v2-7981cd38b8b72a41407d5b39e139e36c"}},{"bookName":"The Shores of Bohemia: A Cape Cod Story, 1910-1960","bookAuthor":"John Taylor Williams","bookPrice":"$35.00 $32.55","linkDetail":"https://bookshop.org/books/the-shores-of-bohemia-a-cape-cod-story-1910-1960/9780374262754","bookDetail":{"bookDetail":{"price":"$7.43","sale":"$7.99","PublishDate":"February 03, 1997","Publisher":"Bantam","Pages":"400","Dimensions":"4.1 X 6.7 X 1.1 inches | 0.45 pounds","Languages":"English","Type":"Mass Market Paperbound","description":[]},"Author":{"name":"Anne Frank Mirjam Pressler Otto M Frank Susan Massotty","about":"Anne Frank was born in 1929 in Germany. Her family moved to Amsterdam in 1933, and she died in the Bergen-Belsen concentration camp in 1945."},"bookImage":"https://images-us.bookshop.org/ingram/9780553577129.jpg?height=500&v=v2"}},{"bookName":"Collective Courage: A History of African American Cooperative...","bookAuthor":"Jessica Gordon Nembhard","bookPrice":"$47.94","linkDetail":"https://bookshop.org/books/collective-courage-a-history-of-african-american-cooperative-economic-thought-and-practice/9780271062174","bookDetail":{"bookDetail":{"price":"$32.55","sale":"$35.00","PublishDate":"May 17, 2022","Publisher":"Farrar, Straus and Giroux","Pages":"368","Dimensions":"5.9 X 8.4 X 1.3 inches | 1.25 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"John Taylor Williams","about":"John Taylor Ike Williams is a founder of the literary agency Kneerim & Williams and a lawyer specializing in intellectual property and First Amendment litigation. He is the coauthor of the widely used textbook Perle, Williams & Fischer on Publishing Law. Williams has served as chair of the National Endowment for the Arts awards panel and as a trustee of the Institute of Contemporary Art in Boston and of the Fine Arts Work Center in Provincetown, Massachusetts, among other positions. He lives in Cambridge and Wellfleet, Massachusetts."},"bookImage":"https://images-us.bookshop.org/ingram/9780374262754.jpg?height=500&v=v2-140c8874ce5061001439af93cb0c7fe8"}},{"bookName":"The Diary of a Young Girl: The Definitive Edition","bookAuthor":"Anne Frank","bookPrice":"$7.99 $7.43","linkDetail":"https://bookshop.org/books/the-diary-of-a-young-girl-the-definitive-edition/9780553577129","bookDetail":{"bookDetail":{"price":"$47.94","sale":"","PublishDate":"March 03, 2014","Publisher":"Penn State University Press","Pages":"328","Dimensions":"6.1 X 9.1 X 0.9 inches | 1.0 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Jessica Gordon Nembhard","about":"Jessica Gordon Nembhard is Associate Professor of Community Justice and Social Economic Development in the Department of Africana Studies at John Jay College, City University of New York."},"bookImage":"https://images-us.bookshop.org/ingram/9780271062174.jpg?height=500&v=v2"}},{"bookName":"We Don't Know Ourselves: A Personal History of Modern Ireland","bookAuthor":"Fintan O'Toole","bookPrice":"$32.00 $29.76","linkDetail":"https://bookshop.org/books/we-don-t-know-ourselves-a-personal-history-of-modern-ireland/9781631496530","bookDetail":{"bookDetail":{"price":"$18.58","sale":"$19.98","PublishDate":"August 15, 2017","Publisher":"Bold Type Books","Pages":"608","Dimensions":"6.0 X 9.1 X 1.7 inches | 1.65 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Ibram X Kendi","about":"Ibram X. Kendi is a #1 New York Times-bestselling author, the Andrew W. Mellon Professor in the Humanities at Boston University, and the founding director of the BU Center for Antiracist Research. He is an Ideas Columnist at the Atlantic and a correspondent with CBS News. He is the author of five books, including Stamped from the Beginning: The Definitive History of Racist Ideas in America, which won the National Book Award for Nonfiction; the New York Times bestsellers How to Be an Antiracist and Stamped: Racism, Antiracism, and You, coauthored with Jason Reynolds; and Antiracist Baby."},"bookImage":"https://images-us.bookshop.org/ingram/9781568585987.jpg?height=500&v=v2"}},{"bookName":"Stamped from the Beginning: The Definitive History of Racist...","bookAuthor":"Ibram X Kendi","bookPrice":"$19.98 $18.58","linkDetail":"https://bookshop.org/books/stamped-from-the-beginning-the-definitive-history-of-racist-ideas-in-america-9781568585987/9781568585987","bookDetail":{"bookDetail":{"price":"$21.38","sale":"$22.99","PublishDate":"October 28, 2014","Publisher":"Melville House Publishing","Pages":"560","Dimensions":"5.6 X 8.1 X 1.6 inches | 1.14 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"David Graeber","about":"David Graeber (1961-2020) was a professor of anthropology at the London School of Economics. One of the original organizers of Occupy Wall Street, Graeber was also the author of Utopia of Rules and wrote widely for publications such as The Guardian, Harper's, The Baffler, n+1, The Nation, The New Inquiry, and The New Left Review."},"bookImage":"https://images-us.bookshop.org/ingram/9781612194196.jpg?height=500&v=v2"}},{"bookName":"Debt: The First 5,000 Years, Updated and Expanded","bookAuthor":"David Graeber","bookPrice":"$22.99 $21.38","linkDetail":"https://bookshop.org/books/debt-the-first-5-000-years-updated-and-expanded/9781612194196","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"April 30, 2019","Publisher":"Penguin Group","Pages":"336","Dimensions":"5.2 X 7.7 X 0.9 inches | 0.55 pounds","Languages":"English","Type":"Paperback","description":["Tor.com"," "," "]},"Author":{"name":"Jason Baumann New York Public Library Edmund White","about":"Jason Baumann coordinator of humanities and LGBT Collections at the New York Public Library, where he develops and promotes literature, philosophy, and religion collections at the Stephen A. Schwarzman Building. Baumann coordinates the Library's LGBT Initiative, for which he has curated two exhibitions--1969: The Year of Gay Liberation and Why We Fight: Remembering AIDS Activism. Baumann will curate a major Stonewall exhibit at NYPL for 2019. Edmund White is the author of A Boy's Own Story (1982), The Beautiful Room Is Empty (1988) and The Farewell Symphony (1997). He received the National Book Critics Circle Award for Genet: A Biography. He won the 2018 PEN/Saul Bellow Award for Achievement in American Fiction."},"bookImage":"https://images-us.bookshop.org/ingram/9780143133513.jpg?height=500&v=v2"}},{"bookName":"The Stonewall Reader","bookAuthor":"","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/the-stonewall-reader/9780143133513","bookDetail":{"bookDetail":{"price":"$29.76","sale":"$32.00","PublishDate":"March 15, 2022","Publisher":"Liveright Publishing Corporation","Pages":"624","Dimensions":"6.45 X 9.71 X 1.56 inches | 2.22 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Fintan O'Toole","about":"Fintan O'Toole is a columnist with, and assistant editor of The Irish Times. He is adjunct professor at the school of Language, Culture and Communication at the University of Limerick and Leonard Milberg lecturer in Irish Studies at Princeton. He has been drama critic for The Sunday Tribune, The Irish Times and the New York Daily News. His work on political and cultural issues has appeared in The New Yorker, The New York Review of Books, The New York Times, and The Guardian. He was presenter of the BBC cultural magazine programme, The Late Show, and Literary Advisor to the Abbey Theatre. His many books include The Ex-Isle of Erin; Shakespeare Is Hard But So Is Life; A Traitor's Kiss: the Life of Richard Brinsley Sheridan; White Savage: Sir William Johnson and the Invention of America; The Irish Times Book of the 1916 Rising and Ship of Fools: How Stupidity and Corruption Sank the Celtic Tiger."},"bookImage":"https://images-us.bookshop.org/ingram/9781631496530.jpg?height=500&v=v2"}},{"bookName":"An African American and Latinx History of the United States","bookAuthor":"Paul Ortiz","bookPrice":"$16.00 $14.88","linkDetail":"https://bookshop.org/books/an-african-american-and-latinx-history-of-the-united-states/9780807005934","bookDetail":{"bookDetail":{"price":"$14.88","sale":"$16.00","PublishDate":"December 11, 2018","Publisher":"Beacon Press","Pages":"296","Dimensions":"6.0 X 8.9 X 0.9 inches | 0.95 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Paul Ortiz","about":"Paul Ortiz is a professor of history and the director of the Samuel Proctor Oral History Program at the University of Florida. He is the author of Emancipation Betrayed: The Hidden History of Black Organizing and White Violence from Reconstruction to the Bloody Election of 1920 and coeditor of the oral history Remembering Jim Crow: African Americans Tell About Life in the Segregated South. He lives in Gainesville, Florida."},"bookImage":"https://images-us.bookshop.org/ingram/9780807005934.jpg?height=500&v=v2"}},{"bookName":"The Rise and Fall of the Neoliberal Order: America and the...","bookAuthor":"Gary Gerstle","bookPrice":"$27.95 $25.99","linkDetail":"https://bookshop.org/books/the-rise-and-fall-of-the-neoliberal-order-america-and-the-world-in-the-free-market-era/9780197519646","bookDetail":{"bookDetail":{"price":"$16.73","sale":"$17.99","PublishDate":"April 28, 2015","Publisher":"Basic Books","Pages":"416","Dimensions":"5.4 X 8.1 X 1.2 inches | 0.75 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Alfred Lansing","about":"Alfred Lansing (1921-1975) was a native of Chicago. After serving more than five years in the Navy, he enrolled at Northwestern University, where he studied journalism. Until 1949 he edited a weekly newspaper in Illinois, later joined the United Press, and eventually became a freelance writer."},"bookImage":"https://images-us.bookshop.org/ingram/9780465062881.jpg?height=500&v=v2"}},{"bookName":"All the President's Men","bookAuthor":"Bob Woodward and Carl Bernstein","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/all-the-president-s-men/9781476770512","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"June 03, 2014","Publisher":"Simon & Schuster","Pages":"384","Dimensions":"5.5 X 8.3 X 1.0 inches | 0.8 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Carl Bernstein Bob Woodward","about":"Bob Woodward is an associate editor at The Washington Post where he has worked for 50 years. He has shared in two Pulitzer Prizes, one for his Watergate coverage and the other for coverage of the 9/11 terrorist attacks. He has authored 20 national bestselling books, 14 of which have been #1 New York Times bestsellers. Carl Bernstein is a contributing editor for Vanity Fair magazine and has written for a variety of publications. He is the author of Loyalties: A Son's Memoir, and has coauthored His Holiness: John Paul II and the History of Our Time with Marco Politi, as well as All the President's Men and The Final Days with Bob Woodward."},"bookImage":"https://images-us.bookshop.org/ingram/9781476770512.jpg?height=500&v=v2-68265a54913f446cf921c95879017340"}},{"bookName":"Endurance: Shackleton's Incredible Voyage","bookAuthor":"Alfred Lansing","bookPrice":"$17.99 $16.73","linkDetail":"https://bookshop.org/books/endurance-shackleton-s-incredible-voyage/9780465062881","bookDetail":{"bookDetail":{"price":"$25.99","sale":"$27.95","PublishDate":"April 05, 2022","Publisher":"Oxford University Press, USA","Pages":"336","Dimensions":"6.55 X 9.52 X 1.42 inches | 1.5 pounds","Languages":"English","Type":"Hardcover","description":["the word neoliberal is often used to condemn a broad swath of policies, from prizing free market principles over people to advancing privatization programs in developing nations around the world. ","neoliberalism was and why its worldview had such persuasive hold on both the right and the left for three decades. As he shows, the neoliberal order that emerged in America in the 1970s fused ideas of deregulation with personal freedoms, open borders with cosmopolitanism, and globalization with the","promise of increased prosperity for all. Along with tracing how this worldview emerged in America and grew to dominate the world, Gerstle explores the previously unrecognized extent to which its triumph was facilitated by the collapse of the Soviet Union and its communist allies. He is also the","first to chart the story of the neoliberal order's fall, originating in the failed reconstruction of Iraq and Great Recession of the Bush years and culminating in the rise of Trump and a reinvigorated Bernie Sanders-led American left in the 2010s. ","\n      "]},"Author":{"name":"Gary Gerstle","about":"Gary Gerstle is Paul Mellon Professor Emeritus at the University of Cambridge. He is the author and editor of more than ten books, including two prizewinners, American Crucible (2017) and Liberty and Coercion (2015). He is a regular contributor to The Guardian and has also written for the AtlanticMonthly, the New Statesman, Dissent, The Nation, Die Zeit, Aeon, and Zocalo, among others. He frequently appears on BBC Radio 4, BBC World Service, ITV 4, Talking Politics, and NPR."},"bookImage":"https://images-us.bookshop.org/ingram/9780197519646.jpg?height=500&v=v2-b2de7e1eac6bdf511f388ea4724309be"}},{"bookName":"Against All Odds: A True Story of Ultimate Courage and...","bookAuthor":"Alex Kershaw","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/against-all-odds-a-true-story-of-ultimate-courage-and-survival-in-world-war-ii/9780593183748","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"March 22, 2022","Publisher":"Dutton Caliber","Pages":"368","Dimensions":"6.33 X 9.44 X 1.3 inches | 1.32 pounds","Languages":"English","Type":"Hardcover","description":[" "]},"Author":{"name":"Alex Kershaw","about":"Alex Kershaw is a journalist and a New York Times bestselling author of books on World War II. Born in York, England, he is a graduate of Oxford University and has lived in the United States since 1994."},"bookImage":"https://images-us.bookshop.org/ingram/9780593183748.jpg?height=500&v=v2-2df73d36de4c318037b12e60086ab58f"}},{"bookName":"Gay Bar: Why We Went Out","bookAuthor":"Jeremy Atherton Lin","bookPrice":"$28.00 $26.04","linkDetail":"https://bookshop.org/books/gay-bar-why-we-went-out/9780316458733","bookDetail":{"bookDetail":{"price":"$16.74","sale":"$18.00","PublishDate":"June 05, 2018","Publisher":"Penguin Books","Pages":"368","Dimensions":"5.5 X 8.3 X 0.9 inches | 0.65 pounds","Languages":"English","Type":"Paperback","description":["Winner of the ","Finalist for the National Book Award"," "," "," "," An explosive expos of the right's relentless campaign to eliminate unions, suppress voting, privatize public education, stop action on climate change, and alter the Constitution. "]},"Author":{"name":"Nancy MacLean","about":"Nancy MacLean is the award-winning author of Behind the Mask of Chivalry (a New York Times noteworthy book of the year) and Freedom is Not Enough, which was called by the Chicago Tribune \"contemporary history at its best.\" The William Chafe Professor of History and Public Policy at Duke University, she lives in Durham, North Carolina."},"bookImage":"https://images-us.bookshop.org/ingram/9781101980972.jpg?height=500&v=v2"}},{"bookName":"Wayward Lives, Beautiful Experiments: Intimate Histories of...","bookAuthor":"Saidiya Hartman","bookPrice":"$17.95 $16.69","linkDetail":"https://bookshop.org/books/wayward-lives-beautiful-experiments-intimate-histories-of-riotous-black-girls-troublesome-women-and-queer-radicals/9780393357622","bookDetail":{"bookDetail":{"price":"$16.69","sale":"$17.95","PublishDate":"January 14, 2020","Publisher":"W. W. Norton & Company","Pages":"464","Dimensions":"5.4 X 8.2 X 1.2 inches | 0.8 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Saidiya Hartman","about":"Saidiya Hartman is the author of Wayward Lives, Beautiful Experiments and Lose Your Mother. A MacArthur Fellow, she has been a Guggenheim Fellow, Cullman Fellow, and Fulbright Scholar. She is a University Professor at Columbia University and lives in New York."},"bookImage":"https://images-us.bookshop.org/ingram/9780393357622.jpg?height=500&v=v2"}},{"bookName":"Democracy in Chains: The Deep History of the Radical Right's...","bookAuthor":"Nancy MacLean","bookPrice":"$18.00 $16.74","linkDetail":"https://bookshop.org/books/democracy-in-chains-the-deep-history-of-the-radical-right-s-stealth-plan-for-america/9781101980972","bookDetail":{"bookDetail":{"price":"$26.04","sale":"$28.00","PublishDate":"February 09, 2021","Publisher":"Little Brown and Company","Pages":"320","Dimensions":"5.6 X 8.3 X 1.3 inches | 0.96 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Jeremy Atherton Lin","about":"Jeremy Atherton Lin is an Asian-American essayist based in Los Angeles and East Sussex, England. His work has appeared inthe Times Literary Supplement, the Guardian, GQ, Artforum and The Yale Review, for which he was shortlisted for a National Magazine Award. Jeremy's debut book Gay Bar was listed in the New York Times Critics' Top Books of 2021 and received the National Book Critics Circle Award for Autobiography. His next cultural memoir, Deep House, will bepublished in 2024."},"bookImage":"https://images-us.bookshop.org/ingram/9780316458733.jpg?height=500&v=v2"}},{"bookName":"How Baseball Happened: Outrageous Lies Exposed! the True...","bookAuthor":"Thomas W. Gilbert","bookPrice":"$28.95 $26.92","linkDetail":"https://bookshop.org/books/how-baseball-happened-outrageous-lies-exposed-the-true-story-revealed-9781665011723/9781567926774","bookDetail":{"bookDetail":{"price":"$15.81","sale":"$17.00","PublishDate":"April 03, 2018","Publisher":"Vintage","Pages":"400","Dimensions":"5.1 X 7.9 X 0.9 inches | 0.8 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"David Grann","about":"David Grann is a staff writer at The New Yorker and the best-selling author of The Lost City of Z, which was chosen as one of the best books of the year by The New York Times, The Washington Post, and other publications and has been translated into more than twenty-five languages. He is also the author of The Devil and Sherlock Holmes. His work has garnered several honors for outstanding journalism, including a George Polk Award."},"bookImage":"https://images-us.bookshop.org/ingram/9780307742483.jpg?height=500&v=v2"}},{"bookName":"The Book of Fun: An Illustrated History of Having a Good Time","bookAuthor":"Russ Frushtick and Sonny Ross","bookPrice":"$25.00 $23.25","linkDetail":"https://bookshop.org/books/the-book-of-fun-an-illustrated-history-of-having-a-good-time/9780762480487","bookDetail":{"bookDetail":{"price":"$26.92","sale":"$28.95","PublishDate":"September 15, 2020","Publisher":"David R. Godine Publisher","Pages":"384","Dimensions":"6.2 X 9.1 X 1.6 inches | 1.55 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Thomas W. Gilbert John Thorn","about":"Thomas W. Gilbert is the author of many baseball books, including Baseball and the Color Line, Roberto Clemente and Playing First. From his Greenpoint, Brooklyn stoop he can throw a baseball to the former site of the Manor House tavern, where members of the Eckford Baseball Club enjoyed a post game drink or two in the 1850s.John Thorn is the Official Baseball Historian for Major League Baseball and the author of numerous books including Baseball in the Garden of Eden: The Secret History of the Early Game and Total Baseball: The Official Encyclopedia of Major League Baseball."},"bookImage":"https://images-us.bookshop.org/ingram/9781567926774.jpg?height=500&v=v2-81ff5b1097e47575d1a202cd72b4959f"}},{"bookName":"Grace: President Obama and Ten Days in the Battle for America","bookAuthor":"Cody Keenan","bookPrice":"$29.99 $27.89","linkDetail":"https://bookshop.org/books/grace-president-obama-and-ten-days-in-the-battle-for-america/9780358651895","bookDetail":{"bookDetail":{"price":"$23.25","sale":"$25.00","PublishDate":"June 14, 2022","Publisher":"Running Press Adult","Pages":"128","Dimensions":"6.74 X 8.77 X 0.47 inches | 1.04 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Russ Frushtick Sonny Ross","about":"Russ Frushtick is the co-founder of Vox Media's games vertical Polygon. He has covered video games and technology for over a decade, writing for The New York Times, Edge Magazine and The Verge. Sonny Ross is a freelance Illustrator based in the UK whose clients include The New York Times, The Washington Post, The Guardian, Google, Polygon, and many others."},"bookImage":"https://images-us.bookshop.org/ingram/9780762480487.jpg?height=500&v=v2"}},{"bookName":"Killers of the Flower Moon: The Osage Murders and the Birth...","bookAuthor":"David Grann","bookPrice":"$17.00 $15.81","linkDetail":"https://bookshop.org/books/killers-of-the-flower-moon-the-osage-murders-and-the-birth-of-the-fbi/9780307742483","bookDetail":{"bookDetail":{"price":"$27.89","sale":"$29.99","PublishDate":"October 04, 2022","Publisher":"Mariner Books","Pages":"320","Dimensions":"","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Cody Keenan","about":""},"bookImage":"https://images-us.bookshop.org/ingram/9780358651895.jpg?height=500&v=v2"}},{"bookName":"The Bomber Mafia: A Dream, a Temptation, and the Longest...","bookAuthor":"Malcolm Gladwell","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/the-bomber-mafia-a-dream-a-temptation-and-the-longest-night-of-the-second-world-war-9780316296816/9780316296618","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"April 27, 2021","Publisher":"Little Brown and Company","Pages":"256","Dimensions":"5.75 X 8.3 X 1.0 inches | 0.79 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Malcolm Gladwell","about":"Malcom Gladwell is the author of seven New York Times bestsellers: The Tipping Point, Blink, Outliers, What the Dog Saw, David and Goliath, Talking to Strangers, and The Bomber Mafia. He is also the cofounder of Pushkin Industries, an audiobook and podcast production company. He was born in England, grew up in rural Ontario, and now lives in New York."},"bookImage":"https://images-us.bookshop.org/ingram/9780316296618.jpg?height=500&v=v2"}}]