[{"bookName":"Chasing Me to My Grave: An Artist's Memoir of the Jim Crow South","bookAuthor":"Erin I Kelly and Winfred Rembert","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/chasing-me-to-my-grave-an-artist-s-memoir-of-the-jim-crow-south-9798200682911/9781635576597","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"September 07, 2021","Publisher":"Bloomsbury Publishing","Pages":"304","Dimensions":"7.43 X 10.27 X 1.18 inches | 2.47 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Winfred Rembert Erin I Kelly Bryan Stevenson","about":"Winfred Rembert (1945 - 2021) was an artist from Cuthbert, Georgia. His paintings on carved and tooled leather have been exhibited at museums and galleries across the country, and compared to the work of Jacob Lawrence, Romare Bearden, and Horace Pippin. Rembert was honored by the Equal Justice Initiative in 2015, awarded a United States Artists Barr Fellowship in 2016, and is the subject of two award-winning documentary films: All Me and Ashes to Ashes. In the last decades of his life, he lived and worked in New Haven, Connecticut. He was posthumously awarded the 2022 Pulitzer Prize in Biography for Chasing Me to My Grave. https: //winfredrembert.com/ Erin I. Kelly earned her PhD from Harvard and is Professor of Philosophy at Tufts University. She specializes in ethics and criminal law and is the author of The Limits of Blame: Rethinking Punishment and Responsibility (Harvard University Press, 2018). She was awarded the 2022 Pulitzer Prize in Biography for Chasing Me to My Grave. erinikelly.com"},"bookImage":"https://images-us.bookshop.org/ingram/9781635576597.jpg?height=500&v=v2-8fa6329675229eea794aca531879b086"}},{"bookName":"Chinatown Pretty: Fashion and Wisdom from Chinatown's Most...","bookAuthor":"Valerie Luu and Andria Lo","bookPrice":"$24.95 $23.20","linkDetail":"https://bookshop.org/books/chinatown-pretty-fashion-and-wisdom-from-chinatown-s-most-stylish-seniors/9781452175805","bookDetail":{"bookDetail":{"price":"$23.20","sale":"$24.95","PublishDate":"September 22, 2020","Publisher":"Chronicle Books","Pages":"224","Dimensions":"7.4 X 9.3 X 0.9 inches | 1.75 pounds","Languages":"English","Type":"Hardcover","description":["- The style is a mix of modern and vintage, high and low, handmade and store bought clothing.","- This is a celebration of Chinese American culture, active old-age, and creative style. ","- Chinatown Pretty has been featured by Vogue.com, ","- With a textured cover and glossy bellyband, this beautiful volume makes a deluxe gift.","- Add it to the shelf with books like "]},"Author":{"name":"Andria Lo Valerie Luu","about":"Valerie Luu is a writer and one-half of the Vietnamese pop-up restaurant Rice Paper Scissors. She lives in San Francisco. Andria Lo is a freelance photographer whose work has been featured in the San Francisco Chronicle, the New York Times, and Wired. She lives in Berkeley."},"bookImage":"https://images-us.bookshop.org/ingram/9781452175805.jpg?height=500&v=v2"}},{"bookName":"Dress Code: Unlocking Fashion from the New Look to Millennial...","bookAuthor":"Véronique Hyland","bookPrice":"$16.98 $15.79","linkDetail":"https://bookshop.org/books/dress-code-unlocking-fashion-from-the-new-look-to-millennial-pink-9780063050839/9780063050839","bookDetail":{"bookDetail":{"price":"$15.79","sale":"$16.98","PublishDate":"March 15, 2022","Publisher":"Harper Perennial","Pages":"288","Dimensions":"5.2 X 7.9 X 0.8 inches | 0.45 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Véronique Hyland","about":"Véronique Hyland is ELLE's fashion features director. Her work has previously appeared in the New York Times, the New Yorker, W, New York magazine, Harper's Bazaar, and Condé Nast Traveler."},"bookImage":"https://images-us.bookshop.org/ingram/9780063050839.jpg?height=500&v=v2-2d9e40e66976306f12488add00000000"}},{"bookName":"Make Your Art No Matter What: Moving Beyond Creative Hurdles","bookAuthor":"Beth Pickens","bookPrice":"$18.95 $17.62","linkDetail":"https://bookshop.org/books/make-your-art-no-matter-what-moving-beyond-creative-hurdles/9781452182957","bookDetail":{"bookDetail":{"price":"$17.62","sale":"$18.95","PublishDate":"April 06, 2021","Publisher":"Chronicle Books","Pages":"208","Dimensions":"6.0 X 8.0 X 1.0 inches | 0.9 pounds","Languages":"English","Type":"Paperback","description":["- PRACTICAL AND POSITIVE: This book is both a love letter to art and artists and a hands-on guide to approaching the thorniest problems those artists might face. Pickens offers a warm reminder that you are not alone, that what you do matters, and that someone out there wants you to succeed.","- TIMELESS TOPIC: Like a trusted advisor, this book is an invaluable resource jam-packed with strategies for building a successful creative practice. From mixing business and friendship to marketing yourself on social media, this book can help. And it will--again and again. ","- Writers, musicians, filmmakers, and other creatives","- Art and design school graduates and grad-gift givers\n      "]},"Author":{"name":"Beth Pickens","about":"Beth Pickens is a consultant for artists and arts organizations with a master's degree in counseling psychology and a decade of experience. She is also the author of Your Art Will Save Your Life (2018, Feminist Press). She lives in Los Angeles with her wife and pets."},"bookImage":"https://images-us.bookshop.org/ingram/9781452182957.jpg?height=500&v=v2"}},{"bookName":"Stunning Watercolor Seascapes: Master the Art of Painting...","bookAuthor":"Kolbie Blume","bookPrice":"$22.99 $21.38","linkDetail":"https://bookshop.org/books/stunning-watercolor-seascapes-master-the-art-of-painting-oceans-rivers-lakes-and-more/9781645674801","bookDetail":{"bookDetail":{"price":"$21.38","sale":"$22.99","PublishDate":"May 17, 2022","Publisher":"Page Street Publishing","Pages":"192","Dimensions":"7.82 X 9.02 X 0.53 inches | 1.17 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Kolbie Blume","about":"Kolbie Blume is the author of Wilderness Watercolor Landscapes and the creator of the popular watercolor and calligraphy Instagram account This Writing Desk. She also teaches watercolor workshops and classes on Skillshare. She lives in the DC-Metro area with her family."},"bookImage":"https://images-us.bookshop.org/ingram/9781645674801.jpg?height=500&v=v2"}},{"bookName":"Black Futures","bookAuthor":"Kimberly Drew and Jenna Wortham","bookPrice":"$40.00 $37.20","linkDetail":"https://bookshop.org/books/black-futures/9780399181139","bookDetail":{"bookDetail":{"price":"$37.20","sale":"$40.00","PublishDate":"December 01, 2020","Publisher":"One World","Pages":"544","Dimensions":"7.6 X 9.2 X 1.5 inches | 3.16 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Kimberly Drew Jenna Wortham","about":"Kimberly Drew is a writer, curator, and activist. Drew received her B.A. from Smith College in art history and African-American studies. During her time at Smith, she launched the Tumblr blog Black Contemporary Art, which has featured artwork by nearly 5,000 black artists. Drew's writing has appeared in Vanity Fair, Elle UK, and Glamour. She lives in Brooklyn, New York (just a few blocks away from Jenna Wortham). Jenna Wortham is a staff writer for The New York Times Magazine. She is also co-host of the podcast Still Processing, as well as a sound healer, reiki practitioner, and herbalist, all of which she lovingly practices on Kimberly Drew. She is currently working on a book about the body and dissociation. She lives in Brooklyn, New York."},"bookImage":"https://images-us.bookshop.org/ingram/9780399181139.jpg?height=500&v=v2"}},{"bookName":"What Can a Body Do?: How We Meet the Built World","bookAuthor":"Sara Hendren","bookPrice":"$27.00 $25.11","linkDetail":"https://bookshop.org/books/what-can-a-body-do-how-we-meet-the-built-world/9780735220003","bookDetail":{"bookDetail":{"price":"$25.11","sale":"$27.00","PublishDate":"August 18, 2020","Publisher":"Riverhead Books","Pages":"240","Dimensions":"6.2 X 9.4 X 1.0 inches | 0.9 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Sara Hendren","about":"Sara Hendren is an artist, design researcher, and writer who teaches design for disability at Olin College of Engineering. Her work has been exhibited widely and is held in the permanent collections of MoMA and the Cooper Hewitt design museum; her writing and design work have been featured in The New York Times and Fast Company and on NPR. Hendren has been a fellow at New America and the Carey Institute for Global Good. She lives in Cambridge, Massachusetts, with her husband and children."},"bookImage":"https://images-us.bookshop.org/ingram/9780735220003.jpg?height=500&v=v2"}},{"bookName":"Living in Data: A Citizen's Guide to a Better Information Future","bookAuthor":"Jer Thorp","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/living-in-data-a-citizen-s-guide-to-a-better-information-future/9780374189907","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"May 04, 2021","Publisher":"MCD","Pages":"320","Dimensions":"6.4 X 8.4 X 1.5 inches | 1.25 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Jer Thorp","about":"Jer Thorp is an artist, a writer, and a teacher. He was the first data artist in residence at The New York Times, he is a National Geographic Explorer, and he served as the innovator in residence at the Library of Congress in 2017 and 2018. He lives under the Manhattan Bridge with his family and his awesome dog, Trapper John, MD. Living in Datais his first book."},"bookImage":"https://images-us.bookshop.org/ingram/9780374189907.jpg?height=500&v=v2"}},{"bookName":"There and Back: Photographs from the Edge","bookAuthor":"Jimmy Chin","bookPrice":"$50.00 $46.50","linkDetail":"https://bookshop.org/books/there-and-back-photographs-from-the-edge/9781984859501","bookDetail":{"bookDetail":{"price":"$46.50","sale":"$50.00","PublishDate":"December 07, 2021","Publisher":"Ten Speed Press","Pages":"320","Dimensions":"10.0 X 12.2 X 1.2 inches | 4.3 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Jimmy Chin","about":"Jimmy Chin is an Academy Award-winning filmmaker, National Geographic photographer, and professional mountain sports athlete. He has led or participated in cutting-edge expeditions around the world for over twenty years, including significant first ascents on all seven continents, and his photographs have graced the covers of National Geographic Magazine and the New York Times Magazine. Jimmy also co-produces and co-directs with his wife, Chai Vasarhelyi. Their film Meru won the Audience Award at the Sundance Film Festival and was on the Oscar shortlist for Best Documentary Feature. Their documentary Free Solo won a BAFTA, seven primetime Emmys, and the Academy Award for Best Documentary Feature. Jimmy, Chai, and their two children split their time between New York City and Jackson Hole, Wyoming."},"bookImage":"https://images-us.bookshop.org/ingram/9781984859501.jpg?height=500&v=v2"}},{"bookName":"The Design of Everyday Things","bookAuthor":"Don Norman","bookPrice":"$18.99 $17.66","linkDetail":"https://bookshop.org/books/the-design-of-everyday-things-9780465050659/9780465050659","bookDetail":{"bookDetail":{"price":"$17.66","sale":"$18.99","PublishDate":"November 05, 2013","Publisher":"Basic Books","Pages":"368","Dimensions":"5.4 X 8.2 X 1.0 inches | 0.66 pounds","Languages":"English","Type":"Paperback","description":{}},"Author":{"name":"Don Norman","about":"Don Norman is a co-founder of the Nielsen Norman Group, and holds graduate degrees in both engineering and psychology. His many books include Emotional Design, The Design of Future Things, and Living with Complexity. He lives in Silicon Valley, California."},"bookImage":"https://images-us.bookshop.org/ingram/9780465050659.jpg?height=500&v=v2"}},{"bookName":"A Tree a Day","bookAuthor":"Amy-Jane Beer","bookPrice":"$24.95 $23.20","linkDetail":"https://bookshop.org/books/a-tree-a-day/9781797214887","bookDetail":{"bookDetail":{"price":"$23.20","sale":"$24.95","PublishDate":"April 05, 2022","Publisher":"Chronicle Books","Pages":"368","Dimensions":"6.1 X 8.1 X 1.1 inches | 1.9 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Amy-Jane Beer","about":"Amy-Jane Beer is a biologist and writer. She has written more than 30 books about science and natural history including Cool Nature and The A-Z of Wildlife Watching. She has also edited a number of wildlife publications including Animals, Animals, Animals and Wildlife World magazine. Beer is a Country Diarist for The Guardian, and feature writer for BBC Wildlife magazine, BBC Countryfile, and the Yorkshire Post."},"bookImage":"https://images-us.bookshop.org/ingram/9781797214887.jpg?height=500&v=v2"}},{"bookName":"The New Black West Hc: Photographs from America's Only...","bookAuthor":"Gabriela Hasbun","bookPrice":"$40.00 $37.20","linkDetail":"https://bookshop.org/books/the-new-black-west-hc-photographs-from-america-s-only-touring-black-rodeo/9781797208893","bookDetail":{"bookDetail":{"price":"$37.20","sale":"$40.00","PublishDate":"May 10, 2022","Publisher":"Chronicle Books","Pages":"144","Dimensions":"8.6 X 11.0 X 0.7 inches | 1.9 pounds","Languages":"English","Type":"Hardcover","description":["- History buffs and anyone interested in Western cowboy culture","- Lovers of immersive fine-art photography books\n      "]},"Author":{"name":"Gabriela Hasbun","about":"As a photographer specializing in portraits, Gabriela Hasbun's work highlights the marginalized and unexplored communities around her. Growing up in El Salvador during a devastating civil war, Hasbun learned the importance of documenting the humanity in people others have overlooked. Her fundamental belief in the radical power of storytelling has led her to subjects like Black cowboys, fat activists, queer skateboarders, and the people of the Mission district in San Francisco. At the heart of her photography is a celebration of the complexities of identity and the human spirit."},"bookImage":"https://images-us.bookshop.org/ingram/9781797208893.jpg?height=500&v=v2-65f12cdcc42f29c046ca9ed0cdfc31a3"}},{"bookName":"Franz Kafka: The Drawings","bookAuthor":"Andreas Kilcher and Pavel Schmidt","bookPrice":"$50.00 $46.50","linkDetail":"https://bookshop.org/books/franz-kafka-the-drawings/9780300260663","bookDetail":{"bookDetail":{"price":"$46.50","sale":"$50.00","PublishDate":"May 31, 2022","Publisher":"Yale University Press","Pages":"368","Dimensions":"8.42 X 11.76 X 1.31 inches | 4.29 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Andreas Kilcher Pavel Schmidt Judith Butler","about":"Andreas Kilcher is professor of literature and cultural studies at ETH Zurich. Pavel Schmidt is an artist and researcher. Judith Butler is Maxine Elliot Professor of Comparative Literature at the University of California, Berkeley. Kurt Beals is associate professor of German and comparative literature at Washington University in St. Louis."},"bookImage":"https://images-us.bookshop.org/ingram/9780300260663.jpg?height=500&v=v2-a60c2d64ad35fccfe4bcd4b217bc1160"}},{"bookName":"Pretty Good House","bookAuthor":"Michael Maines, Emily Mottram, et al.","bookPrice":"$34.99 $32.54","linkDetail":"https://bookshop.org/books/pretty-good-house/9781641551656","bookDetail":{"bookDetail":{"price":"$32.54","sale":"$34.99","PublishDate":"June 28, 2022","Publisher":"Taunton Press","Pages":"256","Dimensions":"","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Michael Maines Daniel Kolbert Emily Mottram","about":"Michael Maines is a residential designer specializing in energy-efficient homes, sensitive renovations, and custom kitchens. He is a contributing editor to Fine Homebuilding magazine.Dan Kolbert is a carpenter and contractor, and for the past 10 years has been moderator of the original building science discussion group in Portland, Maine, where the Pretty Good House idea originated.Emily Mottram is the founder and principal of Mottram Architecture, specializing in new homes and renovations that are beautiful, functional, comfortable, healthy, and durable."},"bookImage":"https://images-us.bookshop.org/ingram/9781641551656.jpg?height=500&v=v2-aa11cd7d315ef84b466725f4997944fa"}},{"bookName":"One More Lap: Jimmie Johnson and the #48","bookAuthor":"Jimmie Johnson and Ivan Shaw","bookPrice":"$48.00 $44.64","linkDetail":"https://bookshop.org/books/one-more-lap-jimmie-johnson-and-the-48/9780847872015","bookDetail":{"bookDetail":{"price":"$44.64","sale":"$48.00","PublishDate":"September 27, 2022","Publisher":"Rizzoli International Publications","Pages":"272","Dimensions":"","Languages":"English","Type":"Hardcover","description":["\n      "]},"Author":{"name":"Jimmie Johnson Ivan Shaw Michael Jordan","about":"Jimmie Johnson is an American professional auto-racing driver. Ivan Shaw produces art photography books. Michael Jordan is an American businessman and former professional basketball player."},"bookImage":"https://images-us.bookshop.org/ingram/9780847872015.jpg?height=500&v=v2"}},{"bookName":"A Portrait of Walt Disney World: 50 Years of the Most Magical...","bookAuthor":"Steven Vagnini, Tim O'Day, et al.","bookPrice":"$60.00 $55.80","linkDetail":"https://bookshop.org/books/a-portrait-of-walt-disney-world-50-years-of-the-most-magical-place-on-earth/9781368052849","bookDetail":{"bookDetail":{"price":"$55.80","sale":"$60.00","PublishDate":"September 28, 2021","Publisher":"Disney Editions","Pages":"320","Dimensions":"9.2 X 12.8 X 1.4 inches | 4.75 pounds","Languages":"English","Type":"Hardcover","description":{}},"Author":{"name":"Kevin Kern Tim O'Day Steven Vagnini Bob Chapek","about":"Kevin M. Kern began his career with the Walt Disney Archives in 2011. As the group's manager of research, he works predominantly with historical documents and artwork, and helps to facilitate company legacy and outreach projects, including oral histories and the development and installation of museum exhibitions. He's hosted special event programming for many business units across The Walt Disney Company and has had his writing featured in numerous publications.Tim O'Day is a successful writer, public relations executive, ideation consultant, and events producer. His creative spark was behind creating an Olympic-size lap pool at Disneyland for U.S. Olympian swimmers, procuring a Disneyland star on the Hollywood Walk of Fame, placing Dumbo in the Smithsonian, securing Dame Julie Andrews as the Disneyland 50th anniversary honorary ambassador, and having the pardoned White House Thanksgiving turkeys retire to the Disney parks. He has worked with almost all the Disney Legends and helped secure the National Medal of Arts from President George W. Bush for the legendary songwriters Richard and Robert Sherman in a White House ceremony. He most recently contributed to the Behind the Attractiondocuseries, which will be releasing on Disney+. Steven Vagnini is a show awareness producer for Walt Disney Imagineering, where he curates the stories behind the parks, resort hotels, and other experiences of the Walt Disney World Resort. He previously served on the staffs of the Walt Disney Archives, D23, and Disney Corporate Creative Resources after several years as a Walt Disney World cast member. He has produced a variety of special events, including for the Walt Disney World 40th and EPCOT 30th and 35th anniversaries, plus has written for several Disney publications, including having collaborated with Disney Legend Dave Smith on the latest editions of Disney A to Z: The Official Encyclopedia. Cover artist Fabiola Garza is a character artist at Disney Creative group in Orlando, Florida. During her career she has had the pleasure of working on The Little Golden Book for Pixar's Coco and designing the beloved turtle 'Olu Mel for Aulani, A Disney Resort & Spa. She is also the author and illustrator of the award-winning children's book A Boy Who Became Pope: The Story of Saint John Paul II. During her free time she enjoys ballroom dancing, the work of G. K. Chesterton, and contributing to Catholic publications and podcasts. Her favorite Walt Disney World attraction is Spaceship Earth."},"bookImage":"https://images-us.bookshop.org/ingram/9781368052849.jpg?height=500&v=v2"}},{"bookName":"Tarot of the Divine: A Deck and Guidebook Inspired by...","bookAuthor":"Yoshi Yoshitani","bookPrice":"$19.99 $18.59","linkDetail":"https://bookshop.org/books/tarot-of-the-divine-a-deck-and-guidebook-inspired-by-deities-folklore-and-fairy-tales-from-around-the-world-tarot-cards/9780593135143","bookDetail":{"bookDetail":{"price":"$18.59","sale":"$19.99","PublishDate":"September 01, 2020","Publisher":"Clarkson Potter Publishers","Pages":"78","Dimensions":"4.8 X 6.3 X 1.9 inches | 1.0 pounds","Languages":"English","Type":"Other","description":["- Illustrator Yoshi Yoshitani brings fables, ancient mythologies, and spiritual legends to life on the Major and Minor Arcana cards, inspired by the cultural traditions of China, Japan, Peru, Norway, Persia, England, Greece, Denmark, the Maori tribe of New Zealand, and more.","- The companion guidebook provides insight into how these fables from around the globe support traditional tarot imagery and themes.\n      "]},"Author":{"name":"Yoshi Yoshitani","about":"Yoshi Yoshitani is a California-based artist whose vibrant illustrations draw on inspiration from across the globe, with a particular focus on multicultural identity. Past clients include Disney, DC Comics, Valiant, Image, DreamWorks, and Netflix. Yoshi spends time researching world mythologies, listening to audiobooks, creating fashion inspiration boards, and attending comic conventions and art expos across the country."},"bookImage":"https://images-us.bookshop.org/ingram/9780593135143.jpg?height=500&v=v2-4626ead175de5263cf2accc64704be79"}},{"bookName":"The Bright Ages: A New History of Medieval Europe","bookAuthor":"David M. Perry and Matthew Gabriele","bookPrice":"$29.99 $27.89","linkDetail":"https://bookshop.org/books/the-bright-ages-a-new-history-of-medieval-europe/9780062980892","bookDetail":{"bookDetail":{"price":"$27.89","sale":"$29.99","PublishDate":"December 07, 2021","Publisher":"Harper","Pages":"336","Dimensions":"6.4 X 9.2 X 1.3 inches | 1.1 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Matthew Gabriele David M. Perry","about":"Matthew Gabriele is a professor of medieval studies and chair of the department of religion and culture at Virginia Tech. He is the author of the book An Empire of Memory: The Legend of Charlemagne, the Franks, and Jerusalem before the First Crusade, many articles on medieval Europe and the memory of the Middle Ages, and has edited several academic volumes. His public writing has appeared in numerous newspapers and magazines, and interviews with him have aired locally, nationally, and internationally.David Perry is a journalist, medieval historian, and senior academic advisor in the history department at the University of Minnesota. He was formerly a professor of history at Dominican University. Perry is the author of Sacred Plunder: Venice and the Aftermath of the Fourth Crusade, and his writing on history, disability, politics, parenting, and other topics has appeared in the New York Times, the Washington Post, the Nation, the Atlantic, and CNN.com, among others."},"bookImage":"https://images-us.bookshop.org/ingram/9780062980892.jpg?height=500&v=v2-e1190d76f5fcccf3d05c3add00000000"}},{"bookName":"Continuous Discovery Habits: Discover Products that Create...","bookAuthor":"Teresa Torres","bookPrice":"$19.99 $18.59","linkDetail":"https://bookshop.org/books/continuous-discovery-habits-discover-products-that-create-customer-value-and-business-value/9781736633304","bookDetail":{"bookDetail":{"price":"$18.59","sale":"$19.99","PublishDate":"April 14, 2021","Publisher":"Product Talk LLC","Pages":"244","Dimensions":"6.0 X 9.0 X 0.55 inches | 0.8 pounds","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Teresa Torres","about":"Teresa Torres is an internationally acclaimed consultant and speaker. She helps product managers, designers, and software engineers ensure that they are building the right products for their customers and their businesses. She's coached hundreds of teams at companies of all sizes, from early-stage startups to global enterprises, in a wide variety of industries. She has helped over 7,000 product people develop their discovery skills through the Product Talk Academy and is the author of the popular blog Product Talk."},"bookImage":"https://images-us.bookshop.org/ingram/9781736633304.jpg?height=500&v=v2"}},{"bookName":"Subpar Parks: America's Most Extraordinary National Parks and...","bookAuthor":"Amber Share","bookPrice":"$22.00 $20.46","linkDetail":"https://bookshop.org/books/subpar-parks-america-s-most-extraordinary-national-parks-and-their-least-impressed-visitors/9780593185544","bookDetail":{"bookDetail":{"price":"$20.46","sale":"$22.00","PublishDate":"July 13, 2021","Publisher":"Plume Books","Pages":"224","Dimensions":"7.32 X 9.14 X 0.74 inches | 1.44 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Amber Share","about":"Amber Share is an illustrator and graphic designer based in Raleigh, North Carolina. She graduated from the University of Nebraska in 2010 with a degree in advertising and a minor in art. After several years as a professional graphic designer working on hand-lettering and illustration on the side, she left her job in graphic design to pursue illustration full time. As an avid hiker and backpacker, she spends a lot of time in local, state, and national parks, which inspired this project and this book."},"bookImage":"https://images-us.bookshop.org/ingram/9780593185544.jpg?height=500&v=v2-6940b713fad5504fe24849bd29d0c574"}},{"bookName":"The Literary Witches Oracle: A 70-Card Deck and Guidebook:...","bookAuthor":"Taisia Kitaiskaia and Katy Horan","bookPrice":"$19.98 $18.58","linkDetail":"https://bookshop.org/books/the-literary-witches-oracle-a-70-card-deck-and-guidebook-oracle-cards/9781984824714","bookDetail":{"bookDetail":{"price":"$18.58","sale":"$19.98","PublishDate":"August 27, 2019","Publisher":"Clarkson Potter Publishers","Pages":"","Dimensions":"4.9 X 6.4 X 2.1 inches | 1.14 pounds","Languages":"English","Type":"Other","description":["- Includes 30 cards featuring prominent female writers and trailblazers as well as 40 symbol cards bearing illustrations of potent spiritual icons to enhance your reading.","- Find inspiration from literary heroes, such as Virginia Woolf and Toni Morrison, and discover the wisdom of lesser-known trailblazers, such as Yumiko Kurahashi and Mirabai.","- Use the included guidebook as an interpreter to help you interpret the cards based on your specific intentions, the writers' dominant traits, and the spiritual symbols at play.\n      "]},"Author":{"name":"Taisia Kitaiskaia Katy Horan","about":"TAISIA KITAISKAIA is the author of Literary Witches: A Celebration of Magical Women Writers, a collaboration with artist Katy Horan;Ask Baba Yaga: Otherworldly Advice for Everyday Troubles; and The Nightgown and Other Poems. Her work has been translated into several languages, and she has received fellowships from the James A. Michener Center for Writers and The Corporation of Yaddo. KATY HORAN is an artist and illustrator based in Austin, Texas. Her fine art work has been shown in galleries across the US and Canada and featured in three issues of New American Paintings. Her illustration clients include Pop Up Magazine, Fantagraphics, Chronicle Books, Bust Magazine, Cadabra Records, and Birth, Movies, Death."},"bookImage":"https://images-us.bookshop.org/ingram/9781984824714.jpg?height=500&v=v2"}},{"bookName":"The Black Experience in Design: Identity, Expression, &...","bookAuthor":"","bookPrice":"$19.98 $18.58","linkDetail":"https://bookshop.org/books/the-black-experience-in-design-identity-expression-reflection/9781621537854","bookDetail":{"bookDetail":{"price":"$18.58","sale":"$19.98","PublishDate":"February 01, 2022","Publisher":"Allworth","Pages":"312","Dimensions":"","Languages":"English","Type":"Paperback","description":[]},"Author":{"name":"Jennifer Rittner Anne H. Berry Kareem Collie Penina Acayo Laker","about":"Anne H. Berry is a writer and educator whose research focuses on race/representation in the field of design. Her writing has been published in AIGA's Eye on Design, Communication Arts, and the inaugural issue of the anthology Recognize featuring essays and commentary from indigenous people and people of color. Kareem Collie is a designer, strategist, and educator specializing in collaborative and human-centered design approaches to capture, reveal, and produce visual and experiential narratives. He holds a master's degree from NYU in culture and communication studies and a bachelor's in fine arts from Pratt Institute in communication design. Penina Acayo Laker is a designer and educator whose practice and research is centered around topics that utilize a human-centered approach to solving social problems, locally and internationally. She is currently broadening the scope and access of design education to young people in Uganda through her DesignEd workshops. Dr. Lesley-Ann Noel focuses on equity, social justice, and the experiences of people who are often excluded from design education, research and practice. She promotes greater critical awareness among designers and design students by introducing critical theory concepts and vocabulary into the design studio e.g. through The Designer's Critical Alphabet and the Positionality Wheel. Jennifer Rittner is a writer and educator. She is currently Visiting Assistant Professor in the School of Design Strategies at Parsons School of Design. Her work has been published in the New York Times, DMI: Journal, AIGA Eye on Design, and Core77; and in 2021 served as guest editor for a special issue on Design & Policing for Design Museum magazine. Jennifer earned her B.A. from the Gallatin School of Individualized Studies at New York University and her M.Ed. in Communication and Education at Columbia University's Teachers College. Kelly Walters is a designer, educator and founder of the multidisciplinary design studio Bright Polka Dot. Her ongoing design research interrogates the complexities of identity formation, systems of value, and the shared vernacular in and around Black visual culture. She is the author of Black, Brown ] Latinx Design Educators: Conversations on Design and Race published by Princeton Architectural Press. Kelly is an Assistant Professor and Associate Director of the BFA Communication Design Program at Parsons School of Design at The New School in New York."},"bookImage":"https://images-us.bookshop.org/ingram/9781621537854.jpg?height=500&v=v2-90e1b15ad0e6e2c34209998c73fc0ba4"}},{"bookName":"You Are an Artist: Assignments to Spark Creation","bookAuthor":"Sarah Urist Green","bookPrice":"$26.00 $24.18","linkDetail":"https://bookshop.org/books/you-are-an-artist-assignments-to-spark-creation/9780143134091","bookDetail":{"bookDetail":{"price":"$24.18","sale":"$26.00","PublishDate":"April 14, 2020","Publisher":"Penguin Books","Pages":"256","Dimensions":"7.3 X 9.2 X 0.8 inches | 1.5 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Sarah Urist Green","about":"Sarah Urist Green is the creator, curator, and host of The Art Assignment, an educational video series produced in partnership with PBS Digital Studios that focuses on the creative process and the act of making. She is also the former curator of contemporary art at the Indianapolis Museum of Art. She holds a master of arts in modern art history from Columbia University and a bachelor of arts from Northwestern University. She lives in Indianapolis with her husband, the author John Green, and their two children."},"bookImage":"https://images-us.bookshop.org/ingram/9780143134091.jpg?height=500&v=v2"}},{"bookName":"One Drop: Shifting the Lens on Race","bookAuthor":"Yaba Blay","bookPrice":"$30.00 $27.90","linkDetail":"https://bookshop.org/books/one-drop-shifting-the-lens-on-race/9780807073360","bookDetail":{"bookDetail":{"price":"$27.90","sale":"$30.00","PublishDate":"February 16, 2021","Publisher":"Beacon Press","Pages":"288","Dimensions":"9.2 X 9.1 X 0.9 inches | 2.47 pounds","Languages":"English","Type":"Hardcover","description":["Is Blackness a matter of biology or consciousness?","Who determines who is Black and who is not?","Who's Black, who's not, and who cares? "]},"Author":{"name":"Yaba Blay","about":"Dr. Yaba Blay is a scholar-activist and cultural creative whose work centers the lived experiences of Black women and girls. She has launched viral campaigns including #PrettyPeriod and #ProfessionalBlackGirl and has appeared on CNN, BET, MSNBC, and NPR. Dr. Blay's work has been featured in the New York Times, Ebony, Essence, and The Root. A thought leader on Black racial identity, colorism, and beauty politics, she is a globally sought-after speaker and consultant. Connect with her online at yabablay.com."},"bookImage":"https://images-us.bookshop.org/ingram/9780807073360.jpg?height=500&v=v2"}},{"bookName":"Julia Watson. Lo--Tek. Design by Radical Indigenism","bookAuthor":"Julia Watson","bookPrice":"$50.00 $46.50","linkDetail":"https://bookshop.org/books/julia-watson-lo-tek-design-by-radical-indigenism/9783836578189","bookDetail":{"bookDetail":{"price":"$46.50","sale":"$50.00","PublishDate":"December 13, 2019","Publisher":"Taschen","Pages":"420","Dimensions":"6.9 X 9.6 X 1.1 inches | 2.3 pounds","Languages":"English","Type":"Hardcover","description":[]},"Author":{"name":"Julia Watson Studio Taschen (f)","about":"Designer, activist, academic and author Julia Watson is the principal of her eponymously named design studio working at the intersection of anthropology, ecology, innovation, and collaborates as Watson Salembier, a full-service landscape & urban design studio specializing in rewilding. Julia also lectures and consults with Fortune 500 companies to align their missions with global sustainability goals, by designing and implementing systemic change for their Sustainability, Innovation & Futures sectors. She regularly teaches Urban Design at Harvard and Columbia University. After graduating from Harvard with the highest award for her work on conservation and spiritual landscapes, she has been published in ioARCH, Topos, Seacities, LAF, The Philosophy of Dumbness, Nakhara Journal, Water Urbanisms East, World Heritage Sites and Living Culture of Indonesia, and co-authored the Spiritual Guide to Bali's UNESCO World Heritage with Dr. J. Stephen Lansing.Piera Wolf and Claudine Eriksson are W--E studio, a multidisciplinary creative studio based in Zürich and New York that strives to bridge time and space between these constantly evolving and contrasting cities. Piera and Claudine have individually been recognized by publications and organizations including The New York Times, Dazed Digital, Rolling Stone, Slanted, and many more. Talks, teaching, and workshop engagements include the New York School of Visual Arts, HTW Berlin, Google Creative Lab, and the Zürich University of the Arts."},"bookImage":"https://images-us.bookshop.org/ingram/9783836578189.jpg?height=500&v=v2"}}]